{"author":"feyrath","body":"I just borrowed this book from the library and I wanted to recommend it to anyone just starting out on the Genealogy / Family History path.  It's a good introduction, with lots of ideas and helpful hints.  At 137 pages you can read it in a couple of nights, and come back to the sections you want to focus on.","timestamp":"2011-11-06T22:14:56.000-08:00","score":1,"subreddit":"Genealogy","ups":1,"daytype":"weekend","day_of_week":7}
{"author":"KPLauritzen","body":"Ents from r/trees?","timestamp":"2011-11-07T11:38:05.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"illepic","body":"This needs to be in /r/ programming stat.","timestamp":"2011-11-06T23:00:22.000-08:00","score":27,"subreddit":"xkcd","ups":27,"daytype":"weekend","day_of_week":7}
{"author":"another_user_name","body":"I thought it was T/S and P/J.","timestamp":"2011-11-07T07:35:41.000-08:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":1}
{"author":"herenseti","body":"I actually love randall for this. He has combined my two favourite things","timestamp":"2011-10-14T15:26:30.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"kindall","body":"It's arguably fair use, which would mean the record company would probably lose the case, but that doesn't keep them from suing you.","timestamp":"2011-10-14T12:33:55.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":5}
{"author":"Shiniholum","body":"Its how my dorm room is right now","timestamp":"2011-10-14T15:00:44.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"cldellow","body":"I think this part from the lecture is quite good:\n\n\n&gt; And run it…\n\n&gt; error: polymorphic expression cannot be instantiated to expected type;\n\n&gt; found   : [T(in method apply)]Example1OpsExp.this.MatrixNew[T(in method apply)]\n\n&gt; required: Example1OpsExp.this.Rep[Matrix[T(in method matrix_new)]] def matrix_new[T:Manifest](x: Exp[Int], y: Exp[Int]) = MatrixNew(x,y)\n&gt;\n&gt; What the hell?\n\n&gt; Debugging is painful – we’re working on it","timestamp":"2011-09-05T15:09:52.000-07:00","score":2,"subreddit":"scala","ups":2,"daytype":"weekday","day_of_week":1}
{"author":"marcodr13","body":"...[corrected to $1,219](http://xkcd.com/947/)","timestamp":"2011-09-06T14:59:20.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":2}
{"author":"Qubed","body":"Well, to be fair, at minimum wage you probably need to work about two months.","timestamp":"2011-09-05T11:54:31.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"Purp","body":"Wow it really is, is this comic just a viral marketing campaign?","timestamp":"2011-08-19T06:43:47.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":5}
{"author":"themastersb","body":"If it was there, it's gone now.","timestamp":"2011-08-19T10:52:47.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":5}
{"author":"xjeepdotorg","body":"You can have my 5 karma if you so wish.","timestamp":"2011-08-18T07:27:19.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":4}
{"author":"MSkog","body":"Suddenly I want an armed revolt against baseball. I'm not sure why. ","timestamp":"2011-10-04T22:11:05.000-07:00","score":6,"subreddit":"xkcd","ups":6,"daytype":"weekday","day_of_week":2}
{"author":"holocarst","body":"I never beleived I could be said seeing a XKCD on a Thursday :(","timestamp":"2011-10-06T06:24:10.000-07:00","score":21,"subreddit":"xkcd","ups":21,"daytype":"weekday","day_of_week":4}
{"author":"Romulet","body":"Raptors infect cancer in their more wily prey to lure them out of hiding.","timestamp":"2011-10-06T11:59:50.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":4}
{"author":"MSkog","body":"[FedEx logo](http://i.imgur.com/57fjb.jpg), for those who weren't aware and want the reference.","timestamp":"2011-10-04T21:02:08.000-07:00","score":11,"subreddit":"xkcd","ups":11,"daytype":"weekday","day_of_week":2}
{"author":"arbuthnot-lane","body":"I guess you just want a pictures of you and Willie May\npushing that shopping cart down the block on the dead run,\nor trying to slide that color television into a stolen ambulance.  \nNo luck, brother. The revolution will not be televised.","timestamp":"2011-10-05T19:29:49.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"holocarst","body":"Woah, I really fucked that up, thanks. That's what you get for only typing with one hand.","timestamp":"2011-10-06T09:07:26.000-07:00","score":5,"subreddit":"xkcd","ups":5,"daytype":"weekday","day_of_week":4}
{"author":"Mayday72","body":"Wow, complicated comic. I still don't really get it even after reading that.","timestamp":"2011-10-14T05:50:07.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"nasajack","body":"http://en.wikipedia.org/wiki/Xorg.conf","timestamp":"2011-10-12T13:48:08.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":3}
{"author":"el0rg","body":"what's an album cover? you mean like.. folder.jpg? ","timestamp":"2011-10-14T06:50:20.000-07:00","score":21,"subreddit":"xkcd","ups":21,"daytype":"weekday","day_of_week":5}
{"author":"lebean","body":"Only one line editted in sendmail.mc, to set DS.  DS = smarthost running Postfix.  Sendmail is just not worth hassling wtih for anything but the most simple setups.","timestamp":"2011-10-12T13:49:38.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":3}
{"author":"marshmallowhug","body":"He addressed it too: http://blog.xkcd.com/2011/08/24/earthquakes/.","timestamp":"2011-08-24T08:53:34.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":3}
{"author":"V2Blast","body":"Put a space between the link and the comma (reddit assumes it's part of the link), or just [use some \"title\"/description text for the link](http://www.rainbowsymphony.com/freestuff.html).","timestamp":"2011-08-22T22:35:40.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"TheSaddestPenguin","body":"But why does the book hover too?","timestamp":"2011-08-24T07:37:37.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"myotheralt","body":"Always a relevant xkcd.","timestamp":"2011-08-23T19:49:26.000-07:00","score":27,"subreddit":"xkcd","ups":27,"daytype":"weekday","day_of_week":2}
{"author":"maniacnf","body":"I dunno, I was wondering that. If light was reflected from the record onto some sort of photoresister maybe?","timestamp":"2011-08-22T14:46:07.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"maniacnf","body":"I don't know if you'd need code, you could probably do it with changing voltages, not sure though. http://www.elpj.com/about/ says it's analog. I'm not going toe-to-toe with an audiophile, though haha.","timestamp":"2011-08-24T07:10:43.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"plbogen","body":"If I lived in Nebraska, I would welcome the fiery death of coherent waves of grain.","timestamp":"2011-10-21T07:39:56.000-07:00","score":5,"subreddit":"xkcd","ups":5,"daytype":"weekday","day_of_week":5}
{"author":"MSkog","body":"Wave-particle duality reference. Specifically, that particles have wave-like effects unless observed/measured, at which point they have particle-like effects. \n\nIn the event you're unfamiliar with the double-slit experiment, [this video](http://www.youtube.com/watch?v=DfPeprQ7oGc) is a good 5-minute summary appropriate for /r/explainlikeimfive. Worth it if you don't know about it, promise. ","timestamp":"2011-10-21T01:49:23.000-07:00","score":9,"subreddit":"xkcd","ups":9,"daytype":"weekday","day_of_week":5}
{"author":"ahmad_84","body":"Pemeriksaan mata terus ke pintu rumah anda..","timestamp":"2011-10-22T03:16:28.000-07:00","score":1,"subreddit":"optometry","ups":1,"daytype":"weekend","day_of_week":6}
{"author":"stevage","body":"I'm not sure what to make of this, but I've seen 23 to 32, but not before or after.","timestamp":"2011-05-04T20:41:54.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"andreasvc","body":"I didn't interpret it as a blow. I think in the end the teaching is much more productive, creative and general than the specific feats we can let computers do for us.","timestamp":"2011-05-04T17:15:52.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"flibadab","body":"A basic Y-DNA test can tell you your grandfather's surname with a fairly high degree of certainty, assuming other people with that surname have done the test.  What it actually tells you is the probability that you share a common ancestor with someone.  The probability is higher the farther back you go--so, for example, there might be a 90-something percent chance you shared a common ancestor in the last 12 generations.  Since Y-DNA traces paternal ancestry only (your father's father's father, etc.), it's likely they will have the same surname as your grandfather.  If you watch for special offers or do it through a family association, you might get it for $100.  If you're fairly certain about Wooldridge, look for the Wooldridge discussion list on rootsweb.\nIn the meantime, check out the free stuff.  Your local library may have ancestry.com and Heritage Quest available for use.  The mormons have some census records and other info at https://www.familysearch.org/.  The LDS family history centers can also be used by anyone for free, though you might be creeped out by overhearing people talk about sacred underwear.","timestamp":"2011-05-04T09:38:11.000-07:00","score":2,"subreddit":"Genealogy","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"Broan13","body":"It is supposed to be a way to understand how the math \"looks\" and \"acts\" not to give you always a realistic picture of it, but a simplified version which you can use to see how the different properties relate to each other.\n\nOur models even are simplifications of reality or models there of, but it honestly has felt like at least half of physics is drawing a picture and determining geometric relations from the drawing (see E&amp;M)","timestamp":"2011-05-06T00:31:09.000-07:00","score":6,"subreddit":"xkcd","ups":6,"daytype":"weekday","day_of_week":5}
{"author":"base736","body":"Really?  I'm a teacher, and loved it.  In fact, it was emailed around the school the day it came out.","timestamp":"2011-05-06T08:56:12.000-07:00","score":7,"subreddit":"xkcd","ups":7,"daytype":"weekday","day_of_week":5}
{"author":"flabbergasted1","body":"The problem with the rubber-sheet analogy is that we don't actually see how time factors into this at all, and it seems that the massive object is bending space rather than space-time.  Here's a neat little mental image that I think better helps understand what gravity is without relying on a previous understanding of gravity:\n\nImagine a very simple two-dimensional universe contained entirely within a circular disk sitting upright in space.  To make this universe easier to comprehend, we will perceive the time dimension instead as a third spacial dimension (left-to-right, in our visualization), so the eternity of this universe – past, present, and future – can be viewed as an infinitely long cylinder. In this visualization, the lives and journeys of any point creatures which live in this universe will be represented by infinitely long threads which can wiggle around as they travel down the time axis but never turn back on themselves.\n\nNow imagine our disk-universe has a very massive object sitting still at its center.  With our time axis, we visualize this as a thick bar extending straight out to the right and left, centered at the axis of our cylinder.  This infinite rod, by nature of being very massive, has an odd effect on its surroundings: it curves the very fabric of the disk-universe in such a way that, as we go forward on our time axis, the spacial dimensions actual shrink toward the central mass, causing our space-time visualization to look something like [this horn](http://www.kazoos.com/store/graphics/00000001/acme_horn.jpg) (here diagonally down and to the right is the forward-in-time direction).  Note that this shape is not really accurate and more for illustrative purposes, as the warping is actually weaker as you get further from the center of mass.\n\nWhat effect does this curvature have on objects in this universe? Imaginary a stationary point on the rim of the disk. Without the central mass, this point's thread would extend as a straight line for all of time. But because of how the mass has warped our universe, the thread will be forced to inch closer to the central rod as we progress along the time axis.  And it's not just the points on the outer rim that are affected, of course; it's as if we've taken the pre-warp cylindrical space-time and squeezed it towards its central axis like Play-Doh, with every thread inside it, however wandering its path, being tightened in accordingly.  The effect this warping has on the paths of objects in the universe is called gravitation.\n\nBut we don't live in a two-dimensional disk, so let's try to quickly work our way up to a reasonably realistic universe.  First, replace the disk with the entire two-dimensional plane (imagine it standing vertically like a wall, to remain somewhat analogous to before).  Now if we have a rod of mass (or really, a wandering thread of mass, because massive objects are of course permitted to roam about in space) then it doesn't quite pull in the lip of the horn as before because there is no perimeter of space to tighten.  Instead, we can think of it as sort of tugging, in a way, on the fiber of space-time in such a way that a thread near it will be tightened inward as we go forward along the time axis (our metaphorical Play-Doh is still being squeezed inwards, but now there's no end to the Play-Doh in sight).  Next, we have to realize that there are multiple objects with mass all engaged in a game of cosmic tug-of-war on the fabric of space-time, pulling point threads and each other around.\n\nTo get even closer to reality, we can make one of these massive objects into a flat, circular planet (a cylinder, including our time dimension) and one of our points into a man somewhat above the surface of the planet. As space-time contracts around the planet's center of mass, the man is pulled in toward the planet, and so his humanoid prism along the time dimension slants down toward the center of mass until it reaches resistance at the planet's surface. Now, if your brain can handle it (and mine certainly can't) then replace the two spacial dimensions with three, and consider the time dimension to be the fourth – and now you have a somewhat more accurate geometric visualization of gravitation.\n\n**tl;dr** – by considering simple universes and visualizing the time dimension as an extra spacial dimension, we can see the effects of gravity without needing to rely on the prior knowledge assumed in the rubber-sheet analogy","timestamp":"2011-05-06T18:26:55.000-07:00","score":209,"subreddit":"xkcd","ups":209,"daytype":"weekday","day_of_week":5}
{"author":"Meretrice","body":"In Ancestry.com I found an Edgar Poe in Haysville, KS. His spouse was listed as 'Darlene.' He was born 10 Jul 1920. ","timestamp":"2011-05-04T03:06:59.000-07:00","score":2,"subreddit":"Genealogy","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"GLneo","body":"This is Monday's comic dude...","timestamp":"2011-03-10T15:51:53.000-08:00","score":6,"subreddit":"xkcd","ups":6,"daytype":"weekday","day_of_week":4}
{"author":"jdh30","body":"&gt; It's not necessarily a solved problem in the context of the JVM. It's not obvious to me that the degree of Java interop offered by Clojure and Scala can be maintained with the trampolining approach of Kawa. Even if it can be, you still take a performance hit.\n\nThere are certainly trade-offs but the statement \"every language is missing tail calls on the Hotspot JVM\" is not true.\n\n&gt; No one seems to complain about this.\n\nI have complained about that before. I even quantified the amount of code devoted to type annotations in major OCaml, SML and Haskell open source projects.\n\n&gt; I can't say I spend more than 0.1% of my total programming and design time writing such things down.\n\nCluttered source code degrades readability and maintainability. I see type annotations as a source of clutter.\n\n&gt; it saves time because it makes reading other people's code easier\n\nI beg to differ.\n\n&gt; ...it allows the compiler to give better type error messages\n\nOnly in the presence of advanced type systems.\n\n&gt; And again, it's not as if it failed because it's bad. It \"failed\" because many of the type system features in Scala greatly complicate type inference -- it's undecidable in the general case. Rather than infer non-prinicipal types or other potentially confusing things, Scala requires signatures on function parameters. This seems like a reasonable compromise to me. I'd challenge you to do better given the features in Scala.\n\nExactly. I don't value the extra features of Scala's type system so I would not take them as a given. I think Scala is well into diminishing returns, an extremum among type systems of purely academic interest. Adding esoteric features at the expense of type inference is cutting your nose off to spite your face.\n","timestamp":"2011-03-11T06:36:20.000-08:00","score":1,"subreddit":"scala","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"Darwins_Beard","body":"&gt;sometimes rumors are just that.\n\nYou make a good point.  It also makes me remember that genealogy is not a perfect science.  There must be a lot of lot men who end up raising kids that aren't actually theirs.  A name on a birth certificate isn't a sure thing for any of our ancestors, is it?  \n","timestamp":"2011-03-10T16:28:34.000-08:00","score":2,"subreddit":"Genealogy","ups":2,"daytype":"weekday","day_of_week":4}
{"author":"thesolitaire","body":"Keep in mind, once you push back more than a few generations, the people that you find are actually pretty distantly related to you genetically. Of course, the exceptions are your father's father's father's father and so on which contributes a whole chromosome, and your mother's mother's mother, which contributes your mitochondrial DNA.\n\nHonestly, while I love genealogy, I've gotten to the point that most of my ancestors have essentially lost any connection to me - just names and dates, and maybe a couple of other details. And a lot of the time, I really have no idea whether the line is correct - I *know* there are mistakes - which means I'm researching lines that aren't really related to me at all!\n\nStill, I love it because I love the search, especially when I get to sit in some dusty library poring through old newspapers or census records (well.. usually its a microfilm, but you get the idea). Anyways, as was already mentioned, DNA is really only half the equation - a lot of the really important things like traditions and values are entirely unrelated to DNA.\n\nThe way I see it, you're kind of lucky - you get a whole extra line to research, starting with your two grandfathers. Best of luck finding out more about both!","timestamp":"2011-03-11T02:33:48.000-08:00","score":3,"subreddit":"Genealogy","ups":3,"daytype":"weekday","day_of_week":5}
{"author":"maggieed","body":"That's not quite true. A big part of family history is learning about why our parents are the way they are, what about their parents - and their parents, and their parents - shaped them, what experiences did they have, what oral history was passed down, et cetera.\n\nWho we are is so much more than our bloodlines. I was raised mostly by my stepfather, learning about his family helps me learn about him, which helps me learn about myself and my half brother.\n\nMy biological father's father (my paternal grandfather) was raised entirely by his stepfather (who happened to be my grandmother's uncle, no inbreeding, they were step-cousins, not blood cousins.) Anyway, learning about the man I call Great Grandpa (who is actually my great great uncle) tells me more about my grandfather than just about anything I can learn from his biological family, whose name I carried until I got married, so I understand the power of a name - I really do - but you should also realize that the things you believe in, your take on the world, all of that was shaped by the man you called your grandfather.\n\nDon't get me wrong, I think it's wonderful that you want to find out who your real grandfather was, and it's totally natural that you want to learn about him.\n\nBut don't poo poo the impact that your de facto grandfather had upon you, and upon your father, and don't pretend that his history hasn't shaped who you are.\n\nBest of luck, truly.\n\n\n","timestamp":"2011-03-10T16:33:27.000-08:00","score":3,"subreddit":"Genealogy","ups":3,"daytype":"weekday","day_of_week":4}
{"author":"davewhittaker","body":"A second vote for Dispatch (http://dispatch.databinder.net/Dispatch.html), which is what the OAuth here she comes article references.  The documentation is pretty sparse, but I just wrote a little app to populate a Vimeo account and once I got the basics down it worked great.","timestamp":"2011-11-25T11:54:25.000-08:00","score":2,"subreddit":"scala","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"Chumbodonk","body":"My dad just sold his practice and retired, but he had his office for ~35 years.  One of my aunts is an optometrist in Ontario, but I haven't been in touch with her in a long time.  I'll see if either of them can get some responses to you.","timestamp":"2011-11-25T08:02:54.000-08:00","score":1,"subreddit":"optometry","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"hintss","body":"I *think* you can right-click&gt;properties, but I'm not sure...","timestamp":"2011-11-25T14:50:15.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"Jonwilks","body":"I removing this prick from /etc/sudoers","timestamp":"2011-10-17T17:45:25.000-07:00","score":0,"subreddit":"xkcd","ups":0,"daytype":"weekday","day_of_week":1}
{"author":"stevage","body":"The first two, yes. But \"the more you spend, the more you save\"? Say there's a 2 for 1 deal for a $10 item. You spend $20, you've \"saved\" $20. You spend $50, you've \"saved\" $50. y=x, no?\n\nOr is he considering that all money spent is subtracted directly from money saved?","timestamp":"2011-03-09T04:13:53.000-08:00","score":4,"subreddit":"xkcd","ups":4,"daytype":"weekday","day_of_week":3}
{"author":"slapchopsuey","body":"No idea how many 'Larkin Bailey (b. ~1878) with a mother Matilda (b. ~1858)' combos are out there, but I did find [this](https://familysearch.org/s/recordDetails/show?uri=http%3A%2F%2Fpilot.familysearch.org%2Frecords%2Ftrk%3A%2Ffsrs%2Frr_205343187%2Fp_328033123&amp;hash=HloWXpZgU9zB10k5M56iYku8TUc%253D) in the 1880 census.","timestamp":"2011-03-07T15:55:51.000-08:00","score":2,"subreddit":"Genealogy","ups":2,"daytype":"weekday","day_of_week":1}
{"author":"SomeIrishGuy","body":"It's happened me a bunch of times (maybe not when buying gum - clothes stores do this a lot though). And for phone numbers or postal addresses. ","timestamp":"2011-03-09T14:34:59.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"cwm44","body":"Spoilsports. ","timestamp":"2011-07-11T07:56:24.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":1}
{"author":"V2Blast","body":"Yeah... I haven't heard anyone talk about it since we watched it (my second time) in AP Psychology in high school (after the AP exams were over, of course).","timestamp":"2011-07-08T17:48:46.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"czernebog","body":"I would guess that the decision was made so that the redistributables you have after compilation don't depend on anything beyond what's in a standard JVM install.","timestamp":"2011-07-09T12:44:56.000-07:00","score":8,"subreddit":"scala","ups":8,"daytype":"weekend","day_of_week":6}
{"author":"Karn3","body":"How many peoples password is now \"correct horse battery staple\"?\n\nEDIT: also this an old comic","timestamp":"2011-10-28T04:41:40.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"hive_worker","body":"A lot of us do think buying a missile launcher should be legal\n","timestamp":"2011-10-28T16:58:24.000-07:00","score":-1,"subreddit":"xkcd","ups":-1,"daytype":"weekday","day_of_week":5}
{"author":"newskul","body":"It's a reference to an article on cracked.com about things we do to make hackers' lives easier, such as using easy to guess passwords. ","timestamp":"2011-10-27T18:06:32.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":4}
{"author":"hive_worker","body":"Comic is funny, alt-text is not. Buying a gun is a constitutional right and you really shouldn't need any ID for it. ","timestamp":"2011-10-28T08:28:23.000-07:00","score":-17,"subreddit":"xkcd","ups":-17,"daytype":"weekday","day_of_week":5}
{"author":"Hukeshy","body":"ha, took me a moment...","timestamp":"2011-10-28T04:47:58.000-07:00","score":5,"subreddit":"xkcd","ups":5,"daytype":"weekday","day_of_week":5}
{"author":"Bubblebath_expert","body":"That's what I was thinking about. Imagine this thought-experiment:\n\nYou sent a pole through the door. A self propelled pole, a long flying cilynder. And it slowly goes through the door at the required speed to get through in 1 minute. \n\nNow assume that there is a conservation of momentum and flow regardless of the side you look something going though. Whichever side you stand on, you will observe the pole going in or out at the same speed.\n\nGiven how little time passes in the real world compared to Narnia, you could theoretically go back with the pole after receiving it and arrive before the pole even finished going through, since less than a minute would have passed in the real world!\n\nNow let's assume the opposite: there is a change of flow identical to the change in the passage of time.\n\nLet's say that the propulsion of the pole is on its rear. While it is halfway through, someone standing in Narnia would see it coming N times slower. When the rear end would finally go through after one minutes, N minutes would have passed for the front end. Conversely, on its way back, the 1 minute passage would go take 1/N minutes for the front end. Such a change of entry time is in fact a change of velocity. Passage toward the real world would propel you at N times the speed you had.\n\nWith N ranging in the tens of thousands at least and maybe in the millions, this is a significant difference. We should expect something walking at 5km/h to enter the real world at over 50,000km/h. Since this is not corroborated by the stories, we should assume that this second assumption is false.\n\nUnless there is textual evidence of someone going to Narnia and right back through without colliding with themselves on the way, we cannot outright rule out the first assumption. The consequences of it are great, though. You can break causality: send the pole, get it on the other side, then cross back, and turn it off before it's done corssing: you broke causality. Pull the pole back: there are now two poles, one you saw going through from the other side and one you just pulled out. you can also do the same with people: going slowly in, then go back (on the side or you'll collide with yourself) and pull yourself by the collar.\n\nI'm not knowledgeable enough about the stories to know all the data (I've actually not read/watched anything of it), so perhaps someone would be able to expand on what I said with more informations.","timestamp":"2011-10-27T20:49:22.000-07:00","score":6,"subreddit":"xkcd","ups":6,"daytype":"weekday","day_of_week":4}
{"author":"tritium6","body":"This is beyond me. How do I improve my skills so I can understand this stuff? Seems beyond the usual books I have - Programming in Scala, etc.","timestamp":"2011-10-28T10:31:40.000-07:00","score":2,"subreddit":"scala","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"banai","body":"There is also MyHeritage.com, where you can invite other family members to view/edit your tree. It's free up to 250 people. And unlike Geni, you don't merge with other trees and lose control of your data (others can edit, merge with you without your permission, change the data you entered), if that concerns you.","timestamp":"2011-09-30T00:36:10.000-07:00","score":1,"subreddit":"Genealogy","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"npj","body":"\"That's the tragedy of you're a dick.\" I can't wait to use this.","timestamp":"2011-09-30T02:49:30.000-07:00","score":16,"subreddit":"xkcd","ups":16,"daytype":"weekday","day_of_week":5}
{"author":"scohoe","body":"I think [ge.tt](http://ge.tt/) works pretty well","timestamp":"2011-09-28T16:45:36.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"banai","body":"Have you ordered their death certificates? You could get the names of their spouses or possibly children. The informant is often a family member, even if it doesn't always specify the relationship.\n\nTry the California marriage and death indexes at Ancestry. If you can find their marriages, you can check for their kids in the birth index, which lists mother's maiden name.\n\nI don't have Ancestry access at home, but there's a Missouri marriage for Clyde A Robirds. And a few for Richard Robirds, all with different middle names. You'd have to look at the records to verify by their birthdates or parents' names. Then try to find their kids.","timestamp":"2011-09-30T00:16:21.000-07:00","score":1,"subreddit":"Genealogy","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"itsnotlupus","body":"crawl review sites, spot consistently contrarian reviewers, hack the gibson, snail-mail raw meat, wait for death as Man in Hat narrows in on you.\n\n","timestamp":"2011-09-29T23:23:42.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":4}
{"author":"runagate","body":"Stephen Jay Gould wrote a great article that is relevant to this. [The Median is not the Message](http://www.cancerguide.org/median_not_msg.html)","timestamp":"2011-04-04T22:34:57.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":1}
{"author":"jaybee","body":"Is there a 'scala in industry' site somewhere, available as ammunition against sceptical management? [cufp](http://cufp.org/) is great but focuses on their conference. I was thinking more of something that says **global corp use scala! So do mega inc!**\n\n[Edit] Duh, I suppose that would be http://www.scala-lang.org/node/1658 . And it's a better list than mine :-)","timestamp":"2011-04-06T06:09:48.000-07:00","score":1,"subreddit":"scala","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"gnovos","body":"I thought it means it's a garage.","timestamp":"2011-04-15T21:07:42.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"thebeegirl","body":"There are a few matching his name on Ancestry in what SEEM to be city directories but I can't understand them as they are in German.  It does NOT seem to be a common name which is nice when trying to research.  Good luck!\n\nOh ans since it seems to be such an uncommon name, here is an older match for the name in google books.\n\n  http://books.google.com/books?id=Nb9DAAAAcAAJ&amp;pg=RA2-PA136&amp;dq=%22Wilhelm+Wentzler%22&amp;hl=en&amp;ei=lSeqTerVDYLEgQesv8nzBQ&amp;sa=X&amp;oi=book_result&amp;ct=result&amp;resnum=1&amp;ved=0CCwQ6AEwAA#v=onepage&amp;q=%22Wilhelm%20Wentzler%22&amp;f=false\n\nSorry - I havent been patient enough to figure out how to link.","timestamp":"2011-04-16T16:44:50.000-07:00","score":1,"subreddit":"Genealogy","ups":1,"daytype":"weekend","day_of_week":6}
{"author":"chime","body":"I'm guessing it's a mix between [Klein bottle](http://en.wikipedia.org/wiki/Klein_bottle) and [Escher stairs](http://2.bp.blogspot.com/_2GOp00WR4XM/TSzXJ6HGiWI/AAAAAAAABm4/a4uluYhBNCc/s1600/escher-stairs-g.gif).","timestamp":"2011-04-15T06:48:53.000-07:00","score":10,"subreddit":"xkcd","ups":10,"daytype":"weekday","day_of_week":5}
{"author":"hive_worker","body":"No there have been many many other terrible ones too.","timestamp":"2011-12-26T19:07:21.000-08:00","score":4,"subreddit":"xkcd","ups":4,"daytype":"weekday","day_of_week":1}
{"author":"PervaricatorGeneral","body":"If this is therapy for his fiance/wife's cancer, it seems to be working.","timestamp":"2011-12-27T21:48:01.000-08:00","score":33,"subreddit":"xkcd","ups":33,"daytype":"weekday","day_of_week":2}
{"author":"thorax","body":"I'm different.","timestamp":"2011-06-10T10:55:27.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"greentangent","body":"It completely changes the statement, the challenge will be to move the hyphen in other statements that will radically change their meaning.   I think this sub is up to the challenge.\n ","timestamp":"2011-06-08T18:50:11.000-07:00","score":-2,"subreddit":"xkcd","ups":-2,"daytype":"weekday","day_of_week":3}
{"author":"arnar","body":"Sometimes I get the feeling I'm a schizophrenic and Randall is my other self. :/","timestamp":"2011-06-10T08:13:09.000-07:00","score":5,"subreddit":"xkcd","ups":5,"daytype":"weekday","day_of_week":5}
{"author":"zjburke2","body":"(Ir?)relevant: [Ozma](http://www.youtube.com/watch?v=g7OszilM5Y4) &lt;--- Beware Noisy","timestamp":"2011-06-10T15:03:38.000-07:00","score":1,"subreddit":"scala","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"arnar","body":"Ditto, except now I'm divorced and I name machines after the girls I get. Life *is* good.","timestamp":"2011-06-10T08:11:47.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"perb123","body":"Meat grinder?","timestamp":"2011-10-06T15:29:54.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":4}
{"author":"FpLiOnYkD","body":"I forgot how much I loved this one. ","timestamp":"2011-02-03T10:43:18.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":4}
{"author":"DirtyDirtyPerverts","body":"I love mushrooms. Those little caps are just the most tasty thing I could add to anything. \r\n\r\nEven chopping them up, with a couple of garlic...teeth (right?) and some onion. Put it on some toasted french bread. \r\n\r\nReturning to my *actual* point, mushrooms are what I run out of the most in my house. ","timestamp":"2011-01-31T17:15:19.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":1}
{"author":"hipstr_hop","body":"Thank you!","timestamp":"2011-02-02T18:24:32.000-08:00","score":1,"subreddit":"Genealogy","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"bluesqwerl","body":"Came just to submit or upvote this one.","timestamp":"2011-02-03T07:40:43.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":4}
{"author":"greed_is_good","body":"Or they were too close to their cats to understand","timestamp":"2011-02-03T13:46:54.000-08:00","score":4,"subreddit":"xkcd","ups":4,"daytype":"weekday","day_of_week":4}
{"author":"gantte","body":"The unattainable is unknown!","timestamp":"2011-02-01T23:22:18.000-08:00","score":5,"subreddit":"xkcd","ups":5,"daytype":"weekday","day_of_week":2}
{"author":"althepal","body":"http://www.aarons-jokes.com/joke-168.shtml","timestamp":"2011-02-03T04:42:23.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":4}
{"author":"peddle2themetal","body":"and this is by far the best:  baseball analogy explained\n\nhttp://xkcd.com/540/","timestamp":"2011-02-03T14:52:56.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":4}
{"author":"V2Blast","body":"I read them a while ago... Like when the comic was posted.","timestamp":"2011-02-01T16:54:26.000-08:00","score":9,"subreddit":"xkcd","ups":9,"daytype":"weekday","day_of_week":2}
{"author":"Torocatala","body":"What about http://xkcd.com/393/ ?","timestamp":"2011-02-03T14:44:52.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":4}
{"author":"arbuthnot-lane","body":"I hope you don't keep your mushrooms in a plastic bag in the fridge. Paper bag in a dark place. You can dry them easily. Or freeze them. ","timestamp":"2011-01-31T23:49:55.000-08:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":1}
{"author":"Solnai","body":"Personally, I set my Alarm to \"Cinnamon-thirty.\"","timestamp":"2011-02-03T13:58:45.000-08:00","score":6,"subreddit":"xkcd","ups":6,"daytype":"weekday","day_of_week":4}
{"author":"nuxvomica","body":"[GENS-Italia](http://gens.labo.net/) is a website that I have used to determine the origin and distribution of surnames in my Italian family. If you click on \"La mappa dei cognomi\", you could search for your last name and it will show you a map with locations of persons with that last name. Good luck!","timestamp":"2011-02-02T09:23:21.000-08:00","score":2,"subreddit":"Genealogy","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"godisbacon","body":"I forwarded that one to my coworkers who own cats and no one got it. I work with pretty cold individuals, apparently.","timestamp":"2011-02-03T12:21:11.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":4}
{"author":"nonamejoe","body":"Tracing women in your research is always going to be a problem due to the name change situation.\n\nI think your best bet is, like you said church records, which are a challenge in their own right some times.  \n\nSince you know your grandfather, start with him.  Find his marriage record.  Whatever church he was married in, search those records for his siblings.  If they moved a lot, search for siblings near his age.  I only have experience with Catholic church records.  These records generally show the names of the parents, so you'll be able to find brothers and sisters if they are there.  \n\nOther than that, you're going to have to do it the hard way.  If his name is John Smith from Boston, search ancestry for all relevant.  Then narrow down that list by approximate age.  Then narrow down that list by anything else you know.  Then keep that list and put it in your miscellaneous file, until you come across another clue that may narrow it down.  Once you narrow it down, find the local church for the census you suspect he may be on.  \n\nObviously this is a lot more difficult than searching on ancestry, but this is the fun part.  The unknown.  \n\nGood luck!!","timestamp":"2011-02-02T08:41:40.000-08:00","score":2,"subreddit":"Genealogy","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"argusdusty","body":"I like the Snow Crash reference. Digitoneurolinguistic hacking FTW.","timestamp":"2011-02-03T21:40:20.000-08:00","score":12,"subreddit":"xkcd","ups":12,"daytype":"weekday","day_of_week":4}
{"author":"TopRamen713","body":"I have Julia Child's *The Way to Cook*. I think most beginners could understand it and follow the recipes. Sure, they have more than 3 steps, but she explains techniques simply and well. ","timestamp":"2011-01-31T16:45:45.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"kintaeb","body":"Reddit does not own the Narwhal.","timestamp":"2011-01-19T16:02:42.000-08:00","score":23,"subreddit":"xkcd","ups":23,"daytype":"weekday","day_of_week":3}
{"author":"dundreggen","body":"I lost mine :(  And yes it was great for comments.","timestamp":"2011-01-19T19:56:24.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"HenkPoley","body":"I suspect it should look like a 3D render of stick figures. A kind of meta-joke.","timestamp":"2011-01-17T06:25:15.000-08:00","score":5,"subreddit":"xkcd","ups":5,"daytype":"weekday","day_of_week":1}
{"author":"atimholt","body":"I agree with you so fully, I think I'll Google your user name.","timestamp":"2011-01-18T22:24:04.000-08:00","score":4,"subreddit":"xkcd","ups":4,"daytype":"weekday","day_of_week":2}
{"author":"tian2992","body":"\"back up\"? It seems odd","timestamp":"2011-01-19T19:42:02.000-08:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":3}
{"author":"Mpoumpis","body":"Did.. did you just double click?\n\nOn *the internet*?!","timestamp":"2011-01-20T04:13:42.000-08:00","score":7,"subreddit":"xkcd","ups":7,"daytype":"weekday","day_of_week":4}
{"author":"Dead_Rooster","body":"But, I don't want other people to like the same stuff as me!","timestamp":"2011-01-19T16:41:04.000-08:00","score":9,"subreddit":"xkcd","ups":9,"daytype":"weekday","day_of_week":3}
{"author":"kopaka649","body":"I found this pretty amusing as this just happened in class today. ","timestamp":"2011-01-19T08:55:18.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"sundaryourfriend","body":"It very well might, and at the minimum, they got a lot of page impressions out of this.\n\nIt's better to link to an imgur screenshot when you're posting _against_ the content of a page.","timestamp":"2011-01-20T01:25:51.000-08:00","score":16,"subreddit":"xkcd","ups":16,"daytype":"weekday","day_of_week":4}
{"author":"erkurita","body":"Yeah it does, I agree. The problem comes when she doesn't care if it's interesting or not because it's in English (thus she can't understand it), even though I can explain it.\n\nSubtle things like this comic also go \\**whoosh*\\* over her head. It's a shame, she'd be one hell of a Redditor.","timestamp":"2011-10-24T02:21:27.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":1}
{"author":"account512","body":"You forgot to include \"TV show episode schedules\"","timestamp":"2011-10-24T06:20:36.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":1}
{"author":"folone","body":"http://aperiodic.net/phil/scala/s-99/\nhttp://projecteuler.net/","timestamp":"2011-10-24T00:35:39.000-07:00","score":4,"subreddit":"scala","ups":4,"daytype":"weekday","day_of_week":1}
{"author":"tritium6","body":"I'm pretty sure he fixed it.","timestamp":"2011-07-29T10:44:51.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"Sylocat","body":"...fuck.","timestamp":"2011-07-29T19:54:13.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"gigitrix","body":"There's nothing to say. Poor Randall, and anyone else affected by this. ","timestamp":"2011-07-29T07:41:58.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"_dustinm_","body":"me too. :(","timestamp":"2011-07-29T02:57:14.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"avsa","body":"I wonder if it doesn't actually correlated with a day in the week? Not all woman have their period on exact cycles, and it's common to have one a few days late or soon. It's possible that those changes in cycles are correlated to daily stress, which is correlated to the day of the week.\n\nPure speculation thou.","timestamp":"2011-07-28T10:57:57.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":4}
{"author":"jbrechtel","body":"I'm pretty happy with Emacs + ENSIME these days.  I'm a dirty Vim user so I use Vimpulse with Emacs to get modal editing.  \n\nIntelliJ IDEA with the Scala plugin is pretty good and, most importantly, very frequently improving.  You can follow one of the developers of this plugin on Twitter here: https://twitter.com/pavelfatin\n\nThe main reason I don't use IntelliJ these days are that IntelliJ itself (even without Scala) has some performance problems on my laptop that I can't figure out.  Also, IdeaVIM has some pretty annoying behaviors.","timestamp":"2011-07-23T16:52:20.000-07:00","score":6,"subreddit":"scala","ups":6,"daytype":"weekend","day_of_week":6}
{"author":"urmyheartBeatStopR","body":"I guess you're right and I'm wrong about erasure. Thanks for pointing that out.","timestamp":"2011-07-23T23:42:36.000-07:00","score":5,"subreddit":"scala","ups":5,"daytype":"weekend","day_of_week":6}
{"author":"cutlikeabuffalo","body":"http://i.imgur.com/0MqMM.jpg ","timestamp":"2011-07-25T19:37:28.000-07:00","score":1,"subreddit":"Genealogy","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"petem8","body":"North side, near grand junction. You?","timestamp":"2011-12-15T21:27:04.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":4}
{"author":"iLobdell","body":"Me too.","timestamp":"2011-12-16T00:40:48.000-08:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":5}
{"author":"Lonestar93","body":"Its a little hard to understand without the alt-text. I THINK he's reminiscing about the Phantom Menace hype and implying that maybe some fanboys are still camped outside a cinema, refusing to move lest they lose their place in line.","timestamp":"2011-12-16T01:22:21.000-08:00","score":20,"subreddit":"xkcd","ups":20,"daytype":"weekday","day_of_week":5}
{"author":"HenkPoley","body":"I think he likes to pretend the movie never happened?","timestamp":"2011-12-16T01:21:39.000-08:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":5}
{"author":"GarretFuller","body":"I got the 54th upvote.\n\nI'm proud of myself c:","timestamp":"2011-12-15T03:41:01.000-08:00","score":6,"subreddit":"xkcd","ups":6,"daytype":"weekday","day_of_week":4}
{"author":"emddudley","body":"My favorite software is GRAMPS. http://gramps-project.org/","timestamp":"2011-12-15T14:57:59.000-08:00","score":1,"subreddit":"Genealogy","ups":1,"daytype":"weekday","day_of_week":4}
{"author":"pi_dxdy","body":"Two minuses make a plus!","timestamp":"2011-08-26T16:50:21.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"boookworm0367","body":"I wonder if I know his brother.. i work in Newport News... hmmm\n","timestamp":"2011-08-26T18:05:47.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"cliveholloway","body":"I think this could be a difference between the US and the UK. In the UK they sing, \"Good King Wence'las last looked out\".\n\nAs in Worcester is \"wuss-ter\" rather than the American \"Worse-es-ter\"","timestamp":"2011-10-03T07:17:44.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":1}
{"author":"eyedoc1","body":"Yeah, everything in that thread seemed a little shady. I considered chiming in with some better information but decided to just stay away instead. ","timestamp":"2011-10-04T13:05:39.000-07:00","score":3,"subreddit":"optometry","ups":3,"daytype":"weekday","day_of_week":2}
{"author":"bitofaknowitall","body":"Yes, that's my tree on geni.  I also have a blog that might come up on searches.\n\nI found a page that said a Häcker is a winemaker. But it shows up just three times on that page, which seems a little too common a profession to be winemaker.  So still no idea on that one.","timestamp":"2011-11-13T17:04:35.000-08:00","score":1,"subreddit":"Genealogy","ups":1,"daytype":"weekend","day_of_week":7}
{"author":"feyrath","body":"Like I said it was a guess (although it sure feels correct).  Try your google-fu and/or check your library for references specifically to german  genealogy (I googled \"reading German church records\").  I got on for irish genealogy and it's been very enlightening.\n\nYou might want to try cross posting to r/germany, r/de, r/deutschland and [r/translationfavors](http://www.reddit.com/r/translationfavors)\n\nI also know someone in Switzerland (who speaks and teaches like 10 languages) who would probably be willing to assist but I expect she'd want to be be paid, at least a minimal amount.  She's an artist and is always tight for cash.  If that's something you're willing to do, PM me and I'll put you in touch with her.","timestamp":"2011-11-13T06:45:19.000-08:00","score":1,"subreddit":"Genealogy","ups":1,"daytype":"weekend","day_of_week":7}
{"author":"libbykino","body":"Groundhog Day?  Sometimes February 2 is a tuesday...\n\nThat's all I got &lt;:(","timestamp":"2011-01-04T22:43:43.000-08:00","score":5,"subreddit":"xkcd","ups":5,"daytype":"weekday","day_of_week":2}
{"author":"Quertior","body":"Haha. I remember that almost happened to me in 6th grade. I enjoyed collecting office supplies, and was to be the 15th member of the pen club.","timestamp":"2011-01-02T23:17:53.000-08:00","score":8,"subreddit":"xkcd","ups":8,"daytype":"weekend","day_of_week":7}
{"author":"Craggles_","body":"\"Different tastes can be detected on all parts of the tongue by taste buds,[54] with slightly increased sensitivities in different locations depending on the person, contrary to the popular belief that specific tastes only correspond to specific mapped sites on the tongue.[55] The original tongue map was based on a mistranslation by a Harvard psychologist of a discredited German paper[56] that was written in 1901. In addition, there are not 4 but 5 primary tastes. In addition to bitter, sour, salty, and sweet, humans have taste receptors for umami, which is a savory or meaty taste.\"\n\nI was actually taught this as part of my chemistry curriculum - the wrong aspect with the tongue map. I argued as much as I could but it was actually laughed off. WHO'S LAUGHING NOW?","timestamp":"2011-01-05T06:48:23.000-08:00","score":7,"subreddit":"xkcd","ups":7,"daytype":"weekday","day_of_week":3}
{"author":"arbuthnot-lane","body":"You'll probably have to visit [www.therapistfinder](http://www.therapistfinder.com/) after that.","timestamp":"2011-01-03T07:32:59.000-08:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":1}
{"author":"RickyP","body":"Most large scuba flashlights can't operate in air because they rely on water for cooling.","timestamp":"2011-06-08T10:35:15.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":3}
{"author":"_mdm","body":"He does, but you don't technically need to wait that long to post the url to reddit","timestamp":"2011-06-07T17:22:20.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":2}
{"author":"lazyslacker","body":"If you want to be technical, it's not a rollercoaster, it's a freefall-based ride themed on The Twilight Zone. Awesome ride though. The atmosphere of it and the ride portion (before the freefall) are great.","timestamp":"2011-12-24T22:28:15.000-08:00","score":5,"subreddit":"xkcd","ups":5,"daytype":"weekend","day_of_week":6}
{"author":"salil91","body":"I want your sister!!","timestamp":"2011-12-25T11:38:09.000-08:00","score":5,"subreddit":"xkcd","ups":5,"daytype":"weekend","day_of_week":7}
{"author":"vinnl","body":"There's actually an overview page of people doing that: https://www.xkcd.com/chesscoaster/\n\nThere's *a lot* of them, and it's not even complete as my brother's done it as well and he's not on that page :)\n\nNice job!","timestamp":"2011-12-24T15:26:34.000-08:00","score":9,"subreddit":"xkcd","ups":9,"daytype":"weekend","day_of_week":6}
{"author":"Vozadam","body":"The guy just left of center has done very well for himself","timestamp":"2011-12-24T16:07:04.000-08:00","score":6,"subreddit":"xkcd","ups":6,"daytype":"weekend","day_of_week":6}
{"author":"Zorbotron","body":"Shouldn't it be 3 Heys.","timestamp":"2011-01-24T00:10:23.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"hdeshev","body":"The class attribute thing is a new addition and is a way to implement designer-friendly HTML templates. And it is purely optional. There is another way to call your code from HTML - using custom tags that are mapped to snippet classes. Pick your poison.","timestamp":"2011-01-23T00:16:58.000-08:00","score":1,"subreddit":"scala","ups":1,"daytype":"weekend","day_of_week":7}
{"author":"zenzizi","body":"[ It's a bit rounded up on the lower part but the line is about right ]","timestamp":"2011-01-21T18:04:49.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"accidentalGenius","body":"Do americans not have boxing day? ","timestamp":"2011-01-21T03:29:20.000-08:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":5}
{"author":"p014k","body":"Link to comic, because 'today' is a relative term.\nhttp://www.xkcd.com/849/","timestamp":"2011-01-21T12:46:20.000-08:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":5}
{"author":"escape_goat","body":"Interestingly....  okay, *not* interestingly, the \"na na na\" part was not in the original version of '[Land of a Thousand Dances](http://en.wikipedia.org/wiki/Land_of_a_Thousand_Dances)' as written and recorded by Chris Kenner.","timestamp":"2011-01-24T05:19:01.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":1}
{"author":"sushi_cw","body":"Still hard to read.","timestamp":"2011-01-21T10:01:30.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"Nyax-A","body":"[North America by memory](http://worldviewmap.appspot.com/show.jsp?key=11004) \n\n(Not enough space for all of mexico)","timestamp":"2011-01-23T21:02:23.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekend","day_of_week":7}
{"author":"obligatory_goatkcd","body":"[Regular Version](http://goatkcd.com/851/)\n\n\n[SFW Version](http://goatkcd.com/851/sfw)","timestamp":"2011-01-24T05:56:21.000-08:00","score":-7,"subreddit":"xkcd","ups":-7,"daytype":"weekday","day_of_week":1}
{"author":"sundaryourfriend","body":"What does _doubly_ landlocked mean? ","timestamp":"2011-01-21T07:25:37.000-08:00","score":7,"subreddit":"xkcd","ups":7,"daytype":"weekday","day_of_week":5}
{"author":"raldi","body":"It might be two heys, with the second stretched out into two syllables. ","timestamp":"2011-01-23T23:42:05.000-08:00","score":16,"subreddit":"xkcd","ups":16,"daytype":"weekend","day_of_week":7}
{"author":"crunchy_fetus","body":"Thank you _so_ much.  This is obviously going to be a long project, but I think it'll be worthwhile, and your info is going to help me get going in the right direction.\n\nI feel like a detective!  :)","timestamp":"2011-01-20T16:07:59.000-08:00","score":1,"subreddit":"Genealogy","ups":1,"daytype":"weekday","day_of_week":4}
{"author":"haight-ashbury","body":"And most ISPs block port 80 traffic because hosting a \"server\" on a residential connection is against terms of service... plus the whole dynamic IP address (but there are services like dyndns)","timestamp":"2011-09-09T12:51:07.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"Gtxx","body":"me three!","timestamp":"2011-09-09T21:02:03.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"jezmck","body":"Do you drink bubbles? Or water?","timestamp":"2011-12-05T14:40:00.000-08:00","score":0,"subreddit":"xkcd","ups":0,"daytype":"weekday","day_of_week":1}
{"author":"undergroundbastard","body":"Being from Rhode Island, I had a kind of reverse fallacy of composition thing going on wherein I thought only Rhode Islanders used that term. Thanks for the enlightenment. \n\nWhile we're at it, does anybody outside of RI call subs \"grinders\"? Or milkshakes \"cabinets\"?","timestamp":"2011-12-05T05:28:55.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":1}
{"author":"gigitrix","body":"Title text **makes** this one. Kudos!","timestamp":"2011-12-05T15:17:13.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"GMTao","body":"Jim (the company founder) was great.  I worked with him today to get Scala 2.9.1 support up and running on the site.  Great props to him, and a great site overall.","timestamp":"2011-11-17T19:57:20.000-08:00","score":2,"subreddit":"scala","ups":2,"daytype":"weekday","day_of_week":4}
{"author":"gospelwut","body":"**EDIT**: n/m fixed it thx","timestamp":"2011-11-17T22:52:05.000-08:00","score":56,"subreddit":"xkcd","ups":56,"daytype":"weekday","day_of_week":4}
{"author":"FacelessBureaucrat","body":"Often I fiddle with so many variables at once, though, I don't actually know *what* I did to fix it, I just know it started working again.","timestamp":"2011-11-18T06:32:46.000-08:00","score":6,"subreddit":"xkcd","ups":6,"daytype":"weekday","day_of_week":5}
{"author":"osiux","body":"I hate you. Have an upvote.","timestamp":"2011-11-18T01:29:59.000-08:00","score":4,"subreddit":"xkcd","ups":4,"daytype":"weekday","day_of_week":5}
{"author":"neon_overload","body":"Or someone else saying \"I'm having the same problem, except ... \" and they go on to describe something that appears to be completely unrelated to the OP's problem, and then all future replies are to that other person.","timestamp":"2011-11-18T07:48:42.000-08:00","score":14,"subreddit":"xkcd","ups":14,"daytype":"weekday","day_of_week":5}
{"author":"gtani","body":"Did you say what hotspot switches you'res using?\n\nhttp://groups.google.com/group/jvm-languages/browse_frm/thread/3052f5cdb929e9ee#\n\nhttp://groups.google.com/group/clojure/browse_frm/thread/33f80f1bb8277351#\n\nhttp://blog.headius.com/2009/01/my-favorite-hotspot-jvm-flags.html","timestamp":"2011-11-08T03:54:57.000-08:00","score":1,"subreddit":"scala","ups":1,"daytype":"weekday","day_of_week":2}
{"author":"Korosha","body":"Go to the mobile site:\nm.xkcd.com\n","timestamp":"2011-11-09T11:29:06.000-08:00","score":4,"subreddit":"xkcd","ups":4,"daytype":"weekday","day_of_week":3}
{"author":"Gbjar2","body":"The lack of a roll-over text ruined it for me","timestamp":"2011-07-22T23:25:16.000-07:00","score":9,"subreddit":"xkcd","ups":9,"daytype":"weekday","day_of_week":5}
{"author":"ClerkyLurky","body":"Damrite! FUCK THA GREEKS!","timestamp":"2011-07-22T09:49:19.000-07:00","score":-7,"subreddit":"xkcd","ups":-7,"daytype":"weekday","day_of_week":5}
{"author":"nomad42184","body":"\"Type Erasure is huge on my list.\"\n\nI'm not sure I understand this claim.  Type erasure happens at the JVM level.  Type erasure occurs in generics; period.  The only way around it on the JVM is to explicitly pass around type information.  Scala solves this with manifests and Kotlin solves this with the implicit inclusion of TypeInfo fields.  I think it's a misleading characterization to say that one of these languages has type erasure and the other doesn't.","timestamp":"2011-07-23T04:38:39.000-07:00","score":5,"subreddit":"scala","ups":5,"daytype":"weekend","day_of_week":6}
{"author":"redwall_hp","body":"...unless most of your music listening is on an iPod away from internet access, like most people!","timestamp":"2011-07-22T20:00:10.000-07:00","score":4,"subreddit":"xkcd","ups":4,"daytype":"weekday","day_of_week":5}
{"author":"ticklecricket","body":"Ok, I googled it and it's even worse. It's a whole sale rip off of a comic that's not xkcd. \n\nhttp://crossedcrocodiles.files.wordpress.com/2010/04/aircraftid.jpeg","timestamp":"2011-07-22T09:56:49.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"loaf24","body":"NECO! ","timestamp":"2011-07-22T07:11:30.000-07:00","score":1,"subreddit":"optometry","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"mind404","body":"satire","timestamp":"2011-07-22T12:00:03.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"gluino","body":"I don't like this XKCD. \n\nA guy intentionally causes injury/death to innocent strangers for fun, and then? I don't get it.\n\nThis is similar to say messing with train tracks to derail trains for fun.","timestamp":"2011-09-21T04:23:31.000-07:00","score":10,"subreddit":"xkcd","ups":10,"daytype":"weekday","day_of_week":3}
{"author":"Slowhand09","body":"You may not be a \"having-a-sense-of-humor\" kind of guy.","timestamp":"2011-09-21T05:29:45.000-07:00","score":8,"subreddit":"xkcd","ups":8,"daytype":"weekday","day_of_week":3}
{"author":"gluino","body":"Yeah well, I did say \"I don't get it.\"","timestamp":"2011-09-21T20:51:06.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"redwall_hp","body":"I was there once. It's one big ass-escalator.","timestamp":"2011-09-21T15:33:19.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"paradigmatic","body":"I know, image quality sucks for most non-keynote talks...","timestamp":"2011-09-21T11:47:15.000-07:00","score":1,"subreddit":"scala","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"qpalz","body":"The Eden Prairie mall must live forever in the shadow of the Mall of America.","timestamp":"2011-09-21T15:12:27.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"egotripping","body":"I can just imagine Randall now. \"Get a load of this lamewad.  Cross-stitching?  Who *DOES* that?\"","timestamp":"2011-09-20T12:32:09.000-07:00","score":0,"subreddit":"xkcd","ups":0,"daytype":"weekday","day_of_week":2}
{"author":"terrcin","body":"[mobile version](http://m.xkcd.com/) has link that shows the alt text.","timestamp":"2011-09-21T04:56:29.000-07:00","score":8,"subreddit":"xkcd","ups":8,"daytype":"weekday","day_of_week":3}
{"author":"DFGdanger","body":"*The Emperor Across The Sea","timestamp":"2011-10-26T10:30:25.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":3}
{"author":"douglasr007","body":"Fucking engineers becoming Melvins.\n\nand engineers calling other engineers Melvins","timestamp":"2011-10-27T02:02:00.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":4}
{"author":"laaabaseball","body":"reddit limited it to 20 until recently.","timestamp":"2011-10-27T14:40:52.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":4}
{"author":"thorax","body":"And lots and lots of water. ","timestamp":"2011-10-26T06:22:01.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":3}
{"author":"CaptSpify_is_Awesome","body":"But did any of the kids experience a time-difference while passing *through* the door?\nThey came out at the same speed they were walking through. ","timestamp":"2011-10-26T11:00:51.000-07:00","score":5,"subreddit":"xkcd","ups":5,"daytype":"weekday","day_of_week":3}
{"author":"lanzkron","body":"He doesn't seem to take into account the time dilation, in reality (?) there would be barely a trickle on the other side.\n\nIIRC years passed in Narnia while no time passed in our world so the real function should be:\n\n`Q = A √2gd/∞`","timestamp":"2011-10-26T07:03:11.000-07:00","score":25,"subreddit":"xkcd","ups":25,"daytype":"weekday","day_of_week":3}
{"author":"yesyesyesalright","body":"It's up now, but for some reason it's huge","timestamp":"2011-10-26T05:51:23.000-07:00","score":7,"subreddit":"xkcd","ups":7,"daytype":"weekday","day_of_week":3}
{"author":"delph906","body":"I'm not sure if sarcasm or not, they need to get around to making that font. If not I think its referencing The Lion, The Witch and The Wardrobe. By sinking the wardrobe they'll create a jet of water to overwhelm the White Witch who's wreaking havoc in Narnia.","timestamp":"2011-10-27T04:04:28.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":4}
{"author":"mindbleach","body":"&gt; the benefits to sea-faring were obvious and well-practiced for tens of thousands of years.\n\nShips and oceans were useful in the way that flight was obviously useful and immediately latched onto, but I was talking about sailing into the unmapped middle of wet nowhere. You know, *out to sea.* \n\n&gt; Eventually it will be worth it to go out and extract things from asteroids or whatever, but it's certainly several orders of magnitude of difference compared to being able to build a boat.\n\nThere's a world of difference between spaceflight and *boats,* but funding a *ship* capable of transoceanic sailing was the work of lifetimes. You don't just knock out a three-mast caravel over a long weekend and shanghai the first dozen drunks you can find - certainly not with pre-renaissance technology and material prices. Columbus was rejected by three governments before someone took his plan seriously. His plan, by the way, which would have failed miserably if Latin America hadn't been placed so inconveniently between Castille and Japan. Apparently Isabella had never heard of Ptolemy or she'd have told Chris to try swimming. ","timestamp":"2011-05-02T16:35:18.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":1}
{"author":"nukem996","body":"The alt text is sad but true. We can find limitless amounts of money for war but spending anything on discovery is impossible. I hope this changes within my life time but I fear it never will.","timestamp":"2011-05-01T23:21:11.000-07:00","score":12,"subreddit":"xkcd","ups":12,"daytype":"weekend","day_of_week":7}
{"author":"rocketvat","body":"I'm sorry, I don't buy that \"Economically and logically there wasn't much to gain by sailing out to sea\" was \"dry sarcasm\".  Your initial argument was and is wrong; the benefits to sea-faring were obvious and well-practiced for tens of thousands of years.  There's a fundamental difference between sea exploration and space exploration-- a) the lack of anyone to trade with and b) the difficulty of extracting resources.  *Eventually* it will be worth it to go out and extract things from asteroids or whatever, but it's certainly several orders of magnitude of difference compared to being able to build a boat.  Space exploration is non-obvious and won't be \"worth it\" for a long time.  It's a romanticized notion that has been completely divorced from the reality of actually doing it.","timestamp":"2011-05-02T13:52:24.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"jugalator","body":"The alt text is likely to annoy many, especially the kind of people who read xkcd. However, he's of course right - economically and logically there's not much to gain on learning about space. Yes, some space science \"spill over\" to our life here on Earth, but it's honestly a small amount of science that can be questioned if some couldn't be discovered from studying Earth.\r\n\r\nHaving said that... There are many other reasons to keep studying and discovering space. It's fortunately not *all* about economics and logically sound decisions here in our world. This is what I live for. I wouldn't work if it wasn't to reach happiness from a more functional life than if I wouldn't. I wouldn't listen to music, I wouldn't capture photos, and I wouldn't read out of curiosity. Devoting my life to study stock markets is no goal of mine, despite it perhaps being one of the more logically sound choices if we existed only for finances.\r\n\r\nHopefully we can keep sparing some funds from the more economically  sound objectives for the less economically sound ones in order to reach the realms that logic can never touch.","timestamp":"2011-05-01T23:42:37.000-07:00","score":8,"subreddit":"xkcd","ups":8,"daytype":"weekend","day_of_week":7}
{"author":"otakuman","body":"&gt;man wtf\n\nwtf(6) - Linux man page\n\nSynopsis\n\n\nwtf [-a] [is] pattern\n\n\nwtfindex filename\n\n\nwtfdump filename\n\n\nDescription\n\n\nThe wtf program looks-up the definition of a term. It supports a number of definition sources. In this version they are an acronyms database and a filename suffixes database.","timestamp":"2011-06-15T13:02:13.000-07:00","score":6,"subreddit":"xkcd","ups":6,"daytype":"weekday","day_of_week":3}
{"author":"jirf88","body":"&gt; And the man page should contain no example syntax. \n\nNumber one pet hate. I see you've gone to the bother to write a man page. Thats nice. I'd have been happy with an example syntax and a description of what the various switches do.","timestamp":"2011-06-15T03:56:02.000-07:00","score":9,"subreddit":"xkcd","ups":9,"daytype":"weekday","day_of_week":3}
{"author":"AndrewBenton","body":"Man pages are usable; you can scroll and find the information you want. Whenever I've tried to use info I spend about 10 mins trying to figure out how to navigate before I give up and use Google","timestamp":"2011-06-15T02:41:26.000-07:00","score":13,"subreddit":"xkcd","ups":13,"daytype":"weekday","day_of_week":3}
{"author":"monty4321","body":"I discovered reddit because of this xkcd","timestamp":"2011-02-20T01:46:20.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekend","day_of_week":7}
{"author":"sockthepuppetry","body":"Indeed, even in the middle of all this, Pinker calls him a \"minor genius\" and praises his writing talents copiously.  \n\nStill, I wouldn't take most of his synthesis seriously.  Suppose I go out and record the gender of the first 20 people I find, discover 13 females, and 7 males, and conclude that, contrary to long held beliefs about gender, the world's population is actually 65% female!  Without rigorous statistical standards (e.g. in this case a [chi-squared test](http://en.wikipedia.org/wiki/Pearson%27s_chi-square_test) ), controls, and predictive hypotheses, there's really not much reason to entertain conclusions.","timestamp":"2011-02-22T03:54:02.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":2}
{"author":"Liorithiel","body":"Google It YourselF?","timestamp":"2011-02-21T12:28:09.000-08:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":1}
{"author":"Arrgh","body":"J. Irii strikes hard and without warning, rarely requiring a second edit to take down his prey.","timestamp":"2011-02-21T09:54:03.000-08:00","score":2,"subreddit":"scala","ups":2,"daytype":"weekday","day_of_week":1}
{"author":"toastspork","body":"[Random?](http://www.youtube.com/watch?v=G2y8Sx4B2Sk)\n\n","timestamp":"2011-06-13T13:31:11.000-07:00","score":4,"subreddit":"xkcd","ups":4,"daytype":"weekday","day_of_week":1}
{"author":"evilek","body":"This link work :] \nThat in title shows me this - http://imgur.com/qn65G","timestamp":"2011-06-13T02:11:22.000-07:00","score":1,"subreddit":"scala","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"Naedlus","body":"Who recalls Grolier's Encyclopedia?","timestamp":"2011-06-13T16:21:15.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"Uzalud","body":"Yeah. Not sure what happened... Tnx","timestamp":"2011-06-12T00:20:20.000-07:00","score":2,"subreddit":"scala","ups":2,"daytype":"weekend","day_of_week":7}
{"author":"mepcotterell","body":"Glorious! ","timestamp":"2011-06-13T16:06:32.000-07:00","score":2,"subreddit":"scala","ups":2,"daytype":"weekday","day_of_week":1}
{"author":"paradigmatic","body":"For me, using a a tuple bigger than 3-4 is already ugly. Do you really need to enclose 23 objects with 23 different types ? How will you remember what position corresponds to what ? A case class can be more useful (especially with the named arguments in scala 2.8).\n\nIf you really need it, you can still use [heterogeneous lists](http://apocalisp.wordpress.com/2010/07/06/type-level-programming-in-scala-part-6a-heterogeneous-list%C2%A0basics/).","timestamp":"2011-02-25T08:20:58.000-08:00","score":2,"subreddit":"scala","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"A119","body":"[Three Panel Soul comic from November 2008: 'On Advancements'](http://threepanelsoul.com/2008/11/05/on-advancements/)","timestamp":"2011-02-23T07:42:32.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"djhworld","body":"An interesting post, I'm not sure if I agree with all of his points, to me (as an amateur, still learning as I go Scala developer) I don't find the syntax too complicated. It's a bit of a climb, but it's not a massive jump from Java.","timestamp":"2011-02-23T05:43:05.000-08:00","score":3,"subreddit":"scala","ups":3,"daytype":"weekday","day_of_week":3}
{"author":"djhworld","body":"Awesome, have bookmarked, these should keep me busy for a while!","timestamp":"2011-02-25T00:47:36.000-08:00","score":1,"subreddit":"scala","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"friderman","body":"I have not found an example of something simple to do with Java but hard with Scala. Hundreds the other way. \n\nTo me, the real news is the Odersky's comment to this post:\n\nMartin\nPosted February 21, 2011 at 4:17 pm | Permalink\nThis is Martin, the language designer. I am sorry that your tool experience was so frustrating.\n\nI just wanted to say that my company Scala Solutions has taken the over development of the Eclipse IDE for Scala. We should have a first beta out together with the release of Scala 2.9, in a couple of weeks. I have personally spent quite a lot of time improving the interface with the compiler. I have now switched for all of my development work to our as yet unreleased version of the Scala plugin for Eclipse. That’s after 20 years of emacs. And I am not looking back.\n\nThe new Eclipse IDE is not yet as feature complete as Java’s, but we have made great progress in terms of stability and responsiveness in large projects.\n\nRegarding fsc, failing after 30 minutes looks very mysterious to me — I ever have seen that one reported by anyone else. A firewall problem, maybe?\n","timestamp":"2011-02-23T07:59:13.000-08:00","score":16,"subreddit":"scala","ups":16,"daytype":"weekday","day_of_week":3}
{"author":"mrsanchez","body":"How is it ugly?  How in the world do you ever have to actually deal with the way the tuple classes are actually defined?","timestamp":"2011-02-25T09:42:35.000-08:00","score":3,"subreddit":"scala","ups":3,"daytype":"weekday","day_of_week":5}
{"author":"basiphobe","body":"I came here to post this obligatory response as well.","timestamp":"2011-02-23T10:58:11.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"StrangeYoungMan","body":"what a coincidence! prior to this very day, I wouldn't have had any clue what you're referencing.","timestamp":"2011-05-13T10:09:10.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"MainelyTed","body":"I ordered 2 for the Jon Stewart thing but only got 1. But they responded right away and sent another.","timestamp":"2011-05-14T12:01:03.000-07:00","score":6,"subreddit":"xkcd","ups":6,"daytype":"weekend","day_of_week":6}
{"author":"swiper_the_fox","body":"Oh, man!","timestamp":"2011-05-13T13:39:59.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"roborage","body":"Wow, just last night I was thinking of this same thing oddly enough. I was like, \"Why don't us engineers just rise up and refuse to make weapons of war?\" If we simply refused to make weapons, you wouldn't expect some politician to understand particle physics and pick up the slack. We have the control, but so many just get bought off with boatloads of money, or they are sadistic engineers. In any case, know this EE refuses to make any device that is directly linked to the military.","timestamp":"2011-05-13T11:35:52.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":5}
{"author":"miles32","body":"/me like big boom.  Perhaps this will come as a shock to you, but wanting to work with/for the military is not an inherently sadistic position. Nor are we bought off with money.  Maybe, and I'm just thinking aloud here, maybe, some of us support the military.  ","timestamp":"2011-05-13T12:36:59.000-07:00","score":4,"subreddit":"xkcd","ups":4,"daytype":"weekday","day_of_week":5}
{"author":"DarqWolff","body":"I recognize the quote, but don't remember what it's from. I'm guessing Futurama, but I feel like it's from Spaceballs? HELP ME","timestamp":"2011-05-13T19:29:47.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"quadtodfodder","body":"never heard of XML?  count yourself lucky!  ","timestamp":"2011-11-15T13:09:04.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":2}
{"author":"Jameshfisher","body":"A fair point.","timestamp":"2011-11-14T04:57:54.000-08:00","score":6,"subreddit":"xkcd","ups":6,"daytype":"weekday","day_of_week":1}
{"author":"Morrigane","body":"I'm on there as well.  Some members seem to be weirdly possessive of \"their\" memorials.  It's been useful for giving me leads on some ancestors, and I've sort of \"adopted\" a few overlooked cemeteries around here adding memorials when I get the chance.\n\n","timestamp":"2011-11-13T19:46:50.000-08:00","score":6,"subreddit":"Genealogy","ups":6,"daytype":"weekend","day_of_week":7}
{"author":"deathbytray","body":"We could vertically stretch it on the right side to make it roughly weighted along the center. I shall call this the Tray Projection.","timestamp":"2011-11-13T22:48:22.000-08:00","score":23,"subreddit":"xkcd","ups":23,"daytype":"weekend","day_of_week":7}
{"author":"Nick4753","body":"[Relevant West Wing clip](http://www.youtube.com/watch?v=n8zBC2dvERM)","timestamp":"2011-11-13T22:37:04.000-08:00","score":39,"subreddit":"xkcd","ups":39,"daytype":"weekend","day_of_week":7}
{"author":"DenjinJ","body":"Not saying this to be clever or force a meme... but my clearest reaction to this comic is:\nಠ_ಠ\n\nAlso, no properly-scaled continuous top-down global 2D projection like Google Earth/Maps? Why not use a rough flattening for the globe, then make it scale more accurately as you zoom?\n\n(FWIW, on paper I like the Goode Homolosine because it drives me nuts seeing Antarctica distorted so ridiculously. Mostly though? I need city maps, not world maps. Since I'm not planning to recover objects from space, a world map is just a novelty.)","timestamp":"2011-11-14T16:39:51.000-08:00","score":0,"subreddit":"xkcd","ups":0,"daytype":"weekday","day_of_week":1}
{"author":"redwall_hp","body":"Yeah. That is pretty much me, except I would pick the globe just to be snarky.","timestamp":"2011-11-14T14:18:16.000-08:00","score":4,"subreddit":"xkcd","ups":4,"daytype":"weekday","day_of_week":1}
{"author":"gfixler","body":"Dr. Phlox!","timestamp":"2011-11-14T21:13:44.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":1}
{"author":"NickDouglas","body":"Yeah, first non-word-history link. Right now I get a loop whether or not I count \"taxonomically\" on the \"Human\" entry.","timestamp":"2011-10-09T18:00:40.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekend","day_of_week":7}
{"author":"cturkosi","body":"[Jeb Corliss, base jumper](http://en.wikipedia.org/wiki/Jeb_Corliss).","timestamp":"2011-10-10T00:15:07.000-07:00","score":9,"subreddit":"xkcd","ups":9,"daytype":"weekday","day_of_week":1}
{"author":"A_Monocle_For_Sauron","body":"Well, if you were to reference the [xkcd](http://xkcd.com/903/) in question, it would tell you that you ignore the links in parentheses or italics.","timestamp":"2011-10-08T23:48:38.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekend","day_of_week":6}
{"author":"livenletlive","body":"Here is how mine turned out. http://i.imgur.com/L2iCJ.png","timestamp":"2011-10-09T07:10:52.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekend","day_of_week":7}
{"author":"Jdban","body":"Schwab requires passwords between 6 and 8 characters... terrible","timestamp":"2011-08-10T11:59:04.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"histumness","body":"Wait, did you just use \"ferrous\" to mean \"ironic\"?","timestamp":"2011-08-10T05:59:11.000-07:00","score":45,"subreddit":"xkcd","ups":45,"daytype":"weekday","day_of_week":3}
{"author":"unkz","body":"Where's the file?","timestamp":"2011-08-11T10:34:54.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":4}
{"author":"krangksh","body":"Yeah, you know, iron-y.","timestamp":"2011-08-10T10:04:46.000-07:00","score":28,"subreddit":"xkcd","ups":28,"daytype":"weekday","day_of_week":3}
{"author":"AReallyGoodName","body":"Well that's going to be safe but from an entropy point of view that's terrible.\n\nPassword cracker programs typically include any and all common password creating formulas they can.\n\nWith your password if a password cracker knows the formula than it simply has to guess the initial word (11bits of entropy per word seems to be reasonable assumption). Now you might be tempted to mix it up. Change each direction from that example? Well you have 8 directions you could go so that's log2(8)=3bits of entropy per mixed up direction (not even including the reduced entropy as some directions are impossible for some keys). So that isn't going to change much. It's still guessable for a password cracker that knows the basic formula and some simple variations. Perhaps holding shift or not is randomised completely per character? Well that's a binary decision so you only get 1bit of entropy per character there. \n\nSo each completely randomised direction and randomised shift press only gets you 4bits total each time you do it. You'd be better off typing a random alpha numeric character instead (log2(37)=5.2bits). \n\nAlso repeating patterns don't really increase entropy at all.","timestamp":"2011-08-10T00:16:22.000-07:00","score":10,"subreddit":"xkcd","ups":10,"daytype":"weekday","day_of_week":3}
{"author":"Guyon","body":"I had a friend whose computer login password was \"QWE123qwe!@#\". It wasn't really that secure though because he was so proud of it that he told everyone.","timestamp":"2011-08-11T07:52:00.000-07:00","score":12,"subreddit":"xkcd","ups":12,"daytype":"weekday","day_of_week":4}
{"author":"b0b","body":"Song titles make good passwords.","timestamp":"2011-08-10T12:09:35.000-07:00","score":0,"subreddit":"xkcd","ups":0,"daytype":"weekday","day_of_week":3}
{"author":"blue_strat","body":"If both passwords were the same length, then how does limiting yourself to letters make things more secure?\n\ni.e. How does a computer find a word more difficult than random characters?","timestamp":"2011-08-10T03:08:03.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"danceswithsmurfs","body":"You have an alarming amount of info on password cracking so I'll ask this question in your direction.\n\nWhat if we just threw in one digit?  \ncorr3cthorsebatterystaple\n\nWould that make the password about as safe as the \"first letter of each word in a sentence\" strategy?","timestamp":"2011-08-10T12:05:47.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"Norther","body":"Seriously, do the maths. His logic is sound.","timestamp":"2011-08-11T05:01:59.000-07:00","score":14,"subreddit":"xkcd","ups":14,"daytype":"weekday","day_of_week":4}
{"author":"Kardlonoc","body":"He'll get on it right after his fiance stops having cancer. ","timestamp":"2011-08-11T09:16:10.000-07:00","score":107,"subreddit":"xkcd","ups":107,"daytype":"weekday","day_of_week":4}
{"author":"trevdak2","body":"Funny story\n\nAfter I left my last job, the place I left transferred management of my 401k to another company. I called this company to figure out how to get access to my 401k and transfer it to somewhere else.\n\nThe guy on the phone told me how to log in to my account. Username is my SSN, password is the last 4 digits of my SSN. I ask the guy on the phone how to change my password, and he directs me to the password change section of my account.\n\nPasswords were required to be 4 digits. The guy on the phone suggested I use my birthday or something easy to remember like 1234.\n\nI pulled my money out of there right quick.","timestamp":"2011-08-09T22:32:30.000-07:00","score":68,"subreddit":"xkcd","ups":68,"daytype":"weekday","day_of_week":2}
{"author":"Sylocat","body":"This seems like a good time for sesquipedalian loquaciousness.","timestamp":"2011-08-10T15:20:30.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"MajicMan","body":"&gt;budget supercomputer\n\n\n? Huh?","timestamp":"2011-08-10T08:04:19.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"maniacnf","body":"http://www.elpj.com/ haha, I got confused by your comment. But yes, they have those and it's like a CD player but analog.","timestamp":"2011-08-11T09:44:15.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":4}
{"author":"badave","body":"The point of the comic wasn't that the password was encrypted though.  That's a different story altogether.  It was that brute forcing by trying combinations of alphanumerics and symbols.  \n\nIf it was passphrase encrypted using AES or something similar and you gave him the IV then perhaps he could try brute forcing the passphrase, but it would only be fair by giving the encryption and IV.","timestamp":"2011-08-11T02:43:31.000-07:00","score":7,"subreddit":"xkcd","ups":7,"daytype":"weekday","day_of_week":4}
{"author":"TheSmoke","body":"yep, it's from 2010.","timestamp":"2011-07-18T10:07:30.000-07:00","score":1,"subreddit":"scala","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"ItsTitleTextNotAlt","body":"## ","timestamp":"2011-07-18T14:54:05.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"Morrigane","body":"They need volunteers.  http://the1940census.com/","timestamp":"2011-12-17T16:51:06.000-08:00","score":3,"subreddit":"Genealogy","ups":3,"daytype":"weekend","day_of_week":6}
{"author":"WilliamBonney","body":"Thank you very much. I will look into it. I was having all kinds of problems with Eclipse and moved over to IntelliJ (Jetbrains), but I am certain to need to use Eclipse again.\n","timestamp":"2011-12-17T10:39:02.000-08:00","score":3,"subreddit":"scala","ups":3,"daytype":"weekend","day_of_week":6}
{"author":"TheoreticalFunk","body":"Yep.  Got that too.  I guess this one just isn't funny.  At all.","timestamp":"2011-07-11T20:01:36.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":1}
{"author":"thorax","body":"&gt; All the jokes now involve something sexual\n\nNo. 3 of the last 10. The nonsexual ones for a reminder:\n\n* http://xkcd.com/922/\n* http://xkcd.com/921/\n* http://xkcd.com/920/\n* http://xkcd.com/918/\n* http://xkcd.com/917/\n* http://xkcd.com/916/\n* http://xkcd.com/915/\n","timestamp":"2011-07-13T16:05:18.000-07:00","score":4,"subreddit":"xkcd","ups":4,"daytype":"weekday","day_of_week":3}
{"author":"akinger","body":"No prob!","timestamp":"2011-07-12T15:01:19.000-07:00","score":1,"subreddit":"Genealogy","ups":1,"daytype":"weekday","day_of_week":2}
{"author":"CrawstonWaffle","body":"GOB's not on board.","timestamp":"2011-12-28T15:45:18.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"TogOfStills","body":"It doesn't appear to be an especially rare or valuable camera, from what I've found online. Is the lens clean/clear? If it is, might be of more value to use it yourself. Otherwise, it might not be worth more than that manual on eBay after you factor in eBay/PayPal fees and shipping/shipping supplies. ","timestamp":"2011-12-29T10:55:32.000-08:00","score":2,"subreddit":"Cameras","ups":2,"daytype":"weekday","day_of_week":4}
{"author":"benjamincanfly","body":"It doesn't work for anyone, that's the whole point. It's not a matter of precision, it's a matter of any kind of accuracy or meaning whatsoever.\n\n\"Hedge\" has multiple meanings and it's usually clear from the context (who's saying it and what they're talking about) which is intended. This is not the case with percent vs. percentage points. If someone says \"Last year the death rate was 5%, this year it dropped by 20%,\" you know based on the math itself that they can't mean percentage points and therefore that they used the word right. Usually it is not clear though. If someone says \"Last year the tax rate was 50% and this year it dropped by 30%,\" there's no way to know whether they're using the word \"percent\" correctly, because it's possible that they meant it dropped by 30 percentage points to 20%, not by 30% (as they said) to 35%.","timestamp":"2011-12-02T09:08:12.000-08:00","score":5,"subreddit":"xkcd","ups":5,"daytype":"weekday","day_of_week":5}
{"author":"Quady","body":"Forget the wikipedia article, [just go to the guy's website](http://www.timecube.com/). Brace yourself for (non-disturbing, just bizzare) crazy.","timestamp":"2011-12-02T19:43:12.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"holocarst","body":"What I never understood: How do they themsleves know what the stories are about, if all they ever do is talk in metaphors about this stories","timestamp":"2011-05-23T10:23:01.000-07:00","score":5,"subreddit":"xkcd","ups":5,"daytype":"weekday","day_of_week":1}
{"author":"LogicalTime","body":"Problem: If you don't know the stories their language is based on you can't just look them up. However once you do learn the stories/metaphors then yeah you should be able to stick that info in the translator.","timestamp":"2011-05-23T06:36:27.000-07:00","score":5,"subreddit":"xkcd","ups":5,"daytype":"weekday","day_of_week":1}
{"author":"humblerodent","body":"I resent your implication.  I, sir, am no geek.\n\n**sips from Aperture Laboratories mug*","timestamp":"2011-05-23T08:40:05.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":1}
{"author":"silouan","body":"Colonel Mustard in the den with a candlestick.\n","timestamp":"2011-05-22T21:27:15.000-07:00","score":17,"subreddit":"xkcd","ups":17,"daytype":"weekend","day_of_week":7}
{"author":"ani625","body":":)","timestamp":"2011-02-10T21:24:27.000-08:00","score":5,"subreddit":"xkcd","ups":5,"daytype":"weekday","day_of_week":4}
{"author":"JPCetz","body":")","timestamp":"2011-02-10T21:07:31.000-08:00","score":98,"subreddit":"xkcd","ups":98,"daytype":"weekday","day_of_week":4}
{"author":"mallio","body":"I was about to say that I pronounce it like 'owl' with an 'f' before it, but then I realized that it's quite possible that you pronounce owl as 'owel'. It probably doesn't help that I pronounce 'towel' as just 'towl' either. \n\nIf that is the case, then this might make more sense: Say 'found'. I don't think I've ever heard that as more than one syllable. Anyway, the vowel sound in found is the same as that in foul, so try saying 'found' and right before you pronounce the 'nd' make an 'L'. That's how you pronounce foul as one syllable without sounding southern.\n\nNow I'm looking back at what I'm reading and realizing the 'ou/ow' sound is used all over the place without being more than one syllable. Why is foul different?","timestamp":"2011-02-09T11:45:56.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"thibit","body":"She's sitting cross-legged at that point.  The difference of the curvature of the spine between panels 1 and 2, and the continuation of 2's curve into panel 3, indicates this to be very likely so.","timestamp":"2011-02-09T23:12:03.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"mathiscool","body":"Fixed: http://imgur.com/Tv3N7","timestamp":"2011-02-10T23:50:55.000-08:00","score":16,"subreddit":"xkcd","ups":16,"daytype":"weekday","day_of_week":4}
{"author":"crazy88s","body":"Did you know that the peak is located at .1337?","timestamp":"2011-02-08T16:04:12.000-08:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":2}
{"author":"Treberto","body":"I think the latter. No real reason other than the fact that I don't think he'd let detractors really get to him. He's never really responded to criticism before, has he?\n\nI'll be honest and say I never liked xkcd but it is markedly worse now than it used to be. He should take a break and come back when he has more ideas.","timestamp":"2011-02-11T07:16:22.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"faffi","body":"then i wonder where the mouth for the smiley went, order of operations man.","timestamp":"2011-02-11T00:13:28.000-08:00","score":9,"subreddit":"xkcd","ups":9,"daytype":"weekday","day_of_week":5}
{"author":"DrSilverworm","body":"That guy pulled the bartender down by the cut of her shirt. Is that normally kosher?","timestamp":"2011-02-11T12:12:18.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"wthulhu","body":"in the same vein, i tend to tweak out if i see an asterisk without the accompanying footnote","timestamp":"2011-02-11T14:14:58.000-08:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":5}
{"author":"CitrusBazooka","body":"I don't even have an android, but I've heard there's an app called Alien Blue that's supposed to be infinitely better than 'reddit is fun.\" At least, that's what I've heard 'round these parts.","timestamp":"2011-03-24T20:18:20.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":4}
{"author":"avsa","body":"Pepsi is controlled by the communists","timestamp":"2011-10-19T02:30:37.000-07:00","score":7,"subreddit":"xkcd","ups":7,"daytype":"weekday","day_of_week":3}
{"author":"LeonardoFibonacci","body":"Generic brand?","timestamp":"2011-10-19T13:32:54.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":3}
{"author":"hearforthepuns","body":"No.","timestamp":"2011-10-19T17:52:18.000-07:00","score":6,"subreddit":"xkcd","ups":6,"daytype":"weekday","day_of_week":3}
{"author":"kikibobo","body":"This is so NOT the slick way.  See the comments:\n\nmyOpt.map(_.toString.reverse.mkString(\"-\")).getOrElse(\"unknown\")\n\nUgh.","timestamp":"2011-06-02T06:27:31.000-07:00","score":10,"subreddit":"scala","ups":10,"daytype":"weekday","day_of_week":4}
{"author":"Ma8e","body":"Thanks! :)","timestamp":"2011-06-01T18:36:58.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"blue_strat","body":"I don't get any further privileges at 21. Drinking age is 18 in the UK.\n\nI want to get older than 21, I just want it to happen slowly. This year has gone past so fast :(","timestamp":"2011-06-03T04:54:27.000-07:00","score":13,"subreddit":"xkcd","ups":13,"daytype":"weekday","day_of_week":5}
{"author":"IronRectangle","body":"Great idea, I'll do that!","timestamp":"2011-06-27T20:25:07.000-07:00","score":5,"subreddit":"xkcd","ups":5,"daytype":"weekday","day_of_week":1}
{"author":"sjrd","body":"+1 with petervanroy (of course)\n\n&gt; Not sure if Ozma brings static typing to Oz which might be one of the most interesting gains?\n\nYes it does. I think it is also very important.","timestamp":"2011-06-29T07:42:42.000-07:00","score":1,"subreddit":"scala","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"nicolettesue","body":"Upvote for your excellent choice in spouse.  And congratulations to the both of you on your nuptials!\n\n...it is now my goal to get a ball pit at my future wedding.  Damn.","timestamp":"2011-06-27T18:19:01.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":1}
{"author":"Ragarnok","body":"&gt; The layers are also sized according to the golden ratio\n\nSplendid sir!","timestamp":"2011-06-27T12:16:04.000-07:00","score":11,"subreddit":"xkcd","ups":11,"daytype":"weekday","day_of_week":1}
{"author":"whataguy","body":"Mark my words, google will soon own your souls.  \n\nI would say *our* souls... but I sold mine for a sammich.","timestamp":"2011-06-28T22:13:24.000-07:00","score":20,"subreddit":"xkcd","ups":20,"daytype":"weekday","day_of_week":2}
{"author":"Kowzorz","body":"Unfortunately, ball pits are expensive.","timestamp":"2011-06-27T14:31:42.000-07:00","score":4,"subreddit":"xkcd","ups":4,"daytype":"weekday","day_of_week":1}
{"author":"soccerman","body":"They knew what they were getting into when they joined a terrorist organization with explosive barrels haphazardly strewn throughout their base","timestamp":"2011-03-15T21:39:39.000-07:00","score":22,"subreddit":"xkcd","ups":22,"daytype":"weekday","day_of_week":2}
{"author":"V2Blast","body":"I don't see how this is relevant, and I don't understand why people upvoted it.\n\nAlso, I'm going to kill you in your sleep for quoting the song.","timestamp":"2011-03-18T05:54:28.000-07:00","score":4,"subreddit":"xkcd","ups":4,"daytype":"weekday","day_of_week":5}
{"author":"NSLogan","body":"For the lazy mobile readers:\n&gt;The Roanoke Lost Colonists founded Roanoke, the Franklin Expedition reached the Pacific in 2009 when the Northwest Passage opened, and Jimmy Hoffa currently heads the Teamsters Union--he just started going by 'James'.\n","timestamp":"2011-09-11T21:01:01.000-07:00","score":13,"subreddit":"xkcd","ups":13,"daytype":"weekend","day_of_week":7}
{"author":"cynoclast","body":"The mystery of Emelia Airhart was [solved fairly conclusively](http://news.discovery.com/history/amelia-earhart-resting-place.html).","timestamp":"2011-09-12T14:16:01.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"jxhn","body":"And so awake.","timestamp":"2011-09-12T07:17:20.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":1}
{"author":"richunclesam","body":"There's at least one free app for that. At least on ios. ","timestamp":"2011-09-12T14:27:40.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"npinguy","body":"I don't get it... :(","timestamp":"2011-09-11T21:58:31.000-07:00","score":14,"subreddit":"xkcd","ups":14,"daytype":"weekend","day_of_week":7}
{"author":"proudcanadianeh","body":"I just realized, I havn't seen him on reddit for a long time. Did he change accounts?","timestamp":"2011-09-13T08:41:16.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":2}
{"author":"marveloriddle","body":"Thanks for the help.","timestamp":"2011-12-09T21:03:15.000-08:00","score":1,"subreddit":"Genealogy","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"GingerSnap01010","body":"Shhhhhh I'm not allowed to play metal at Christmas. They are symphonic rock. ","timestamp":"2011-12-09T15:31:51.000-08:00","score":8,"subreddit":"xkcd","ups":8,"daytype":"weekday","day_of_week":5}
{"author":"valtism","body":"Oh god this brings back painful memories of Japan at Christmas. You cannot escape this goddamn song.","timestamp":"2011-12-09T18:38:18.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"Jackson3125","body":"Where is the blurb on the chart? ","timestamp":"2011-11-22T07:47:09.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":2}
{"author":"urmyheartBeatStopR","body":"Stackoverflow and the scala newsgroup over at googlegroup is pretty helpful for me. The google group have 2 scala group, one of them is for newbie.\n\nI usually lurk here for general scala news.","timestamp":"2011-11-22T09:34:51.000-08:00","score":1,"subreddit":"scala","ups":1,"daytype":"weekday","day_of_week":2}
{"author":"yacheritsi","body":"He left Fannie Mae and Freddie Mac off of the bailouts section.","timestamp":"2011-11-21T08:31:37.000-08:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":1}
{"author":"paidtothink","body":"holy fuck, I knew notch must be rich by now but 56 million $ rich? woha...","timestamp":"2011-11-21T11:22:28.000-08:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":1}
{"author":"nateshiff","body":"My guesses\n\n1. Joke for those paying attention\n2. honest mistake\n3. reference\n4. beans","timestamp":"2011-11-21T19:49:28.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"jleedev","body":"Negative, I am a meat popsicle.","timestamp":"2011-11-21T08:44:40.000-08:00","score":18,"subreddit":"xkcd","ups":18,"daytype":"weekday","day_of_week":1}
{"author":"mindbleach","body":"Has errors, needs corrections. Big Dig figure is missing a visual representation. \"Millions\" banner covers some text. Double Eagle / Treskilling notes overlap their visual representations. MC Frontalot estimate for JK Rowling seems misplaced / miscolored / mislabeled? Combined net worth of 1210 billionaires less than $1210B; suspect figure is missing three zeros.","timestamp":"2011-11-21T08:59:01.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"mbeels","body":"I am also trying to sort this out, not what I would expect, given the interest rate is larger then the inflation rate.","timestamp":"2011-11-22T19:28:38.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":2}
{"author":"thisisanewaccount6","body":"You have no idea how much I wished that was a real website.","timestamp":"2011-11-21T21:13:30.000-08:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":1}
{"author":"FlickyG","body":"Before you downvote Rubin0, you might want to visit [this](http://www.reddit.com/r/pics/comments/8aqjh/awww_this_is_just_too_sad_pic/c08pp5z).","timestamp":"2011-05-07T02:29:15.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekend","day_of_week":6}
{"author":"lackofbrain","body":"Oh yeah, so you did. Sorry, didn't notice that!","timestamp":"2011-05-09T02:35:40.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"lackofbrain","body":"The page won't load for me, but wasn't there an [xkcd](http://xkcd.org/893/) about this not long back?","timestamp":"2011-05-07T23:47:47.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekend","day_of_week":6}
{"author":"ratatusk","body":"Dude, I have ADD too and I can read to the end of a six panel comic. ","timestamp":"2011-05-09T15:02:35.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":1}
{"author":"etoiledevol","body":"I'm not a physicist, but I think that the increase in \"thickness\" is due to the initial angular momentum of all particles in the universe from the moment of the big bang. Eventually all of the momentums influence each other, and they go back on the same path, making the cylinder \"narrow.\" The moment where the entire universe is converged upon a single point is what results in a new Big Bang. In that case, it makes sense to think of the universe as a donut that's had a bite taken out of it, and the tiny bit that holds the thing together is the space-time event of the Big Bang. \n\nI am pretty sure that was a theory for a while, but then scientists decided that there wasn't enough mass in the universe to make it fall back on itself. Then they figured out that dark matter exists, but they can't see it. So now they are at a loss to figure out if that's how it works or not, since they can't measure the mass of the universe without being able to see the matter it contains.\n\nSomeone more qualified than I can probably explain it better, but that's how I see things. ","timestamp":"2011-05-07T08:46:44.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekend","day_of_week":6}
{"author":"etoiledevol","body":"I'm pretty sure the universe is a donut full of donuts.","timestamp":"2011-05-07T08:59:02.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekend","day_of_week":6}
{"author":"fuckevrythngabouthat","body":"what?","timestamp":"2011-05-07T05:45:27.000-07:00","score":0,"subreddit":"xkcd","ups":0,"daytype":"weekend","day_of_week":6}
{"author":"jevon","body":"[Lol I've only written one.](http://www.jevon.org/wiki/Installing_Soundblaster_Live!_Drivers_in_Windows_XP)","timestamp":"2011-12-21T01:47:53.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"unfortunatejordan","body":"I think that [Australia's Home Brand](http://rubenerd.com/uploads/photo.lotsofhomebrand.jpg) is more on the mark.","timestamp":"2011-12-21T03:19:41.000-08:00","score":12,"subreddit":"xkcd","ups":12,"daytype":"weekday","day_of_week":3}
{"author":"mod83","body":"In Britain, Kwik Save did this with their [budget 'No Frills' brand](http://homepage.mac.com/tobiasrose/nofrills.jpg)... Only problem was that it all tasted like shite.","timestamp":"2011-12-20T23:18:19.000-08:00","score":17,"subreddit":"xkcd","ups":17,"daytype":"weekday","day_of_week":2}
{"author":"ziggl","body":"uhhh, link?  I could really use some solutions to my problems.","timestamp":"2011-12-20T14:41:00.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":2}
{"author":"myotheralt","body":"Not tasting like shit is a frill.","timestamp":"2011-12-21T00:51:39.000-08:00","score":17,"subreddit":"xkcd","ups":17,"daytype":"weekday","day_of_week":3}
{"author":"krebstar_2000","body":"[This](http://thisrecording.com/storage/repo_man.jpg?__SQUARESPACE_CACHEVERSION=1244035386853) is what I immediately thought of.","timestamp":"2011-12-20T22:42:50.000-08:00","score":5,"subreddit":"xkcd","ups":5,"daytype":"weekday","day_of_week":2}
{"author":"The_Mad_Highlander","body":"Back in my day we had lots of these.\nThey were called generic.","timestamp":"2011-12-21T06:01:10.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"Digestive","body":"Repo Man (1984)","timestamp":"2011-12-21T05:01:48.000-08:00","score":4,"subreddit":"xkcd","ups":4,"daytype":"weekday","day_of_week":3}
{"author":"davetan2","body":"Hay! I'm old enough to remember cartman!","timestamp":"2011-12-21T10:57:33.000-08:00","score":-1,"subreddit":"xkcd","ups":-1,"daytype":"weekday","day_of_week":3}
{"author":"toastspork","body":"[Public Image Ltd - Album / Compact Disc / Cassette (1986)](http://www.google.com/search?hl=en&amp;safe=off&amp;hs=I97&amp;q=pil Album | Compact Disc | Cassette&amp;tbm=isch)","timestamp":"2011-12-21T11:25:59.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"Talman","body":"Here in the US, too.","timestamp":"2011-12-21T07:31:30.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"KeytarVillain","body":"Loblaw's is a supermarket too. I'm from Western Canada, and we don't have Loblaw's out here (although we do have Superstore, which is owned by them and also sells no-name products). I lived in Ontario for 4 months earlier this year, and I got excited every time I walked past Loblaw's.","timestamp":"2011-12-21T12:51:57.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"crystalcastles","body":"Man, what industries are booming in Sweden? I'm looking for a place to move and you guys just keep on making more and more sense.","timestamp":"2011-12-21T07:26:12.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"ParanoydAndroid","body":"Distinction without a difference, IMO.","timestamp":"2011-09-02T05:42:25.000-07:00","score":19,"subreddit":"xkcd","ups":19,"daytype":"weekday","day_of_week":5}
{"author":"Slowhand09","body":"They're actually called **DECALS**.  What they represent is a man and woman with some loot.  Oops, should this be in /r/smartass?","timestamp":"2011-09-02T07:25:45.000-07:00","score":-15,"subreddit":"xkcd","ups":-15,"daytype":"weekday","day_of_week":5}
{"author":"Slowhand09","body":"Upvote for insightful - Not!","timestamp":"2011-09-02T07:06:20.000-07:00","score":-14,"subreddit":"xkcd","ups":-14,"daytype":"weekday","day_of_week":5}
{"author":"NSLogan","body":"Quite a bit, most likely. How much does a letter cost from across the drink to the US?","timestamp":"2011-09-02T10:38:20.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"sgt_deacon","body":"This reminds me of a video where it was a scene of a car crash. The EMT looked at the mother and said \"I guess you won't be needing this anymore*\" and took off one of the family decals and handed it to her. I'm fairly sure it was on Tosh.o, someone should find a link because it was hilarious. It was also particularly spectacular because it was the first and only viewer video that I have ever found funny on that show. Unfortunately I tried to find a link but with no success.  \n\n*Paraphrased ","timestamp":"2011-09-02T18:53:00.000-07:00","score":6,"subreddit":"xkcd","ups":6,"daytype":"weekday","day_of_week":5}
{"author":"atlantis69","body":"I have the equipment and resources and would happily make them, but am located down under so am not sure how much postage would ruin the transaction.","timestamp":"2011-09-02T09:16:54.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"calantorntain","body":"At first I thought it was implying they sold the children.","timestamp":"2011-09-02T08:41:05.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"chocobot","body":"nice stuff, but god I fucking hate that thing. I wasted a lot of time analysing the properties of the sierpinsky gasket for my math professor, time I will never get back","timestamp":"2011-03-30T22:58:51.000-07:00","score":2,"subreddit":"scala","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"Deadmirth","body":"The sticky lamp pokemon.","timestamp":"2011-03-30T06:48:31.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"ezfrag","body":"My first trolling attempt to get up-trolled.  Good one dear Redditor.","timestamp":"2011-03-28T13:19:17.000-07:00","score":4,"subreddit":"xkcd","ups":4,"daytype":"weekday","day_of_week":1}
{"author":"Phinaeus","body":"Can't wait to read the xkcdsucks of this.","timestamp":"2011-03-29T23:01:59.000-07:00","score":6,"subreddit":"xkcd","ups":6,"daytype":"weekday","day_of_week":2}
{"author":"gergemaine","body":"Shirt #2: [Correlation](http://i.imgur.com/ioC86.jpg)","timestamp":"2011-03-29T10:22:00.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":2}
{"author":"jmhajek","body":"To be fair, in some cases placebos are quite effective. Obviously, when somebody starts eating those pills in the hope it will cure their cancer, you should intervene - but if somebody treats their migraine with them and feels it helps, homeopathy is strictly superior to regular medicine, as it has no side effects.","timestamp":"2011-10-31T02:18:00.000-07:00","score":6,"subreddit":"xkcd","ups":6,"daytype":"weekday","day_of_week":1}
{"author":"faceplanted","body":"Haven't all your downvotes taught you a lesson yet? nobody cares, language evolves through and change and public use.","timestamp":"2011-10-31T13:06:22.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"DeedTheInky","body":"Homeopathy is weird. I did a [homepathy comic](http://deedtheinky.com/2010/08/23/homeopaths-are-one-in-a-million/) a while ago, and I got more complaints and dropped Facebook friends about that one than any other comic, even the one that had a drawing of Muhammed in it. :/","timestamp":"2011-10-31T03:33:19.000-07:00","score":38,"subreddit":"xkcd","ups":38,"daytype":"weekday","day_of_week":1}
{"author":"ItsTitleTextNotAlt","body":"## ","timestamp":"2011-10-31T09:18:14.000-07:00","score":-5,"subreddit":"xkcd","ups":-5,"daytype":"weekday","day_of_week":1}
{"author":"DeedTheInky","body":"I'd like to imagine that one of my ~3 readers is the xkcd guy, but I doubt it. :)","timestamp":"2011-10-31T07:44:58.000-07:00","score":9,"subreddit":"xkcd","ups":9,"daytype":"weekday","day_of_week":1}
{"author":"vestigial","body":"I thought the same thing; I would rather have had a library of blank books after my critical theory class. It's all meaningless anyway. ","timestamp":"2011-10-31T09:42:25.000-07:00","score":5,"subreddit":"xkcd","ups":5,"daytype":"weekday","day_of_week":1}
{"author":"scx_tyler","body":"Yeah me too, thats what I mean (I wish I could buy those stickers from the xkcd shop).","timestamp":"2011-12-02T04:19:08.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"Generacy","body":"I was looking for a money bag sticker.  And I found it, on that site.","timestamp":"2011-12-01T19:42:08.000-08:00","score":12,"subreddit":"xkcd","ups":12,"daytype":"weekday","day_of_week":4}
{"author":"highTrolla","body":"So by having my own dorm room, I'm basically opening myself up to either no sex, or ugly chicks only?","timestamp":"2011-11-30T16:30:19.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"calantorntain","body":"Bwaha.  Love the tool tip text on this one.","timestamp":"2011-12-02T07:48:43.000-08:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":5}
{"author":"scx_tyler","body":"Looks like someone started the project (went as far as buying the right size ball at least), [here is a link to thier fourm post](http://forum.pololu.com/viewtopic.php?f=1&amp;t=1952).\n\nI also found a post on digg from a class at Georgia tech, it was posted in 2009 and the link to the build page is giving me a 404 [Here is the digg post](http://digg.com/news/story/XKCD_eeePC_Hamster_Ball_Project) and here is what thier description says about it:\n\n&gt;For a final project in one of our classes at Georgia Tech, we built something like XKCD's favorite pet. \"The goal of Project 413 was to create a robot inspired by a webcomic called xkcd. It is a combination of the ideas set forth in the comic with the requirements of our Embedded Systems Design course ECE 4180 at Georgia Tech.\" Dec 9, 2009.\n\nI hope someone can track down at least one of the creators, I'd love to see some video or at least pictures of this creation.","timestamp":"2011-10-02T19:28:40.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekend","day_of_week":7}
{"author":"postExistence","body":"Would it be [New Pet](http://xkcd.com/413/), by any chance?","timestamp":"2011-10-02T13:51:05.000-07:00","score":33,"subreddit":"xkcd","ups":33,"daytype":"weekend","day_of_week":7}
{"author":"histumness","body":"Sure. You just lost it.","timestamp":"2011-07-08T07:14:08.000-07:00","score":15,"subreddit":"xkcd","ups":15,"daytype":"weekday","day_of_week":5}
{"author":"seanmg","body":"Anyone who thinks the movie is deep, isn't exactly deep themselves, but it's such a great movie.  Sure the message is pretty obvious on the first go, but there are so many little Easter Eggs, it's fun to watch more than once.\n\nNot to mention Fight Club is essentially a memoir of him and the author's friends.  Almost every aspect of the movie happened to someone he knew.  It's kinda cool to picture that movie and all of it's craziness happening to and around one particular person.  It's a story that had to be told.\n\nThis wasn't really the point of the comic, but that's why I still like the movie.","timestamp":"2011-07-08T06:11:47.000-07:00","score":7,"subreddit":"xkcd","ups":7,"daytype":"weekday","day_of_week":5}
{"author":"CapNRoddy","body":"Hm. TIL.","timestamp":"2011-07-06T20:48:48.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"tvraisedme","body":"I just bought my first house and can confirm it is *exactly* like this.","timestamp":"2011-05-31T09:38:02.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":2}
{"author":"Lube","body":"Could be, I looked all afternoon but got nothing, I'll try google somethng with smbc..\n","timestamp":"2011-05-30T16:06:31.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"cunningjames","body":"&gt; I'm pretty sure that with Kotlin's already existing feature set they will be more complex than Scala as soon as they hit reality\n\nMaybe. But I’d make a distinction between complex features and complex code; I don’t see any particular reason that Kotlin *must* have more complex features than Scala. Java certainly doesn’t. The price may be paid in terms of the quality of written code — good Java code makes my eyes glaze over in ways that good Scala code doesn’t — but I think it’s far from a given that Kotlin’s features will be as difficult for newcomers as Scala’s can be. They certainly seem a bit simpler overall.\n\n(I'm still wrapping my head around some stuff, although I’m a comparative newcomer.)\n\n&gt; I don't think Kotlin/Gosu/Ceylon will ever catch up to Scala in terms of stability, maturity, sophistication, tooling and third-pert library support, but only time will tell …\n\nI’d agree with all of that except tooling and library support. There’s some portent behind the fact that (at least IMO!) the only really useable Scala IDE is done by JetBrains. I don’t think Kotlin will suffer there.\n\n(Also — “implicates”? WTF? Implicits. Need to turn off automatic spelling correction …)","timestamp":"2011-07-30T15:25:55.000-07:00","score":2,"subreddit":"scala","ups":2,"daytype":"weekend","day_of_week":6}
{"author":"___forMVP","body":"hey, YOU don't exist man!","timestamp":"2011-12-08T20:49:30.000-08:00","score":0,"subreddit":"xkcd","ups":0,"daytype":"weekday","day_of_week":4}
{"author":"torilikefood","body":"[Santa Baby](http://www.youtube.com/watch?v=xOMmSbxB_Sg)\n\n[Baby, it's cold outside](http://www.youtube.com/watch?v=009kRJKf9rg&amp;feature=related)\n\n\n\nThese aren't the originals, but I don't see them on the list!","timestamp":"2011-12-08T22:03:03.000-08:00","score":5,"subreddit":"xkcd","ups":5,"daytype":"weekday","day_of_week":4}
{"author":"coronaride","body":"Nooooooooooooooo!!!  Where's Christmas Shoes?!","timestamp":"2011-12-09T12:19:59.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"tekgnosis","body":"I was agreeing with you, I just came at the problem from a different angle :p","timestamp":"2011-12-09T08:35:02.000-08:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":5}
{"author":"CuseinFL","body":"I play this every year. My family hates it. Also- Mistress for Christmas by AC/DC.","timestamp":"2011-12-09T06:36:10.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"jezmck","body":"Okay, I guess I meant 'The same people are the ones with the time and money to spend.'","timestamp":"2011-12-09T01:34:56.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"tekgnosis","body":"The inventions of the early 20th century greatly improved dissemination of propaganda. The economic conditions of the first half of the century weren't exactly conducive to selling stuff people didn't need so things were more focused on political messages. Arguably, the baby-boomers came about at just the right time to be trapped into thinking that everything they heard was true. By no means is this phenomena limited to them, the Internet is worse than TV and radio.","timestamp":"2011-12-09T01:30:32.000-08:00","score":6,"subreddit":"xkcd","ups":6,"daytype":"weekday","day_of_week":5}
{"author":"takatori","body":"In my defense, I live in Japan, where the American Society of Composers, Authors and Publishers doesn't hold much sway. \n\n ;-)","timestamp":"2011-12-09T04:15:54.000-08:00","score":-11,"subreddit":"xkcd","ups":-11,"daytype":"weekday","day_of_week":5}
{"author":"alphazero924","body":"Not when it's every fucking year.","timestamp":"2011-12-09T01:59:00.000-08:00","score":11,"subreddit":"xkcd","ups":11,"daytype":"weekday","day_of_week":5}
{"author":"eric_t","body":"And from last year onwards:\n\nMaria Mena - Home for Christmas","timestamp":"2011-12-09T06:37:24.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"alphazero924","body":"This is why my family traditionally has something different every year. While thanksgiving we still have the turkey dinner, we can't have the same meal every year twice.","timestamp":"2011-12-09T02:21:33.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"nomis80","body":"See Bob Hinden's reply to this argument here:\nhttp://www.ietf.org/mail-archive/web/ietf/current/msg65621.html","timestamp":"2011-02-28T05:17:58.000-08:00","score":14,"subreddit":"xkcd","ups":14,"daytype":"weekday","day_of_week":1}
{"author":"ChrisAndersen","body":"Ha! Dynamic systems strike again! Once you figure out the rules of the game and try to use your understanding to win the game, your plays change the rules in ways that you can't predict.","timestamp":"2011-02-28T12:41:11.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"mrgatorboy","body":"[Indeed, with the size stated by bob it appears they would still not run out of address space](http://www.wolframalpha.com/input/?i=%28volume+of+the+earth%29+%2F+%281+milimeter^3%29).  His calculation on the volume required in order to consume the whole earth and fill the address space at the same time results in a [very small bot](http://www.wolframalpha.com/input/?i=1.17+microns^3)","timestamp":"2011-02-28T05:24:11.000-08:00","score":4,"subreddit":"xkcd","ups":4,"daytype":"weekday","day_of_week":1}
{"author":"nomis80","body":"...or to momentum, by e.g. throwing small pieces of the Earth into space. If they throw them all in the same direction, the whole planet would become a spacecraft for the nanobots.","timestamp":"2011-02-28T13:35:06.000-08:00","score":5,"subreddit":"xkcd","ups":5,"daytype":"weekday","day_of_week":1}
{"author":"UberMouse894","body":"Seems rather good, I'll have to go it a go.","timestamp":"2011-08-25T19:04:06.000-07:00","score":2,"subreddit":"scala","ups":2,"daytype":"weekday","day_of_week":4}
{"author":"JZoidberg","body":"[Permalink](http://blog.xkcd.com/2011/08/24/earthquakes/)","timestamp":"2011-08-24T16:22:04.000-07:00","score":12,"subreddit":"xkcd","ups":12,"daytype":"weekday","day_of_week":3}
{"author":"scubaguy","body":"Same here. I really wish someone can put together a list of key features and bug fixes for 2.9.1, e.g., something like [PostgreSQL release notes](http://www.postgresql.org/docs/9.0/static/release-9-0-4.html)","timestamp":"2011-08-25T08:00:27.000-07:00","score":3,"subreddit":"scala","ups":3,"daytype":"weekday","day_of_week":4}
{"author":"Dropreich","body":"He was born in Indiana, actually. My great grandmother moved for the pregnancy and her family helped her out. It was really socially taboo then to have a child out of wedlock so I guess it was one of her few options. I'll see if the family has his birth certificate lying around anywhere.","timestamp":"2011-08-26T09:25:20.000-07:00","score":2,"subreddit":"Genealogy","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"Schizzovism","body":"Because comics only show static pictures.","timestamp":"2011-08-25T13:47:55.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":4}
{"author":"Nakor1011","body":"Thank you. I kept checking for a new xkcd because I thought this was Monday's.","timestamp":"2011-08-24T09:46:50.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"Arrgh","body":"IIRC, \"Perky 'Canada' has Own Government, Laws\"","timestamp":"2011-04-29T22:47:36.000-07:00","score":1,"subreddit":"scala","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"VorpalAuroch","body":"Thanks. I thought it might be a version issue, but this is part of an assignment and the class, for clarity, doesn't update its version in the middle of the academic year.","timestamp":"2011-04-28T19:24:27.000-07:00","score":1,"subreddit":"scala","ups":1,"daytype":"weekday","day_of_week":4}
{"author":"humblerodent","body":"Silly Huygens, they don't have vinyl in your time.","timestamp":"2011-04-29T09:36:15.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"naggingdoubt","body":"It could also use a '[Baby give it up](http://www.youtube.com/watch?v=AFmIau3ipbU&amp;t=60s)' coming off the same 'Na' as 'Hey Jude' does.","timestamp":"2011-01-24T15:02:30.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"thegauntlet","body":"Here is a random scan of one of the pages.  It has a bit of info on the findings, and a small branch of the family tree at the bottom.\nhttp://imgur.com/Y1nq2\n\nHere are my grandfathers instructions to whoever continues on his work...my pep talk\nhttp://imgur.com/OyJhY\n\nFrom what I gather from skimming through this book.  He compiled it in 1984.  I am wondering if there is more of his genealogy books out there as I know he flew to Norway countless times each year, and was in Utah several times a year also up until his death in 2003. ","timestamp":"2011-01-26T05:50:49.000-08:00","score":2,"subreddit":"Genealogy","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"GregOttawa","body":"Its \"records\" not \"record's\"","timestamp":"2011-01-26T02:57:50.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"DirtyDirtyPerverts","body":"Ah, but I speak of the pep band piece, which has been modified/transposed to the point of no return.","timestamp":"2011-01-24T12:00:03.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"bohne","body":"Is it possible to define polymorphic Functions in Scala like in Haskell?","timestamp":"2011-01-24T12:45:38.000-08:00","score":2,"subreddit":"scala","ups":2,"daytype":"weekday","day_of_week":1}
{"author":"spacenut37","body":"I post this brick wall every time. It's the biggest mystery I've found in my family history so far. Here's a timeline:\n\n1813: Frederick Nicloy is born.  \n1835-1838: Frederick Nicloy marries Almira.  \n1838: Lorinda is born.  \n1839: Hannah is born.  \n1840: The family of 4 is located in Arcadia, Wayne Co, NY on the census.  \n1842: James is born.  \n1846: Rebecca is born.  \n1850: Elizabeth is born.  \n1850: The family of 7 is located in Arcadia, Wayne Co, NY on the census, still next to one of their neighbors from 1840. Occupation: Common laborer. Value of real estate: $60. Poverty.  \n1852: Frederick attempts to kill his wife Almira. The family ends up in Michigan, because...  \n1853: Sheriff Paddock retrieves Frederick Nicloy from Michigan after two trips to stand trial for attempted murder. I've asked the Wayne Co. Clerk to find the papers of the criminal trial, but I'm not sure what happened because in...  \n1860: Almira and Elizabeth (now 11) are in Hillsdale, MI. James (now 17) is in Palmyra, the next town over from Arcadia, working on a farm. Frederick is nowhere to be found.  \n1868: James has moved to Hillsdale and married Clara Holbrook.\n\nSo, (1) What is Almira's maiden name? (2) What happened to Frederick? According to the county, he never had a trial - did he escape? (3) How exactly did James get to Michigan? Did he not flee with the family in the first place because he was already a farmhand?","timestamp":"2011-01-26T07:43:26.000-08:00","score":2,"subreddit":"Genealogy","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"myotheralt","body":"&amp;#3232;\\_&amp;#3232;\n","timestamp":"2011-01-26T00:09:14.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"gauriemma","body":"\"Hey Jude\" is right, but I think there are 7 na's missing from \"Land of 1,000 Dances.\" Or is that what the looped arrow is supposed to represent?\n\nQuoting\n\"I said a Na, na na na na, na na na na, na na na, na na na. Na na na na.\"","timestamp":"2011-01-24T13:04:19.000-08:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":1}
{"author":"leoboiko","body":"Here’s a bit from his wpedia page:\n\n&gt;  The Soviet sports system rewarded athletes for setting new world records, and he became noted for establishing new records by slim amounts, sometimes as little as a centimeter higher. This allowed him to collect frequent bonus payments and made Bubka an attraction at track-and-field meets.\n\nIf it was truly intentional, this means the URSS incentive system resulted in this guy hogging up all 14 top slots, instead of just the top few.","timestamp":"2011-01-26T02:59:06.000-08:00","score":12,"subreddit":"xkcd","ups":12,"daytype":"weekday","day_of_week":3}
{"author":"toxiccandles","body":"It seems that he's fixed it so maybe it was a genuine error.","timestamp":"2011-01-26T05:47:02.000-08:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":3}
{"author":"holocarst","body":"Even without the incentive  he would be pretty stupid to jump 6.14m right of the bat, when he knows that a 6.06 would be enough to win every competition.","timestamp":"2011-01-26T03:19:08.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"ChrisHansensVoice","body":"his results would be different if he was using google from - for instance - the UK.","timestamp":"2011-04-19T02:32:05.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":2}
{"author":"Nyax-A","body":"2105 - All Your Base used as battle cry.\n\n2123 - All Your Base becomes new US motto.","timestamp":"2011-04-18T03:58:35.000-07:00","score":17,"subreddit":"xkcd","ups":17,"daytype":"weekday","day_of_week":1}
{"author":"DethKlokBlok","body":"14 blades.  Yeah, right.","timestamp":"2011-04-18T07:05:09.000-07:00","score":5,"subreddit":"xkcd","ups":5,"daytype":"weekday","day_of_week":1}
{"author":"plbogen","body":"Billy Joel is that you?","timestamp":"2011-04-18T06:17:29.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":1}
{"author":"sighdvu","body":"But too expensive atm? If not, go on...","timestamp":"2011-04-18T14:40:02.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":1}
{"author":"earthbound_loveship","body":"&gt; 2014: GNU/Linux becomes dominant OS\n\n3 years? ya. thats not happening lol\n\nsome of these things may very well come to pass though (aside from the natural disasters) i mean if its from googles results, its in the minds of people that will literally be *creating* the future in the years to come","timestamp":"2011-04-18T20:03:48.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"phaedrusalt","body":"A good part of making something funny is a surprise, a turn of the tables where the audience has to spend a moment to grasp the new situation that isn't anything like they expected.  When this is done with economy (Few words, pictures, etc) then the result is genius.","timestamp":"2011-02-07T11:21:20.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"phaedrusalt","body":"Pure genius!","timestamp":"2011-02-07T00:41:03.000-08:00","score":5,"subreddit":"xkcd","ups":5,"daytype":"weekday","day_of_week":1}
{"author":"XenonBG","body":"I still think \"Cowboys and Aliens\" is a stupid and non-creative name for a possibly very good movie.","timestamp":"2011-02-04T02:20:16.000-08:00","score":5,"subreddit":"xkcd","ups":5,"daytype":"weekday","day_of_week":5}
{"author":"haakon","body":"Thanks, I see I need to continue to work on my Scala-fu :-)","timestamp":"2011-02-06T10:45:41.000-08:00","score":1,"subreddit":"scala","ups":1,"daytype":"weekend","day_of_week":7}
{"author":"tdehnel","body":"The only difference between the \"hot-spot\" words and the \"mundane\" words is that the \"hot-spot\" ones are popular.  If \"ferret\" was popular instead of \"ninja\" they could easily replace each other.","timestamp":"2011-02-04T12:43:21.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"thorax","body":"I like this explanation, but it doesn't align with the alt-text. I think he's just taking \"give me\" lines and putting threats after them?\n\nLike this?\n\n* Give me liberty or I will tell your wife about your affair.\n* [Give me a museum](http://twitter.com/#!/rainnwilson/statuses/28634629508) or I'll fill you full of holes.\n* [Give me a dozen healthy infants, well-formed, and my own specified world to bring them up in](http://en.wikipedia.org/wiki/John_B._Watson#.22Twelve_infants.22_quotation) or I'll take my ball and go home.\n","timestamp":"2011-02-07T14:23:44.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":1}
{"author":"Marhault","body":"....and quite accurately I would add... ","timestamp":"2011-02-04T04:20:20.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"a34tjkx","body":"Bummer.\n\nThe only other people alive are in our parent's generation (2nd cousins). They can be either male or female. Any chance of a test working here? Unfortunately, the female on the top branch of the left side was the other sibling of my great-grandfather's to have children.","timestamp":"2011-09-26T21:29:28.000-07:00","score":1,"subreddit":"Genealogy","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"urmyheartBeatStopR","body":"I like the 2nd edition by Odersky but it is moderately technical. I'm not entirely sure if having a CS background helps but it doesn't hurt with all the technical stuff it goes through. Then again of course there are very smart people out there that would think that this book is cake. &gt;___&lt;","timestamp":"2011-09-26T16:16:59.000-07:00","score":2,"subreddit":"scala","ups":2,"daytype":"weekday","day_of_week":1}
{"author":"Sahlaek","body":"Simpsons did it. ","timestamp":"2011-09-27T23:22:47.000-07:00","score":0,"subreddit":"xkcd","ups":0,"daytype":"weekday","day_of_week":2}
{"author":"DEADB33F","body":"Is direct P2P not possible with HTML5 websockets?\n\nA quick search implies that [it should be possible](http://geeknizer.com/html5-p2p-video-communications/).","timestamp":"2011-09-27T21:58:36.000-07:00","score":7,"subreddit":"xkcd","ups":7,"daytype":"weekday","day_of_week":2}
{"author":"Tyler5280","body":"And this will go down as the greatest mystery in my personal history of the internet. ","timestamp":"2011-09-27T21:54:52.000-07:00","score":14,"subreddit":"xkcd","ups":14,"daytype":"weekday","day_of_week":2}
{"author":"hachaliah","body":"Unfortunately, you're stuck based on the chart you put together.  I'd suggest checking to see if there are any other siblings that were male and go down the line.  Y dna goes strictly paternal, and mtdna is strictly maternal.","timestamp":"2011-09-26T20:39:06.000-07:00","score":1,"subreddit":"Genealogy","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"OriginalSyn","body":"I work for a website so no compilation but our equivalent is unittests, it takes 30 minutes to run the entire suite. \n\n&gt; Running unittests, going for coffee what does everyone want?","timestamp":"2011-11-28T18:18:46.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":1}
{"author":"j4w","body":"Its customary at my work to open Eclipse first thing in the morning and then go and get a cuppa. Its usually about finished by the time the tea's brewed.","timestamp":"2011-11-28T13:50:22.000-08:00","score":22,"subreddit":"xkcd","ups":22,"daytype":"weekday","day_of_week":1}
{"author":"Seybolt","body":"As someone with experience of this, the prospect is often unlikely to believe that.","timestamp":"2011-11-27T23:03:08.000-08:00","score":8,"subreddit":"xkcd","ups":8,"daytype":"weekend","day_of_week":7}
{"author":"oelang","body":"I don't expect scala to to replace java, nobody does (I hope), it also doesn't need to overtake java to be successful. If 10% of all java developers switch to scala it will be a huge success.\n\nAnd about that mindshare, 2 years ago almost nobody had heard of scala. Now, most java developers have heard of it, maybe 10% took the time to take a look at it even less have actually used it. Scala still has a long way to go.\nGetting into the enterprise takes even more time, and I'm sure many developers (like me) are waiting for the right time to introduce it.\n","timestamp":"2011-11-28T16:28:48.000-08:00","score":3,"subreddit":"scala","ups":3,"daytype":"weekday","day_of_week":1}
{"author":"cturkosi","body":"Well, I suppose it's a matter of supply and, more importantly, demand. How badly does he need it? And he'll learn a valuable lesson about preparing in advance, carrying a spare key etc.\n","timestamp":"2011-11-28T03:03:01.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"Nebu","body":"I feel bad for Gavin needing to participating in this flame war. I'm giving him the benefit of the doubt, at least until he has a compiler implemented so we can play around with the language.","timestamp":"2011-11-28T09:41:46.000-08:00","score":0,"subreddit":"scala","ups":0,"daytype":"weekday","day_of_week":1}
{"author":"eyedoc1","body":"I'm glad to see we have a nice little community to call our own. ","timestamp":"2011-06-18T15:27:19.000-07:00","score":2,"subreddit":"optometry","ups":2,"daytype":"weekend","day_of_week":6}
{"author":"blue_strat","body":"A+++ would read again.","timestamp":"2011-06-17T04:27:56.000-07:00","score":4,"subreddit":"xkcd","ups":4,"daytype":"weekday","day_of_week":5}
{"author":"Frankfurter","body":"Still a little fresh. Waited a long time for my work permit and then license. sure wish i could do a little more medical optometry. Overall, great office, and great patients make me a happy guy. ","timestamp":"2011-06-18T21:09:10.000-07:00","score":2,"subreddit":"optometry","ups":2,"daytype":"weekend","day_of_week":6}
{"author":"Frankfurter","body":"It's going well thanks. massachusetts here. How're you?","timestamp":"2011-06-18T13:29:38.000-07:00","score":2,"subreddit":"optometry","ups":2,"daytype":"weekend","day_of_week":6}
{"author":"aletoledo","body":"it would have been funnier if there wasn't a popular commerical product already with that name. My first thought is that he was biting into a bottle.","timestamp":"2011-02-15T11:22:59.000-08:00","score":-1,"subreddit":"xkcd","ups":-1,"daytype":"weekday","day_of_week":2}
{"author":"aperson","body":"1.  Move mouse over comic\r\n2.  Read title-text\r\n3.  ???\r\n4.  Get joke","timestamp":"2011-02-15T12:46:04.000-08:00","score":5,"subreddit":"xkcd","ups":5,"daytype":"weekday","day_of_week":2}
{"author":"eric22vhs","body":"I was considering the outside of your body, but okay..","timestamp":"2011-02-14T16:03:58.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":1}
{"author":"cs80","body":"This blog entry could be boiled down to 1 sentence.\n\n\"I saw some bad scala and it wasn't really worse than bad java\".\n\nAs someone who would like to use scala in the enterprise, this anecdote does not provide me any useful evidence to convince my superiors.","timestamp":"2011-02-14T08:30:50.000-08:00","score":0,"subreddit":"scala","ups":0,"daytype":"weekday","day_of_week":1}
{"author":"barron42","body":"I will give this a try. I did to a degree online but to no avail. I think it warrants another try at the local library. I've been putting it off because it's so far away but maybe it's worth the trip.","timestamp":"2011-02-14T17:53:11.000-08:00","score":1,"subreddit":"Genealogy","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"McFrosty","body":"You are a hero. Show those grammar Nazi's whose in charge.","timestamp":"2011-02-14T15:52:12.000-08:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":1}
{"author":"Dead_Rooster","body":"Paging relevant_rule34. Come in in relevant_rule34, over.","timestamp":"2011-02-14T00:13:58.000-08:00","score":11,"subreddit":"xkcd","ups":11,"daytype":"weekday","day_of_week":1}
{"author":"punkgeek","body":"there's an absurd**ly tasty** amount of bacteria under your finger nails.\n\n*ftfy*","timestamp":"2011-02-13T21:26:38.000-08:00","score":29,"subreddit":"xkcd","ups":29,"daytype":"weekend","day_of_week":7}
{"author":"MeanMotherHubbard","body":"And you were wrong.  It's okay.  It happens to all of us.","timestamp":"2011-02-15T14:30:30.000-08:00","score":6,"subreddit":"xkcd","ups":6,"daytype":"weekday","day_of_week":2}
{"author":"MeniBike","body":"What's the tooltip? ","timestamp":"2011-08-12T00:09:36.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"yellowkills","body":"im defintily using this","timestamp":"2011-08-11T17:52:58.000-07:00","score":0,"subreddit":"xkcd","ups":0,"daytype":"weekday","day_of_week":4}
{"author":"Sahlaek","body":"You may end up inventing have invented a plausible form of [psychohistory](http://en.wikipedia.org/wiki/Psychohistory_(fictional). ","timestamp":"2011-11-16T19:58:37.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"laaabaseball","body":"aka Truthiness and Wikiality.","timestamp":"2011-11-16T01:55:25.000-08:00","score":5,"subreddit":"xkcd","ups":5,"daytype":"weekday","day_of_week":3}
{"author":"gfixler","body":"And I just noticed that I wrote student's instead of students'. *\\*sigh...\\**","timestamp":"2011-11-16T11:49:59.000-08:00","score":13,"subreddit":"xkcd","ups":13,"daytype":"weekday","day_of_week":3}
{"author":"HillbillyBoy","body":"Does anyone else think this might have been influenced (I'm only noticing the close timing) by the method use by the discovery channel in the last south park episode?","timestamp":"2011-11-16T14:27:45.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"vestigial","body":"A more conscious, cynical version of this was used to get the US into the Iraq war. Anti-Saddam informants, like Netanyahu, reported evil things about Iraq to the intelligence agency of any government that would hear them. Of course, no intelligence agency worth it's salt will divulge their sources, so when the United States heard that Saddam had weapons of mass destruction, they called up their friends in the UK and said, \"Have you heard this?\" And the UK replied, \"Why, yes we have.\" Voila! Two sources now confirm WMD's. ","timestamp":"2011-11-16T12:56:22.000-08:00","score":7,"subreddit":"xkcd","ups":7,"daytype":"weekday","day_of_week":3}
{"author":"ItsTitleTextNotAlt","body":"## ","timestamp":"2011-08-29T12:10:43.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"odLott","body":"You're using a relative path. Try with an absolute path, ie the entire path which would be c:\\scala-2.9.0.1\\bin In your case","timestamp":"2011-08-29T22:10:21.000-07:00","score":4,"subreddit":"scala","ups":4,"daytype":"weekday","day_of_week":1}
{"author":"ido","body":"Thanks for the thorough explanation, that always helps making the joke funnier!","timestamp":"2011-12-12T14:41:36.000-08:00","score":4,"subreddit":"xkcd","ups":4,"daytype":"weekday","day_of_week":1}
{"author":"TIAFAASITICE","body":"I think the closest to that would be what happened with [Anna Bågenholm](http://en.wikipedia.org/wiki/Anna_B%C3%A5genholm). So, still long ways to go. There are also people who have been 'frozen' in blizzards and later been resuscitated, though I can't find those articles now.","timestamp":"2011-12-12T13:00:07.000-08:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":1}
{"author":"gr3yhill","body":"Check out the [thread](http://www.reddit.com/r/geek/comments/n8pnz/my_friend_made_a_tool_to_test_how_nsfw_a_phrase/c3756d1) linked by op.","timestamp":"2011-12-11T18:49:33.000-08:00","score":3,"subreddit":"scala","ups":3,"daytype":"weekend","day_of_week":7}
{"author":"_mdm","body":"He deleted. I guess some men don't want anything logical, like karma.","timestamp":"2011-07-19T11:41:53.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":2}
{"author":"fscmj","body":"Reminded me of the Ku Kuei clan in Orson Scott Cards book [Treason](http://en.wikipedia.org/wiki/A_Planet_Called_Treason).","timestamp":"2011-07-20T10:57:01.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"sqrt2","body":"Then again, if it weren't for [pressure from the EU Commission](http://europa.eu/rapid/pressReleasesAction.do?reference=MEMO/09/301), the Micro-USB cellphone chargers would probably never have happened...","timestamp":"2011-07-19T21:31:17.000-07:00","score":8,"subreddit":"xkcd","ups":8,"daytype":"weekday","day_of_week":2}
{"author":"Buckwheat469","body":"Everybody knows it was the translator microbes.","timestamp":"2011-04-24T22:12:39.000-07:00","score":5,"subreddit":"xkcd","ups":5,"daytype":"weekend","day_of_week":7}
{"author":"haakon","body":"Ouch, that's devious. And an unfortunate trade-off for Scala's flexible syntax.","timestamp":"2011-04-27T00:32:37.000-07:00","score":1,"subreddit":"scala","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"EntropyFan","body":"The chart brings a movie quote to mind\n\"Life moves pretty fast. If you don't stop and look around once in a while, you could miss it.\"","timestamp":"2011-04-27T07:00:21.000-07:00","score":9,"subreddit":"xkcd","ups":9,"daytype":"weekday","day_of_week":3}
{"author":"XenonBG","body":"I'm 27 and yet \"Finding Nemo was 8 years ago\" was what did it for me. Fuck.","timestamp":"2011-04-27T11:20:19.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":3}
{"author":"dart22","body":"Just out of curiosity, how would you respond if I said something to the effect of, \"The Enterprise-D could absolutely take on an Imperial Star Destroyer in a fight\"? ","timestamp":"2011-04-25T17:19:15.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":1}
{"author":"Jigsus","body":"It's so bloody slow.","timestamp":"2011-09-08T23:43:26.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":4}
{"author":"steers82","body":"Save to a ZIP drive and post it?","timestamp":"2011-09-08T21:25:04.000-07:00","score":8,"subreddit":"xkcd","ups":8,"daytype":"weekday","day_of_week":4}
{"author":"jevon","body":"They did, it was ambushed with porn and warez, it shut down. Repeat hundreds of times. Only since the advent of easier file sharing (Bittorrent, P2P) has this become _less_ prevalent.","timestamp":"2011-09-08T21:35:08.000-07:00","score":5,"subreddit":"xkcd","ups":5,"daytype":"weekday","day_of_week":4}
{"author":"gfixler","body":"I usually open it in a hex editor, then type all the letters and numbers I see in there into an IM chat window.","timestamp":"2011-09-09T00:00:56.000-07:00","score":22,"subreddit":"xkcd","ups":22,"daytype":"weekday","day_of_week":5}
{"author":"MrMango786","body":"Exactly! But I like it, he is so similar to us, and he is a genius. I like that.","timestamp":"2011-09-09T01:29:08.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"Dr_Fix","body":"i.. i... *would that work??*","timestamp":"2011-09-08T23:51:12.000-07:00","score":6,"subreddit":"xkcd","ups":6,"daytype":"weekday","day_of_week":4}
{"author":"Atario","body":"Most chat programs have file transfer, not just AIM...","timestamp":"2011-09-08T21:57:58.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":4}
{"author":"myinnervoice","body":"I am a very lazy person. \n\nI just drew them in the dust on my back window. ","timestamp":"2011-09-09T02:27:41.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"vectorjohn","body":"Google docs allows file uploads.  Large files.","timestamp":"2011-09-09T09:25:43.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":5}
{"author":"Dr_Fix","body":"fair enough.\n\ni invite you to go look up a game called \"Black Box\", which is what i put in the archive. it's a simple game, good for a few minutes distraction at a time.","timestamp":"2011-09-09T10:13:05.000-07:00","score":4,"subreddit":"xkcd","ups":4,"daytype":"weekday","day_of_week":5}
{"author":"bitofaknowitall","body":"I have Avery relations way back in my tree.  Lots of people with relations from New England do.  There is a ton of info on this family.  I would start on Google Books. there are a lot of old books on there that will give you a ton of info on this family.\n[Here's one to get you started](http://books.google.com/books?id=94KAe52tmnYC&amp;dq=avery%20groton&amp;pg=PR7#v=onepage&amp;q&amp;f=false)","timestamp":"2011-11-02T07:01:25.000-07:00","score":1,"subreddit":"Genealogy","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"DarqWolff","body":"[I can't stop crying](http://xkcdsw.com/2492)","timestamp":"2011-11-01T15:58:09.000-07:00","score":20,"subreddit":"xkcd","ups":20,"daytype":"weekday","day_of_week":2}
{"author":"PSBlake","body":"Not necessarily romantic in the *eros* sense. I know a totally straight guy who has openly stated that this is exactly how he feels about me.\n\nI've never been entirely sure how to take that, actually.","timestamp":"2011-11-01T18:51:38.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":2}
{"author":"bananalouise","body":"The advantage of being an artist: never having to cite your [sources](http://4.bp.blogspot.com/-nM44tDCLKFk/TfvJ-EDJNMI/AAAAAAAAAn8/cgQmWyaZ50Y/s1600/linus-and-lucy.jpg).","timestamp":"2011-11-01T21:37:24.000-07:00","score":17,"subreddit":"xkcd","ups":17,"daytype":"weekday","day_of_week":2}
{"author":"PoopDog2000","body":"Just got mine today :)\nThanks, XKCD!","timestamp":"2011-05-20T17:05:47.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"crazy88s","body":"[That doesn't help.](http://imgur.com/cnZqu)","timestamp":"2011-05-19T12:39:32.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":4}
{"author":"rjsen","body":"I found [this cheat sheet](http://jim-mcbeath.blogspot.com/2008/12/scala-operator-cheat-sheet.html) a while back. It's a bit out of date at this point but you could probably use the script at the bottom to generate a new one (and potentially incorporate operators from nonstandard libraries as well). ","timestamp":"2011-10-25T10:43:54.000-07:00","score":2,"subreddit":"scala","ups":2,"daytype":"weekday","day_of_week":2}
{"author":"Yaltan","body":"buf ++= xs :: Append all elements in xs to buf\n-&gt; :: map to, as in val myMap = Map(1 -&gt; \"a\", 2 -&gt; \"b\")\n&lt;= :: LTE, except in Lift...\n_._ :: I believe applies a noop to both params?\n\nI'm pretty sure I got _._ wrong. Regardless, I recommend Programming in Scala 2nd Edition as a good reference for 85% of questions.","timestamp":"2011-10-24T23:01:00.000-07:00","score":2,"subreddit":"scala","ups":2,"daytype":"weekday","day_of_week":1}
{"author":"evilsaHas","body":"At first I thought that the patient was joking (maybe he was?) but then I looked over your posting history and everything else seems so serious. My professional answer is 'no clue'. Non-professionally, was he drunk? Cause I've seen some crazy drunk patients that make our office giggle. ","timestamp":"2011-10-25T00:21:16.000-07:00","score":4,"subreddit":"optometry","ups":4,"daytype":"weekday","day_of_week":2}
{"author":"plarp","body":"Round Cape York in Australia they said Chinese people tasted better than white ones.","timestamp":"2011-05-18T13:50:07.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"zem","body":"yeah, definitely","timestamp":"2011-05-18T19:55:38.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"unrealious","body":"Does anyone else think that Transfinite numbers should not be allowed to get measured?","timestamp":"2011-05-16T12:52:51.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":1}
{"author":"lapingvino","body":"NO, DON'T!","timestamp":"2011-05-16T08:05:38.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":1}
{"author":"battmutler","body":"If you remember the art being similar, then maybe it was this one? (looks like a rough copy...?) http://i.imgur.com/8eWdF.gif","timestamp":"2011-01-12T01:11:53.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"Tuna-Fish2","body":"&gt; I was writing some validation code to validate and parse data entered by a user. The validation function should return an object of some type, but it should return a string representing an error message in case of failure (in case the input in invalid). Too bad the Option type isn’t sufficient for this. Enter scala.Either.\n\nTo me, this just feels plain wrong. If a function cannot complete the task it is given, why not just use exceptions? That's what they are for.","timestamp":"2011-01-10T11:08:11.000-08:00","score":1,"subreddit":"scala","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"TheThirdBlackGuy","body":"[You don't need to click this](http://www.youtube.com/watch?v=iP6XpLQM2Cs)\n\nI warned you.","timestamp":"2011-01-11T21:58:16.000-08:00","score":24,"subreddit":"xkcd","ups":24,"daytype":"weekday","day_of_week":2}
{"author":"armchairnixon","body":"Haha, you're welcome. Now you must go back and reread every comic in light of this new information.","timestamp":"2011-01-12T13:34:36.000-08:00","score":8,"subreddit":"xkcd","ups":8,"daytype":"weekday","day_of_week":3}
{"author":"utexaspunk","body":"Dear Ke$ha, It's hard to describe the pain of a deeply infected dental nerve. To get an idea, put your hand in a bowl full of ice cubes. Hold them there for 90 seconds. Now imagine that pain in your jaw, every minute of every hour, bright and searing, washing out everything. You can't party all night. You can barely stand up. There's only the pain. **Your \"music\" is the aural equivalent of this.**","timestamp":"2011-01-12T06:00:33.000-08:00","score":9,"subreddit":"xkcd","ups":9,"daytype":"weekday","day_of_week":3}
{"author":"thisistooeasy","body":"how did you do that cool nooooo?","timestamp":"2011-01-09T06:22:19.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekend","day_of_week":7}
{"author":"paulrpotts","body":"Here's an analogy in 2-dimensional space. Let's say you make a map of your town, your yard, your county, whatever, on a regular piece of 8x10 paper. Go somewhere within the place and drop the map on the ground. There is guaranteed to be a point on the map which is right on top of the point in the real world that it maps. This is true even if you crumple up the piece of paper before tossing it on the ground.","timestamp":"2011-04-01T10:56:34.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"priscellie","body":"Devastating.  I'm so sorry that you and your loved ones are going through such pain, Randall, and I hope your family beats the odds!","timestamp":"2011-04-04T07:45:18.000-07:00","score":4,"subreddit":"xkcd","ups":4,"daytype":"weekday","day_of_week":1}
{"author":"Daelana","body":"I'm really surprised there weren't more replies to this.","timestamp":"2011-03-31T22:24:06.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":4}
{"author":"bezko","body":"http://xkcd.com/xk3d/ I swear to god the link wasn't there before","timestamp":"2011-03-31T23:26:07.000-07:00","score":11,"subreddit":"xkcd","ups":11,"daytype":"weekday","day_of_week":4}
{"author":"jakash","body":"This was incredibly solemn and somewhat eerie. I did not expect my Monday morning XKCD fix to begin like this dammit :'(","timestamp":"2011-04-04T02:29:07.000-07:00","score":6,"subreddit":"xkcd","ups":6,"daytype":"weekday","day_of_week":1}
{"author":"jaredw","body":"THIS FUCKING SUCKS","timestamp":"2011-04-01T18:18:31.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"chromakode","body":"Crazy comput'r vision algorithms can only go so far, my fri'nd.","timestamp":"2011-04-01T02:33:19.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"aspir2005","body":"Autocomplete is still just as broken as always for me. You're using wip_experiment and not wip-exp-backport right?","timestamp":"2011-04-03T10:06:52.000-07:00","score":1,"subreddit":"scala","ups":1,"daytype":"weekend","day_of_week":7}
{"author":"ChrisHansensVoice","body":"and that periods seem to happen more often after heavy drinking.","timestamp":"2011-07-27T16:55:25.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"panda7488","body":"The printed German is very basic census like things -- name, birthdate, etc. but I can't read the hand written German, unfortunately.","timestamp":"2011-07-26T14:59:26.000-07:00","score":1,"subreddit":"Genealogy","ups":1,"daytype":"weekday","day_of_week":2}
{"author":"raldi","body":"My X-is-the-big-day results don't reproduce his. I see Monday having twice as many hits as the other weekdays. ","timestamp":"2011-07-26T23:25:37.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":2}
{"author":"integ3r","body":"In my experience, they actually do but have very minor things broken for more complicated themes. In most cases, WordPress is pretty good about backwards compatibility.","timestamp":"2011-08-30T21:35:46.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":2}
{"author":"aroomacanvas","body":"It's not really lying to you, more just trying to help you have a more positive outlook. Believing something will turn out well often positively affects the outcome.","timestamp":"2011-08-31T11:54:46.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"Kowzorz","body":"I've been saying this for years. I replace \"I'm sorry\" with \"My condolences\" and it seems to fix my problem with saying \"I'm sorry\".","timestamp":"2011-08-31T09:59:50.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"producer35","body":"I do this now: \"I sympathize with you.\"\n\nIt may sound overly formalistic but at least the response has been properly interpreted every time. Most often the reply is \"thank you.\" ","timestamp":"2011-08-31T01:53:33.000-07:00","score":5,"subreddit":"xkcd","ups":5,"daytype":"weekday","day_of_week":3}
{"author":"the_classy_corsair","body":"I for one, welcome our new new social networking overlords.\n\n","timestamp":"2011-06-29T12:36:26.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"DebtOn","body":"Your pet's name was Nigger?  Where the hell did you grow up?","timestamp":"2011-04-11T00:45:08.000-07:00","score":7,"subreddit":"xkcd","ups":7,"daytype":"weekday","day_of_week":1}
{"author":"mepcotterell","body":"Wish I could go. Ticket price is awesome, but I just don't know if I can afford the travel expenses. :(","timestamp":"2011-04-12T07:01:15.000-07:00","score":1,"subreddit":"scala","ups":1,"daytype":"weekday","day_of_week":2}
{"author":"doctorwaffle","body":"Bob Carpenter. Let's do this.","timestamp":"2011-04-13T04:53:53.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"Axelraud","body":"Tango North","timestamp":"2011-04-11T05:42:06.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"MyaloMark","body":"I'm \"Rusty Main\", man of action!","timestamp":"2011-04-11T19:28:05.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"Maxion","body":"Lucky halfmoonbow","timestamp":"2011-04-11T00:23:45.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"Shaken_Earth","body":"Mine is Max Thomas. The interesting thing is Thomas is my real first name.","timestamp":"2011-04-11T20:25:32.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"PirateMud","body":"Surely, as long as it's less than £145 value, it's not taxed?","timestamp":"2011-06-25T08:31:21.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekend","day_of_week":6}
{"author":"the8thbit","body":"Maybe they just needed bags to carry all the stuff they robbed from other houses.","timestamp":"2011-06-24T12:20:37.000-07:00","score":8,"subreddit":"xkcd","ups":8,"daytype":"weekday","day_of_week":5}
{"author":"Anzat","body":"First thing I thought of was to expect some sort of booger joke, until I clicked the link.","timestamp":"2011-06-24T10:47:55.000-07:00","score":0,"subreddit":"xkcd","ups":0,"daytype":"weekday","day_of_week":5}
{"author":"chalk46","body":"[Na](http://xkcd.com/851/)","timestamp":"2011-06-27T03:48:26.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"Canteloupe","body":"Couldn't someone throw out the bread?","timestamp":"2011-06-24T07:14:33.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":5}
{"author":"Klinefelter","body":"haha wow, whoops, good catch","timestamp":"2011-06-25T15:44:58.000-07:00","score":2,"subreddit":"optometry","ups":2,"daytype":"weekend","day_of_week":6}
{"author":"akabaka","body":"Either that or in the bottom of a locked filing cabinet stuck in a disused lavatory with a sign on the door saying 'Beware of the Leopard'.","timestamp":"2011-05-11T19:38:31.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"flyingpostman","body":"Ask any elevator mechanic, they use the stairs.","timestamp":"2011-05-11T05:46:23.000-07:00","score":5,"subreddit":"xkcd","ups":5,"daytype":"weekday","day_of_week":3}
{"author":"romkeh","body":"My last apartment had regular inspection checks marked in the elevator.\n\nThe emergency phone was missing, the 4th floor didn't work and could be unlocked with a mere penny (each floor had a key activation), the security camera had been stolen and there was gum in the fire marshal's keyhole.\n\nNice.","timestamp":"2011-05-11T10:00:57.000-07:00","score":4,"subreddit":"xkcd","ups":4,"daytype":"weekday","day_of_week":3}
{"author":"p0k3m0nm4st3r","body":"Challenge accepted.","timestamp":"2011-05-11T23:50:58.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"scott-42","body":"Also I will add that you should go armed with a bit more information to help you with your search. I would suggest you contact your immediate family and ask them for any and all information they might know about your family. You might be surprised that someone already knows the maiden name or place of birth. That will really help you in your search.\n\nThe main problem I see with only having the name to go on is that the last federal census that was made available was the 1930 census. The 1940 census will be available in 2012. So if you happen to find your grandmother in the census records, you will be looking for an infant from 0-1 years of age. There is a very slim chance you will find an infant matching that description without already knowing the maiden name (your great grandparents name).\n\nFor a living relative, the easiest way is to just ask them. If they are unwilling to answer, then the next best method is to start from the people you know. My father refused to tell me anything about his family (similar to your grandmother) but that didn't stop me from tracing back a couple hundred years already. But it takes a lot of time if everyone is uncooperative.\n\nThis would be my plan of attack for your search:\n\n* Request a copy of your Father's birth certificate from where ever he was born or from him if he has a copy (which he should). (I assume that he will talk to you. If not, start with your birth certificate to figure out where your father was born and request from there.) This document should have your grandmothers full maiden name on it as well as having her age and possibly her city and state of birth.\n* Request a copy of your grandmother's birth certificate from where ever she was born. This will have her parent's names and ages. With those you should be able to mount a pretty good search online from that point.\n* If your father knows where your grand parents were married, I would request a copy of their marriage certificate/license. That also usually has all of the parents information on it as well as birthplace and dates.\n\nIf you don't have any idea on where to get birth certificates, ping me back and I can lookup the address for the city, county, state you are interested in. The index books are also generally available in the library.\n\nEdit: formatting","timestamp":"2011-05-12T17:06:41.000-07:00","score":2,"subreddit":"Genealogy","ups":2,"daytype":"weekday","day_of_week":4}
{"author":"katzenjammer360","body":"Ah! That's cute!","timestamp":"2011-07-05T23:17:56.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":2}
{"author":"cwm44","body":"Sure you are... so the fact your username suggests genital dismemberment is just a coincidence then?","timestamp":"2011-07-04T04:20:24.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"auxiliary-character","body":"Considering he was using numbering for the comics... I would assume he would move the location of the 404 error page unless it was a joke.","timestamp":"2011-07-05T23:50:07.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":2}
{"author":"McWhiskey","body":"i hate watching youtube with other people. It ruins the magic.","timestamp":"2011-07-03T22:00:35.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekend","day_of_week":7}
{"author":"CapNRoddy","body":"Oh, that's not what I meant. your link is working. What I mean is, when i go to just xkcd.com instead of showing today's comic, it shows the previous one","timestamp":"2011-07-06T02:39:25.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"adaminc","body":"You best bet would be to actually go there, or find someone who is there that will find it for you.","timestamp":"2011-11-05T18:17:41.000-07:00","score":1,"subreddit":"Genealogy","ups":1,"daytype":"weekend","day_of_week":6}
{"author":"harumpf","body":"My television also has MTV Brand New and MTV Music 24. Both still play 24h music. And there are also a couple of other (crap) music stations.","timestamp":"2011-11-04T09:09:49.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"Starly24","body":"1891 Census\n\nWallace Roberts (Age 24) Grocers assistant\nMinnie Roberts  (Age 18)\nWallace Roberts (Age 11 months)\n\n5 Moody (?) Street\nBradford \nLancashire \n\n1901 Cencus\n\nWallace Roberts (34) Grocer ??? Sorry can't read it.\nMinnie Roberts (28)\nWallace Roberts (10)\nLily Stokes (18) Cotten Winder (American border)\n\n11 Rowland Street\nBeswick\nLancashire\n\n\nWallace was born in Oswestry, Shropshire, England\nMinnie's just says United States\nWallace Jr was born in Manchester\n\n","timestamp":"2011-05-27T11:28:22.000-07:00","score":1,"subreddit":"Genealogy","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"ColtonProvias","body":"On a lot of attractions at Walt Disney World, seeing something like this would trigger an emergency stop.  If you even pull something out on Tower of Terror to throw or it can easily injure somebody else, they will stop the entire attraction.\n\nHowever, I do have one story from a friend who worked Splash Mountain.  The strangest thing he has seen come up on the photos for Splash Mountain was a man who had an entire boat to himself and was shaving with shaving cream.  He already had the cream in his hands and a razor hidden in the pocket of his shorts.  Plus, he was very nonchalant about it in the image, thus making it one of the best they have seen at Splash.","timestamp":"2011-05-28T05:54:40.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekend","day_of_week":6}
{"author":"Klinefelter","body":"you have my sword!","timestamp":"2011-05-28T12:11:41.000-07:00","score":1,"subreddit":"optometry","ups":1,"daytype":"weekend","day_of_week":6}
{"author":"signoff","body":"FizzBuzz","timestamp":"2011-05-28T03:45:18.000-07:00","score":0,"subreddit":"scala","ups":0,"daytype":"weekend","day_of_week":6}
{"author":"Quicksilver_Johny","body":"If I remember correctly, that Jenga set took a while to superglue together.","timestamp":"2011-05-27T22:38:12.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"myhairispink","body":"http://xkcd.com/828/","timestamp":"2011-06-20T22:50:20.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":1}
{"author":"spacenut37","body":"That's a guideline.  I'm a volunteer and I'd routinely pull a bunch of records at the same time.  Find a volunteer and email them with one, and ask if they wouldn't mind pulling several additional records at the same time.","timestamp":"2011-06-20T12:49:03.000-07:00","score":2,"subreddit":"Genealogy","ups":2,"daytype":"weekday","day_of_week":1}
{"author":"elpablo","body":"Dick Wall is an ex-googler who runs the Java Posse podcast.  I know you were joking, but he is quite well known and respected.","timestamp":"2011-06-21T10:08:38.000-07:00","score":3,"subreddit":"scala","ups":3,"daytype":"weekday","day_of_week":2}
{"author":"redwall_hp","body":"Use quotation marks.\n\n&gt; a \"PARTY!\" banner","timestamp":"2011-06-20T12:54:58.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":1}
{"author":"stillalone","body":"I don't get it.  Is he supposed to be in a bathtub full of kidneys?","timestamp":"2011-06-19T21:18:45.000-07:00","score":19,"subreddit":"xkcd","ups":19,"daytype":"weekend","day_of_week":7}
{"author":"atimholt","body":"Don't let his art style prevent you from reading xkcd, it's very deliberate. Plenty of his strips in the past have been pretty complex and artistic.\n\nNot saying he's Michelangelo or anything, but still.","timestamp":"2011-06-20T06:49:13.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":1}
{"author":"josbos","body":"The redundancy of this submission astounds me.","timestamp":"2011-06-21T05:18:44.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":2}
{"author":"quiI","body":"Anyone have any experience using this?","timestamp":"2011-06-21T00:31:17.000-07:00","score":1,"subreddit":"scala","ups":1,"daytype":"weekday","day_of_week":2}
{"author":"Ember357","body":"[Asbestos free](http://xkcd.com/641/)","timestamp":"2011-06-20T21:01:19.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":1}
{"author":"ishmal","body":"I have a little OAuth client in my work-in-progress [Pedro](https://github.com/ishmal/pedro) lib.  Tested on Twitter and Facebook.  It's not doc'd, but if you look in the tests, there is an example showing how simple it is. ","timestamp":"2011-11-23T13:46:35.000-08:00","score":1,"subreddit":"scala","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"ItsTitleTextNotAlt","body":"## ","timestamp":"2011-11-23T09:19:18.000-08:00","score":-7,"subreddit":"xkcd","ups":-7,"daytype":"weekday","day_of_week":3}
{"author":"bertolt","body":"I'm not sure how possible it is to get it without more math than you'd want to learn, and it's not that good anyway :[","timestamp":"2011-11-25T00:08:44.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"spado","body":"Alternative:\n\nhttp://maps.google.com/maps?q=king+and+james,+redwood+city&amp;hl=en&amp;ll=37.477906,-122.241333&amp;spn=0.012295,0.022724&amp;sll=37.0625,-95.677068&amp;sspn=49.844639,93.076172&amp;vpsrc=0&amp;hnear=James+Ave+%26+King+St,+Redwood+City,+San+Mateo,+California+94062&amp;t=h&amp;z=16&amp;layer=c&amp;cbll=37.47779,-122.241493&amp;panoid=KoekjLtiFUcPCkvkh7f5cw&amp;cbp=12,263.16,,1,5.98","timestamp":"2011-11-24T05:55:12.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":4}
{"author":"blueshiftlabs","body":"It's only impossible because the operating system prevents you from linking to a directory - on-disk, it's entirely possible to make multiple names point to the same directory data. Hence the title-text comment about modifying link() - it would be necessary to allow that.","timestamp":"2011-11-23T05:30:22.000-08:00","score":4,"subreddit":"xkcd","ups":4,"daytype":"weekday","day_of_week":3}
{"author":"sudosandwich3","body":"WHY DOES THIS EXIST","timestamp":"2011-02-16T07:41:46.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"g2g079","body":"Bah... I still need to go have 3 pulled.","timestamp":"2011-02-16T13:29:14.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"vlad003","body":"It's comic 18, so yea.","timestamp":"2011-02-15T17:16:56.000-08:00","score":6,"subreddit":"xkcd","ups":6,"daytype":"weekday","day_of_week":2}
{"author":"astroid0","body":"I'd just assume it is a way of referring to the internet and human mind as a whole. ","timestamp":"2011-02-16T09:58:18.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"aperson","body":"&gt; also mistakenly known as \"alt text\".\r\n\r\nFTFY","timestamp":"2011-02-18T08:31:35.000-08:00","score":8,"subreddit":"xkcd","ups":8,"daytype":"weekday","day_of_week":5}
{"author":"AgentConundrum","body":"That's very true. I just started doing some web testing for a local company, and in their issue tracker they have a dropdown to specify which browser it occurred in. Other than the individual browsers, they have categories for \"IE-Only\" and \"Non-IE\". I thought that said a lot.","timestamp":"2011-02-18T15:07:50.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"barron42","body":"I hope to not be one of those people.","timestamp":"2011-02-16T20:07:09.000-08:00","score":1,"subreddit":"Genealogy","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"vagif","body":"Showing the equivalent haskell code just emphasizes how ugly is scala syntax.","timestamp":"2011-09-04T12:13:17.000-07:00","score":-1,"subreddit":"scala","ups":-1,"daytype":"weekend","day_of_week":7}
{"author":"slacker22","body":"Poor comic really.\n\nHow to turn $100 into $1,000,000: Invest it at 5% for 190 years.","timestamp":"2011-09-05T00:14:25.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":1}
{"author":"hseldon10","body":"Which is why they can't be seriously considered an investment.","timestamp":"2011-09-05T07:09:03.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":1}
{"author":"fjord_piner","body":"I would love to see this kind of study from an organization that doesn't have a conflict of interest in reporting them.\n","timestamp":"2011-11-29T00:37:05.000-08:00","score":1,"subreddit":"scala","ups":1,"daytype":"weekday","day_of_week":2}
{"author":"jlh276","body":"Thoughtworks does consulting and software development. I'm sure they meet with a variety of customers or prospect customers and therefore they are in a good position to see industry trends. Whether they have on interest on pitching Scala, I don't think that's the case as they specifically said they were recommending Clojure or F#. ","timestamp":"2011-11-29T07:51:11.000-08:00","score":2,"subreddit":"scala","ups":2,"daytype":"weekday","day_of_week":2}
{"author":"hive_worker","body":"Ive been working on a custom linux kernel fora customer for the past couple months. takes about 45 min to compile.","timestamp":"2011-11-29T06:28:52.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":2}
{"author":"jalee21tn","body":"Nah, got out of public accounting and am an accounting manager/CFO/controller and IT guy for a small business...I have a life once again.","timestamp":"2011-11-29T06:27:03.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":2}
{"author":"mkosmo","body":"Oh man, I've walked around an F-1... they're breath taking.","timestamp":"2011-11-30T08:18:27.000-08:00","score":5,"subreddit":"xkcd","ups":5,"daytype":"weekday","day_of_week":3}
{"author":"gfixler","body":"No. There's fuck-all to do in Van Nuys. I walked around. I looked at trash piles. I admired the bars on people's windows - very sturdy. I walked to the one destination within reasonable walking distance - Subway - and had the Mexican woman working there ask me if I was Iranian (nope). Eventually I resorted to telling coworkers how awesome I was and showed them my script. I fell for the one trap every evil mastermind falls for - showing off. I couldn't use the script after that, but the job ended pretty soon afterwards. Then I got the fuck out of Van Nuys.","timestamp":"2011-11-29T00:45:44.000-08:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":2}
{"author":"mowdownjoe","body":"I think its already happened.","timestamp":"2011-08-02T17:42:41.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":2}
{"author":"g2g079","body":"It's","timestamp":"2011-08-01T05:50:25.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":1}
{"author":"ragnarokrudolph","body":"You stole that idea from the title text of the comic and are now whoring it out for karma.","timestamp":"2011-08-17T19:42:17.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"aaronla","body":"I rarely miss xckd references, but I even google is failing me on this one. Is there any significance to \"return of the arrow\"?\n\nThough, \"return of the boomerang\" yielded a [cryptography paper](http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.157.2171).","timestamp":"2011-08-16T21:52:35.000-07:00","score":8,"subreddit":"xkcd","ups":8,"daytype":"weekday","day_of_week":2}
{"author":"ASeriesOfTubers","body":"It's referred to as alt-text on [xkcd's mobile site](http://m.xkcd.com/)...","timestamp":"2011-08-17T17:35:14.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"dakk12","body":"Your name lied to  me, I demand justice.","timestamp":"2011-03-21T00:29:45.000-07:00","score":12,"subreddit":"xkcd","ups":12,"daytype":"weekday","day_of_week":1}
{"author":"ninjin","body":"There are some interesting recipes (check the PDF;s) and [a puzzling picture](http://people.reed.edu/~emcmanis/toasterwaffles.jpg) from the researcher Ellen McManis:\n\nhttp://people.reed.edu/~emcmanis/\n\n*\"Lastly, remember that while there’s a lot of focus on possible worst-case scenarios involving the nuclear plants, the tsunami was an actual disaster that’s already killed thousands. Hundreds of thousands more, including my best friend from college, are in shelters with limited access to basic supplies and almost no ability to contact the outside world.\"*\n\nI and many others in Japan have said this since last week and thank you Randall Munroe for sharing our frustration. There can not be enough emphasis on this, stop the bloody panic over the reactor and focus on the poor people who lost everything they own and are lacking medical assistance and more.","timestamp":"2011-03-20T20:59:02.000-07:00","score":6,"subreddit":"xkcd","ups":6,"daytype":"weekend","day_of_week":7}
{"author":"irrelevantxkcd","body":"Sorry about that. I meant this [xkcd](http://xkcd.com/69/)","timestamp":"2011-03-21T00:56:55.000-07:00","score":7,"subreddit":"xkcd","ups":7,"daytype":"weekday","day_of_week":1}
{"author":"korny","body":"Intellij is great for Scala - but until they fix this bug:\nhttp://youtrack.jetbrains.net/issue/SCL-2753\n\n... I'd stick to 10.0.0.1 and not the most recent version.  (For non-trivial projects, at least)","timestamp":"2011-03-19T03:40:10.000-07:00","score":1,"subreddit":"scala","ups":1,"daytype":"weekend","day_of_week":6}
{"author":"indoobitably","body":"it was obvious from the song that using one can cause serious mental problems.","timestamp":"2011-03-20T17:18:52.000-07:00","score":6,"subreddit":"xkcd","ups":6,"daytype":"weekend","day_of_week":7}
{"author":"alcoholland","body":"How would a device that reads by using light truly be an analog device?","timestamp":"2011-08-22T07:43:46.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":1}
{"author":"Squid_Tamer","body":"My favorite as well! \n\nBit of trivia: The pattern in the rocks appears to be [Wolfram Rule 110](http://en.wikipedia.org/wiki/Rule_110), which has been proven to be able to compute any problem computable. Though nobody has ever written a real program with 110, to my knowledge. ","timestamp":"2011-08-21T09:02:48.000-07:00","score":20,"subreddit":"xkcd","ups":20,"daytype":"weekend","day_of_week":7}
{"author":"qataridestroyer","body":"i just discovered if i point my cursor at the comic... my God...","timestamp":"2011-08-21T15:13:18.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekend","day_of_week":7}
{"author":"aclotus","body":"or pop some acid.. same shit happens\n","timestamp":"2011-08-22T01:31:42.000-07:00","score":-1,"subreddit":"xkcd","ups":-1,"daytype":"weekday","day_of_week":1}
{"author":"SarahC","body":"I blogged about this last week, without seeing the XKCD...\n\nI figured some low lying clouds, and a nice fast train journey should work well. After taking lot of pictures, something easy like this:\n\nAnaglyph Maker Ver1.08 by Takashi Sekitani / www.stereoeye.jp\n\nTo make the 3D piccies should work well. =D\n\n\nSomeone's done it from a plane! Awesome!\n\nhttp://www.flickr.com/photos/pinboke/3992283565/\n\nhttp://www.flickr.com/photos/26020895@N04/5792122963/\n\nVideo - cameras 3 meters apart: http://www.flickr.com/photos/firrs/2455569550/\n\n","timestamp":"2011-08-22T00:17:59.000-07:00","score":27,"subreddit":"xkcd","ups":27,"daytype":"weekday","day_of_week":1}
{"author":"buu700","body":"I have an autographed copy of this framed on my wall and my cousin was just reading it this morning.","timestamp":"2011-08-21T12:38:39.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekend","day_of_week":7}
{"author":"AaronInTheForest","body":"Fuck!  It's been another **whole hour!**  I work in forestry and I have to report on the cloud conditions around my tower twice a day. I fucking want to do this so bad!","timestamp":"2011-08-22T07:54:01.000-07:00","score":11,"subreddit":"xkcd","ups":11,"daytype":"weekday","day_of_week":1}
{"author":"L3375","body":"Further proof that comic strips are fully capable of creating beauty.","timestamp":"2011-08-21T22:44:37.000-07:00","score":23,"subreddit":"xkcd","ups":23,"daytype":"weekend","day_of_week":7}
{"author":"californiademise3","body":"yeah I know its jesse, I wanted to know if you quoted him in other post comments, but it doesn't really matter.","timestamp":"2011-11-09T23:19:03.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"OrgasmicRegret","body":"Can someone explain this to me? Even with the hover caption I don't get it.  I believe it has something to do with the boats I made as a kid that could be propelled with soap, but don't understand how the comic portrays that.\n\nThanks.","timestamp":"2011-11-10T23:00:01.000-08:00","score":8,"subreddit":"xkcd","ups":8,"daytype":"weekday","day_of_week":4}
{"author":"Morrigane","body":"Sounds familiar.  Hunting down someone can be more fun than a video game.","timestamp":"2011-11-10T04:33:16.000-08:00","score":1,"subreddit":"Genealogy","ups":1,"daytype":"weekday","day_of_week":4}
{"author":"Eslader","body":"Pssst. Try not to let the word get out but. . .People in England can READ that shit, man! ;)\n","timestamp":"2011-12-30T08:55:14.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"postExistence","body":"Its usage in Rachel Maddow's show seems appropriate; the idea of the \"good old days\" was what that comic was poking fun at.","timestamp":"2011-12-30T19:52:03.000-08:00","score":14,"subreddit":"xkcd","ups":14,"daytype":"weekday","day_of_week":5}
{"author":"ManicCasanova","body":"Thanks much, I used the camera a bit today. I'm just going to keep it.","timestamp":"2011-12-30T21:44:39.000-08:00","score":1,"subreddit":"Cameras","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"Zerak-Tul","body":"[The clip](http://www.msnbc.msn.com/id/26315908/ns/msnbc_tv-rachel_maddow_show/#45830938) (right near the end of it.)","timestamp":"2011-12-30T21:29:38.000-08:00","score":9,"subreddit":"xkcd","ups":9,"daytype":"weekday","day_of_week":5}
{"author":"newskul","body":"Carl with a C!","timestamp":"2011-12-30T08:28:55.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"Xusder","body":"Just watched the segment, she does say the name of the site and also had the \"From XKCD\" next to the image. So at least they cite XKCD, and hopefully the strip gets more views because of it, haha!","timestamp":"2011-12-31T00:34:01.000-08:00","score":6,"subreddit":"xkcd","ups":6,"daytype":"weekend","day_of_week":6}
{"author":"solmakou","body":"Oh you got me, you, you're good you.","timestamp":"2011-12-30T03:52:32.000-08:00","score":5,"subreddit":"xkcd","ups":5,"daytype":"weekday","day_of_week":5}
{"author":"PfalzAmi","body":"You could also contact them and ask them to invite you to view their tree.","timestamp":"2011-12-30T03:11:52.000-08:00","score":3,"subreddit":"Genealogy","ups":3,"daytype":"weekday","day_of_week":5}
{"author":"FacelessBureaucrat","body":"Don't have that, but here's a [blog that illustrates Missed Connections](http://missedconnectionsny.blogspot.com/).","timestamp":"2011-08-08T16:45:14.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"dakk12","body":"The joke is about Google street view cars being caught sucking up lots of data from wifi networks.  So the Google street car was able to know everything about its missed connection","timestamp":"2011-08-07T23:25:46.000-07:00","score":13,"subreddit":"xkcd","ups":13,"daytype":"weekend","day_of_week":7}
{"author":"DeoxyribonucleicAcid","body":"I got angry at it, backed up all files (No backup already, friend's computer) And reinstalled the OS. Generally my solution.","timestamp":"2011-08-07T13:06:20.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekend","day_of_week":7}
{"author":"flapcats","body":"Brilliant. I was thinking, ya - this mightn't be a funny one... then BAM!\nPunchline :-)","timestamp":"2011-08-14T23:10:53.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekend","day_of_week":7}
{"author":"PervaricatorGeneral","body":"_Almost_ Definitely","timestamp":"2011-08-14T21:36:58.000-07:00","score":13,"subreddit":"xkcd","ups":13,"daytype":"weekend","day_of_week":7}
{"author":"robinhoode","body":"Because the author does not know of mapM_\n\nAlso, [do notation considered harmful](http://www.haskell.org/haskellwiki/Do_notation_considered_harmful)","timestamp":"2011-08-14T12:05:03.000-07:00","score":1,"subreddit":"scala","ups":1,"daytype":"weekend","day_of_week":7}
{"author":"32koala","body":"I'm just gonna leave this here: http://www.youtube.com/watch?v=7r3M03v95i0","timestamp":"2011-08-14T22:29:26.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekend","day_of_week":7}
{"author":"jayjaywalker3","body":"I agree with the girl in the first panel. Especially when it comes to psychology.","timestamp":"2011-03-25T12:02:15.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"Solnai","body":"inception?","timestamp":"2011-03-27T22:01:48.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekend","day_of_week":7}
{"author":"ernie98","body":"Cozy blanket courtesy of Mr Le Hagfish! ","timestamp":"2011-03-24T21:23:49.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":4}
{"author":"feyrath","body":"Good to know.  But never having had an ancestry.com account - I'd presume at the very least you could export it into a gedcom file.  Can anyone confirm or deny?","timestamp":"2011-03-25T14:11:50.000-07:00","score":1,"subreddit":"Genealogy","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"Quertior","body":"**R E C U R S I O N**","timestamp":"2011-03-27T23:01:41.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekend","day_of_week":7}
{"author":"doc_brietz","body":"how would i go about doing this and using the results?","timestamp":"2011-11-20T00:09:33.000-08:00","score":1,"subreddit":"Genealogy","ups":1,"daytype":"weekend","day_of_week":7}
{"author":"plbogen","body":"How do you know he wasn't referring to Nolan Ryan?","timestamp":"2011-03-04T04:11:03.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"ninjin","body":"Okay, not to nag, but this is how the conversation goes:\n\n* *Browser*: I am a mobile browser from X, Y, Z, etc. Give me article N\n* *Server*: Redirect to mobile site\n* *Browser*: I am a mobile browser from X, Y, Z, etc. Give me article N\n* *Server*: Redirect to mobile site","timestamp":"2011-03-07T01:07:11.000-08:00","score":-2,"subreddit":"xkcd","ups":-2,"daytype":"weekday","day_of_week":1}
{"author":"jbrechtel","body":"For some reason I thought it was because compilation times would go (even further) through the roof.  I haven't seen any mention of it being called impossible.  Do you have a link?","timestamp":"2011-03-05T20:45:24.000-08:00","score":2,"subreddit":"scala","ups":2,"daytype":"weekend","day_of_week":6}
{"author":"unquietwiki","body":"I think nice if it did. These guys try asking more questions than the Nolan Chart site does. Outside the US, there are more issues than abortion and guns.","timestamp":"2011-03-04T07:06:50.000-08:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":5}
{"author":"SarahC","body":"=(\n\nDamn.\n\nMaybe get them to make isotopes by using their little robot arms to squeeze the nucleus together really really hard?","timestamp":"2011-03-03T21:57:29.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":4}
{"author":"fanf42","body":"Yes you can, but that seems to be not really idiomatic and of little interest if you want to do something with codeToExecute returned value. That's because codeToExecute HAVE to be of Boolean Type, and so, apart for the evil case with only side effects in it, you are really limited.\n\nAn other interesting method, not show in the post, and which composed well (with interesting return types) is to use for comprehension:\n\n    val myOptionnalRes : Option[RES] = for {\n      someUser &lt;- optionnalUser //say Option[User]\n      someInt &lt;- optionnalInt //say Option[Int]\n    } yield {\n     //here, we do have an user and an a int\n     computeSomethingUsefullWith(someInt, someUser) //of type RES\n    } \n\n\nAnd of course, for option there is the really good reference: http://blog.tmorris.net/scalaoption-cheat-sheet/\n\nedit: code format","timestamp":"2011-03-07T05:26:39.000-08:00","score":1,"subreddit":"scala","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"auxiliary-character","body":"*Cringes.*","timestamp":"2011-07-14T22:22:57.000-07:00","score":28,"subreddit":"xkcd","ups":28,"daytype":"weekday","day_of_week":4}
{"author":"viktorbir","body":"Zeno would have not used this AM/PM nonsense. It was hard to get it because of this. Weird that xkcd doesn't use scientific format time.","timestamp":"2011-12-23T08:26:48.000-08:00","score":-7,"subreddit":"xkcd","ups":-7,"daytype":"weekday","day_of_week":5}
{"author":"DFGdanger","body":"Can someone explain who Zeno is?","timestamp":"2011-12-23T00:10:19.000-08:00","score":10,"subreddit":"xkcd","ups":10,"daytype":"weekday","day_of_week":5}
{"author":"boskee","body":"I am not sure what you're referring to, but you should check the [English Section](http://genealodzy.pl/PNphpBB2-viewforum-f-32.phtml) on their forums.\n\nEdit: Ah, that website isn't designed very well and it's showing thread list above the actual forums. Just scroll down that page and you will see it. ","timestamp":"2011-12-23T12:48:24.000-08:00","score":2,"subreddit":"Genealogy","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"chaos986","body":"What is scientific format time?  Are you referring to ISO 8601?","timestamp":"2011-12-23T10:56:39.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"AngelaMotorman","body":"[Here you go.](http://www.cocktaildb.co/barwr_galleryDetail?assetID=50&amp;id=100)\n\n(BTW, those things are indestructible. I inherited an old one 20 years ago, and it works perfectly although it must be at least 40 years old.)","timestamp":"2011-12-23T05:34:41.000-08:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":5}
{"author":"sje46","body":"I was poor, never seen this before.  No Name wasn't sold in grocery stores.  Maybe poor people weren't supposed to shop in grocery stores, but if so we didn't know that.","timestamp":"2011-12-22T13:44:04.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":4}
{"author":"32koala","body":"In this experiment, GPS satellites measured the position of the detector and the position of the source of neutrinos. This information is needed to calculate neutrino speed. \n\nThe GPS location information is **very** accurate and precise—so precise that we can measure the movement of the tectonic plates upon which the detectors rest. Earthquakes cause the ground to move, so the GPS measured those short-lived changes in position.","timestamp":"2011-09-24T12:46:04.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekend","day_of_week":6}
{"author":"levitron","body":"So, where's the colour-coded map, Google...?\n","timestamp":"2011-09-25T11:48:54.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekend","day_of_week":7}
{"author":"faceplanted","body":"\"Between me and any raptor there is a lot of flesh\" good enough?","timestamp":"2011-09-25T13:25:17.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekend","day_of_week":7}
{"author":"serpix","body":"I gave up on SBT recently when a build broke because a plugin disappeared from github. The amount of symbols and syntactic tricks also make it really really difficult to understand.\n\nThat and the fact that SBT 0.10 basically made all prior documentation on SBT invalid is just too much to take. I'll just wait for it to mature.","timestamp":"2011-09-23T01:08:45.000-07:00","score":1,"subreddit":"scala","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"avsa","body":"every other xkcd posted on this reddit has the top comment as \"Randall is losing it\", \"SMBC is better\" or something..","timestamp":"2011-09-23T07:37:34.000-07:00","score":12,"subreddit":"xkcd","ups":12,"daytype":"weekday","day_of_week":5}
{"author":"Mpoumpis","body":"Some of us don't live in wooden homes.\n\nFor example, the majority of houses in Greece are made of bricks and cement.","timestamp":"2011-09-16T11:06:41.000-07:00","score":7,"subreddit":"xkcd","ups":7,"daytype":"weekday","day_of_week":5}
{"author":"HotRodLincoln","body":"Wood framing behind the drywall that can hold heavy stuff.  Usually set at 16\" on center.  \n\nStud finders generally work by detecting magnetism of nails in these pieces of wood which run vertically.\n\nThere's a lot of \"not a nail\" metal in the walls.\n\nIf you need to hang something truly heavy, you'll end up drilling into the wall and poking around with an unbent metal hanger.","timestamp":"2011-09-16T06:46:54.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"ItsTitleTextNotAlt","body":"## ","timestamp":"2011-09-16T09:09:27.000-07:00","score":-4,"subreddit":"xkcd","ups":-4,"daytype":"weekday","day_of_week":5}
{"author":"Tack122","body":"That is why you are supposed to confirm it by getting a general layout of the studs in the wall as they repeat at a regular interval. ","timestamp":"2011-09-16T08:54:50.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"GimmeSomeSugar","body":"Very good. Carry on.","timestamp":"2011-09-16T14:02:29.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"Cr4ke","body":"Was it wrong to expect the joke to be some kind of double entendre?","timestamp":"2011-09-16T05:06:36.000-07:00","score":10,"subreddit":"xkcd","ups":10,"daytype":"weekday","day_of_week":5}
{"author":"MrPap","body":"no sry","timestamp":"2011-09-16T12:52:37.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"moskie","body":"Strip 503 crashes his server.\n\nI don't think he thought that one through very well.","timestamp":"2011-03-02T23:32:05.000-08:00","score":40,"subreddit":"xkcd","ups":40,"daytype":"weekday","day_of_week":3}
{"author":"AgentConundrum","body":"Nope. It returns 200.","timestamp":"2011-03-03T10:27:47.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":4}
{"author":"V2Blast","body":"[Most important section.](http://en.wikipedia.org/wiki/Herping#Herping_on_the_internet)","timestamp":"2011-03-02T09:50:58.000-08:00","score":4,"subreddit":"xkcd","ups":4,"daytype":"weekday","day_of_week":3}
{"author":"Graendal","body":"Yeah, I saw this. But I'm pretty sure that in his app he goes on to the second link when picking the first link loops back. Which is neat if you're just looking for any connection to Philosophy, but cheating if you want to get there only using first links. :P It is really cool though.","timestamp":"2011-06-22T18:49:47.000-07:00","score":4,"subreddit":"xkcd","ups":4,"daytype":"weekday","day_of_week":3}
{"author":"kekspernikai","body":"Yeah, me too. I only said money because the question did. I think the AMA was talking about specific valuables or things you don't want people to see.","timestamp":"2011-06-24T05:28:24.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"bramblerose","body":"nice!\n\ntwo comments on the source:\n\n- there is a python mediawiki library called pywikipedia. You could have used that instead of html scraping, although for this specific purpose html scraping is not that strange.\n- use your own user agent instead of copying one from a browser! Set it to 'Philosophy Grapher/0.1 - see https://github.com/Graendal/Wikipedia-Philosophy', for example.","timestamp":"2011-06-23T01:23:06.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":4}
{"author":"silent_p","body":"Sucks at what? Being in words? Purveying concepts in written form?","timestamp":"2011-06-23T08:07:31.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":4}
{"author":"mescad","body":"If you find a loop, that just means that the article needs a better introduction.  Edit away!","timestamp":"2011-06-22T18:38:58.000-07:00","score":9,"subreddit":"xkcd","ups":9,"daytype":"weekday","day_of_week":3}
{"author":"dallen","body":"I hide my money in a bank.","timestamp":"2011-06-24T05:23:01.000-07:00","score":16,"subreddit":"xkcd","ups":16,"daytype":"weekday","day_of_week":5}
{"author":"Leockard","body":"Why?","timestamp":"2011-06-22T12:34:19.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"a_winner_is_me","body":"It is not illegal to lock goats in boxes, so stay the fuck in there this time.","timestamp":"2011-06-22T06:41:42.000-07:00","score":11,"subreddit":"xkcd","ups":11,"daytype":"weekday","day_of_week":3}
{"author":"ParanoydAndroid","body":"There's always another secret.","timestamp":"2011-06-24T05:24:13.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":5}
{"author":"NitWit005","body":"It's interesting that the structure has already changed since I tried this before. Natural Science lead to Philosophy more directly. It's now almost entirely dependent on that quantity edge.","timestamp":"2011-06-22T18:39:15.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"wdr1","body":"&gt; You'll get a good response there\n\nHardly!  His post is actually related to programming.","timestamp":"2011-06-22T22:46:24.000-07:00","score":15,"subreddit":"xkcd","ups":15,"daytype":"weekday","day_of_week":3}
{"author":"hachaliah","body":"It might be worth contacting a local library or university with an active archivist - they may have some insight on how to safely digitize the letters.  They may even have scanners capable of handling it.","timestamp":"2011-06-22T20:33:20.000-07:00","score":5,"subreddit":"Genealogy","ups":5,"daytype":"weekday","day_of_week":3}
{"author":"bobobano","body":"must make it easy to tell them apart though.","timestamp":"2011-06-22T18:26:32.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"arbuthnot-lane","body":"Since I'm an utter nerd I couldn't just let this - indubitably inspired - zinger rest, and have now spent the last half hour reading about the laws concerning goat keeping.  \nSadly, it turns out, they can *not* be locked in boxes.  \nBut then again, I live in a socialist hell hole. ","timestamp":"2011-06-22T08:31:58.000-07:00","score":6,"subreddit":"xkcd","ups":6,"daytype":"weekday","day_of_week":3}
{"author":"bjarneh","body":"in all fairness; parts of that code **could** have been made more compact in Java also, but Scala an extremely expressive syntax","timestamp":"2011-06-22T17:17:57.000-07:00","score":1,"subreddit":"scala","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"Omnicrola","body":"In other other news, google results of \"canadian scientist surrealist porn\" just went up 4000%.","timestamp":"2011-06-22T07:28:07.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":3}
{"author":"StoneCypher","body":"Unfortunately, every time this comes up on Reddit, people go edit Wikipedia extensively, incorrectly, injecting philosophy in many, many places it doesn't belong, to make the joke work at the cost of the information.\n\nWhich everyone thinks is great until I remind them about Sarah Palin's supporters' reaction to her faux-history.","timestamp":"2011-06-23T15:25:50.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":4}
{"author":"vertigo42","body":"/facepalm\nwish I had access to my troll faces.","timestamp":"2011-01-28T13:25:04.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"strangehalo","body":"Same here.","timestamp":"2011-01-31T11:00:59.000-08:00","score":9,"subreddit":"xkcd","ups":9,"daytype":"weekday","day_of_week":1}
{"author":"magister0","body":"The data points on the chart wouldn't be distributed like that. \"Consecutive vowels\" doesn't gradually get larger. If the record is 6 in a row, there should only be 6 fixed levels on the x-axis.","timestamp":"2011-01-28T05:48:35.000-08:00","score":4,"subreddit":"xkcd","ups":4,"daytype":"weekday","day_of_week":5}
{"author":"vertigo42","body":"Also part of surfin birds. \nOUENOUAOU OUEN OUENOUAOU dont you about the word.","timestamp":"2011-01-28T00:47:44.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"Quertior","body":"Seven levels; don't forget words with no vowels like \"nth\" and \"cwm.\"","timestamp":"2011-01-28T07:17:39.000-08:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":5}
{"author":"raldi","body":"So would that make a catchphrase the least attractive thing in the English language?","timestamp":"2011-01-27T23:18:44.000-08:00","score":8,"subreddit":"xkcd","ups":8,"daytype":"weekday","day_of_week":4}
{"author":"somelocalguy","body":"Have you tried the Ancestry website?  They have collections of military records from WW1.  I found copies of actual records (not someones second hand tree information) on my G-Grandfather which led me to his hometown, occupation, and more family.  They also had records of my G-Grandfathers military service that allowed me to follow him almost monthly throughout his service in 1917-1918.  It is a pay site but they have often run special free or discounted times.  Worth the look for the military records.","timestamp":"2011-01-29T04:00:15.000-08:00","score":1,"subreddit":"Genealogy","ups":1,"daytype":"weekend","day_of_week":6}
{"author":"AFGiant","body":"Randall knows his audience.","timestamp":"2011-01-31T10:12:27.000-08:00","score":12,"subreddit":"xkcd","ups":12,"daytype":"weekday","day_of_week":1}
{"author":"CapnGoat","body":"who said you have to draw straight lines?","timestamp":"2011-08-03T03:47:31.000-07:00","score":12,"subreddit":"xkcd","ups":12,"daytype":"weekday","day_of_week":3}
{"author":"brianbrianbrian","body":"Looks like it was me this time.","timestamp":"2011-08-03T12:05:14.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":3}
{"author":"the_456","body":"I am not affiliated with Scala exchange in any way and yet I am able to see the videos fine. It's a little confusing that they are on the right hand side and not shown prominently though. At first it looks like an ad to an article.","timestamp":"2011-08-04T06:27:33.000-07:00","score":1,"subreddit":"scala","ups":1,"daytype":"weekday","day_of_week":4}
{"author":"Spiro_Agnew","body":"LOL FUNNY COMIC","timestamp":"2011-08-03T04:19:20.000-07:00","score":-13,"subreddit":"xkcd","ups":-13,"daytype":"weekday","day_of_week":3}
{"author":"breisleach","body":"Do you have more info to go with it? It seems Polish-Lithuanian perhaps Slovak in design with regards to the shape of the shield and the two-barred cross. ","timestamp":"2011-08-04T01:58:29.000-07:00","score":1,"subreddit":"Genealogy","ups":1,"daytype":"weekday","day_of_week":4}
{"author":"masonba","body":"Your response is in the spirit of XKCD.","timestamp":"2011-01-07T11:09:58.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"gospelwut","body":"Do you work for IT? An ACL on the router is just as effective. ","timestamp":"2011-01-07T12:09:59.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"reddit_user13","body":"Oh shit! They've been XKCDed!","timestamp":"2011-01-06T08:26:06.000-08:00","score":12,"subreddit":"xkcd","ups":12,"daytype":"weekday","day_of_week":4}
{"author":"karma_is_stupid","body":"Yes. Why is it an issue to talk to your coworker (and telling him to make less noise)? ","timestamp":"2011-01-07T14:29:36.000-08:00","score":13,"subreddit":"xkcd","ups":13,"daytype":"weekday","day_of_week":5}
{"author":"smooth_and_creamy","body":"ok milton","timestamp":"2011-01-08T00:54:22.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekend","day_of_week":6}
{"author":"ONPRaGu","body":"This was the exact one I was thinking about! Hopefully he was too.","timestamp":"2011-01-05T22:14:18.000-08:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":3}
{"author":"mitchelwb","body":"I wish I could.  I don't work on his team, but I think he's like the website architect.  He only gets up from his cube long enough to go the surrounding cubes and yell about how much work he's doing, or how wrong one of the programmers is.  When he's done doing that, he'll go to another cube and do the same.  But he's never far away, and unfortunately, never out of (my) earshot.  Did I mention he's obnoxious?","timestamp":"2011-01-07T10:48:39.000-08:00","score":7,"subreddit":"xkcd","ups":7,"daytype":"weekday","day_of_week":5}
{"author":"dakk12","body":"Actually, tell him about it right before you go home.  That way he stays up all night rereading the comics and comes in tired tomorrow.","timestamp":"2011-01-07T12:21:23.000-08:00","score":83,"subreddit":"xkcd","ups":83,"daytype":"weekday","day_of_week":5}
{"author":"1000","body":"**YOU MEAN GLASS ISN'T A SLOW FLOWING LIQUID**!","timestamp":"2011-01-05T07:52:57.000-08:00","score":9,"subreddit":"xkcd","ups":9,"daytype":"weekday","day_of_week":3}
{"author":"hasbro","body":"Link to the wiki article: http://en.wikipedia.org/wiki/List_of_common_misconceptions","timestamp":"2011-01-06T08:21:23.000-08:00","score":33,"subreddit":"xkcd","ups":33,"daytype":"weekday","day_of_week":4}
{"author":"flapcats","body":"\"Prove it's not true!\"","timestamp":"2011-01-06T15:50:15.000-08:00","score":-1,"subreddit":"xkcd","ups":-1,"daytype":"weekday","day_of_week":4}
{"author":"futufutu","body":"I liked it","timestamp":"2011-01-07T05:50:35.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"mitchelwb","body":"Like hell!  I'm behind that firewall too you know.","timestamp":"2011-01-07T10:59:21.000-08:00","score":20,"subreddit":"xkcd","ups":20,"daytype":"weekday","day_of_week":5}
{"author":"TheEdes","body":"&lt;!-- should be in an HTML comment --&gt;","timestamp":"2011-01-08T18:45:23.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekend","day_of_week":6}
{"author":"MistaMagoo","body":"Would want to be careful with that considering he is posting on reddit about it :)","timestamp":"2011-01-08T02:43:13.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekend","day_of_week":6}
{"author":"foursticks","body":"&gt;  There is no deity that orders, governs, manages, controls, administers or otherwise participates in the functioning of any aspect of the universe.\n\nI like that one.","timestamp":"2011-01-06T13:47:30.000-08:00","score":4,"subreddit":"xkcd","ups":4,"daytype":"weekday","day_of_week":4}
{"author":"accountII","body":"I'm 22 and I want to be 19 again","timestamp":"2011-06-03T08:28:47.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"mikemintz","body":"I'm guessing it's due to boxing. As far as I know, Scala does not yet specialize Seq for primitive types yet, so when you bigArray.sorted maybe have to unbox and box for each comparison. Whereas arrays on the JVM are treated differently and shouldn't have to deal with boxing. See [Martin's comment](http://www.scala-lang.org/node/7285#comment-29974) regarding the future of specialization on Scala collections.\n\nOne way to confirm/disprove this is to run the code in a profiler (jvisualvm and hprof probably come with your JDK), and see if it spends significant time in boxing methods.\n\nYou should also run both methods many times initially to warm up the JVM first. It is a little unfair that you call linearSearch2 last, so it potentially has a more warmed up JVM to work with.\n\nOf course you're right, it's hard to compare since you're comparing apples to oranges: in linearSearch you use Seq#sorted (which calls java.util.Arrays.sort underneath), whereas in linearSearch2 you use Sorting.quickSort, which is implemented separately in the Scala library.\n\n","timestamp":"2011-06-05T17:03:54.000-07:00","score":1,"subreddit":"scala","ups":1,"daytype":"weekend","day_of_week":7}
{"author":"alphaboo","body":"? The text specifies Ara (the Alter)","timestamp":"2011-01-14T07:49:08.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"Lu-Tze","body":"Just in case this is a serious question. Generally for alcohol to act as disinfectant, it requires high concentrations (~70%+, i.e. 140 proof in the US) and contact time of several minutes (~10+). The damage to your oral epithelial cells and the pain would be too much for this to be a viable strategy.","timestamp":"2011-01-12T20:42:39.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"erekose","body":"The comments so far are good.. but as this is such a long-shot, I'll suggest a few different \"passive\" search methods:\n\n* [genetic genealogy](http://en.wikipedia.org/wiki/Genetic_genealogy). While also a long-shot, if your sibling has the same desire to re-unite as you do, there *is* a small chance that he/she has already submitted their own dna to a company such as FamilyTreeDNA. If they have not done so already, they might in the future. You can choose to keep your DNA on file indefinitely. Any match would carry a high degree of accuracy. \n\n* petition adoption agencies. I know there's strict privacy laws regarding adoption, but I doubt there are any laws that restrict you from contacting them and telling them your story. Tell them that you are *not* looking for them to divulge anything; rather, you want merely to leave your info with them, and to contact you if anyone (ie: the adopted sibling) contacts the agency. If there is mutual consent, I don't see why the agency would not be allowed to connect the two of you. This approach is similar to the one above in that they both use a middleman.\n\n* canvas some areas with classified ads. These areas would be the ones where your grandmother lived during the time she gave birth to your missing siblings. In the ad, explain your story, etc.. No doubt this would yield a very small chance of success; it would also cost the most. As it also carries a low degree of accuracy, a genetic test might be desired to confirm the relationship if anyone does contact you.\n\n","timestamp":"2011-01-14T15:13:07.000-08:00","score":1,"subreddit":"Genealogy","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"thebeegirl","body":"Well using the census often gives clues.  Did your mother's father live in the US?  If they were in the US before 1930 the census helps.  They could say when they came to the US which could lead to find names on the immigration forms or a village where they came from.\nIf you want to PM me you can some names I can do a little quick research on line.  ","timestamp":"2011-01-13T19:34:09.000-08:00","score":1,"subreddit":"Genealogy","ups":1,"daytype":"weekday","day_of_week":4}
{"author":"TheEdes","body":"No, that's the title. The alt-text is when you hover your mouse over the comic. Go try it now.","timestamp":"2011-01-12T20:20:32.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"aperson","body":"But if you start to change the flow... eventually everyone will start to be correct.","timestamp":"2011-01-12T20:42:04.000-08:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":3}
{"author":"manulp","body":"I like it a lot, you should think about a \"clean\" version to make tshirts, I'd buy one :)","timestamp":"2011-09-18T15:28:38.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekend","day_of_week":7}
{"author":"ralf_","body":"&gt; Seems kind of dumb to make houses out of wood when there are so many hurricanes, tornadoes, forest fires and stuff.\n\nI always wondered about that. ","timestamp":"2011-09-19T00:28:20.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"dontrubitin","body":"done!","timestamp":"2011-09-20T05:22:34.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":2}
{"author":"transducer","body":"You can take a look at http://jcommander.org. This is targetted at java, but there is a section about scala in the documentation (http://jcommander.org/#Scala).","timestamp":"2011-09-19T19:53:18.000-07:00","score":1,"subreddit":"scala","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"ChuqTas","body":"Geni is the one I have been using for a few years now.  Allows gedcom import and export and has a free version!","timestamp":"2011-12-20T02:23:11.000-08:00","score":3,"subreddit":"Genealogy","ups":3,"daytype":"weekday","day_of_week":2}
{"author":"V2Blast","body":"Loved the last one the most.","timestamp":"2011-12-19T02:29:35.000-08:00","score":7,"subreddit":"xkcd","ups":7,"daytype":"weekday","day_of_week":1}
{"author":"arglebargle_IV","body":"He didn't say that he never learned one for the color codes, just that he doesn't like the standard ones.  His note says: \"Traditional [None I care for]\"","timestamp":"2011-12-19T06:27:08.000-08:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":1}
{"author":"travelinghobbit","body":"http://xkcd.com/149/","timestamp":"2011-12-19T19:43:20.000-08:00","score":17,"subreddit":"xkcd","ups":17,"daytype":"weekday","day_of_week":1}
{"author":"skalpelis","body":"Am I missing something or is the first one in the wrong order?","timestamp":"2011-12-19T02:46:57.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":1}
{"author":"aerynmoo","body":"I use My Heritage. There's a program you download and the free version lets you have 150 members. And it'll export it to a webpage you can show your family (which you can set the privacy on). It lets you view other trees that might have a matching family member and if you decide that it does, then you can petition the other person to merge trees. And that's all on the free version! I think you can input a GEDCOM file as well, but I am not sure. ","timestamp":"2011-12-20T08:54:53.000-08:00","score":1,"subreddit":"Genealogy","ups":1,"daytype":"weekday","day_of_week":2}
{"author":"DarqWolff","body":"I think I used to wonder about that when I was a little kid. Then I realized that that's exactly what was happening with the fact that I kept on wondering it, except confined to one thing and stretched out. And realized that it couldn't happen because of the fact that your thoughts aren't linear, they're more like a bunch of wibbly-wobbly, thinky-rinky... stuff.","timestamp":"2011-12-19T15:33:50.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":1}
{"author":"mmmm_whatchasay","body":"\"Kids, please come over for gay sex.\"","timestamp":"2011-12-19T07:19:37.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":1}
{"author":"SeriousWorm","body":"I'm using SBT, which is great because of\r\n\r\n* IntelliJ IDEA integration\r\n* continuous code compilation (it auto-recompiles any files you modify, zero locking issues)\r\n* great build script design (it's a valid scala class!)\r\n* great extensibility\r\n* excellent dependency management (just drop the sbt jar in your project, run it and it can even auto-get the scala compiler jars for you!)\r\n* etc.","timestamp":"2011-04-23T13:08:30.000-07:00","score":1,"subreddit":"scala","ups":1,"daytype":"weekend","day_of_week":6}
{"author":"davef","body":"Belinda Carlisle says Heaven's around here somewhere.","timestamp":"2011-04-20T08:28:48.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"MSkog","body":"How did I not know there were full TZ episodes on youtube?! ","timestamp":"2011-04-19T23:35:49.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":2}
{"author":"Halaku","body":"I would, but I'm too busy being a turtle.","timestamp":"2011-04-22T17:24:33.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"oniony","body":"Whilst the original scripture was, in fact, Saint Francis the Black, the particular adaptation mentioned was penned by Saint James the Pop.","timestamp":"2011-04-20T12:56:59.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"mmmicahhh","body":"[DOH!](http://imgur.com/l1SJW)","timestamp":"2011-04-20T01:16:30.000-07:00","score":21,"subreddit":"xkcd","ups":21,"daytype":"weekday","day_of_week":3}
{"author":"brownmatt","body":"This makes no sense. The oil company has no idea how far you drove to hunt down a good deal. Nor are they afraid of the threat of you wasting your time in protest - it doesn't make a noticeable dent in their revenues. ","timestamp":"2011-09-14T20:05:20.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"gfpumpkins","body":"[citation needed]","timestamp":"2011-09-15T06:23:57.000-07:00","score":3,"subreddit":"Genealogy","ups":3,"daytype":"weekday","day_of_week":4}
{"author":"richunclesam","body":"Well these days it costs around a dime a mile to keep a Prius fueled up, double that for many of the cars/SUWs some people drive.\n\nFor a person like me, that translates to around 10% of my income spent on fuel. So if I can save 10% on fuel, it's like a 1% raise. \n\nBuying a diesel VW has saved me 25% on fuel, which is a big deal. It's enough to pay for a latte on the way to work. \n\nThe fact that nobody your age cares that much implies that you lack the life experience to understand the value of a marginal dollar. Time is money, and most people have limited quantities of both. I can think of a hundred more enjoyable things to do with $1 than give it to Exxon. ","timestamp":"2011-09-13T21:36:43.000-07:00","score":10,"subreddit":"xkcd","ups":10,"daytype":"weekday","day_of_week":2}
{"author":"Supersnazz","body":"Yeah, clicking a magnet link on Piratebay takes a massive amount of time and energy. In fact, I challenge anyone to download legally faster than an experienced pirate can steal it.","timestamp":"2011-09-14T06:09:50.000-07:00","score":6,"subreddit":"xkcd","ups":6,"daytype":"weekday","day_of_week":3}
{"author":"richunclesam","body":"Then you spend a lot less on gas than I do. \n\nFor me, saving on gas is a matter of mere planning. I buy it on the Indian reservation when I'm in that area, which saves about 10%. Otherwise I buy it when I happen to be in the part of town that's 11 cents a gallon cheaper which saves me $1.50 per tank without any extra driving- and $1.50 gets me about 15 miles so even if I went 5 minutes out of my way it would still be worth it, especially since that gas station stocks an unusual variety of craft beers. \n\nOn road trips, using gasbuddy and getting 3 miles off the highway often saves more than a dime a gallon which is a dollar a day. Never filling up in NYC (NJ instead) saves 50 cents a gallon which is at least $7 per trip, sometimes more if I stay down there a week. The fact that my new car gets 35mpg versus the 23 my old car got saves me roughly $1000 per year. It all adds up. ","timestamp":"2011-09-13T22:06:05.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":2}
{"author":"redwall_hp","body":"Some of us have hobby-type projects that make a reasonable amount of money. Making iPhone apps, blogging, etc..","timestamp":"2011-09-13T23:07:36.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":2}
{"author":"Veggie","body":"I came here to say this too, but it actually is possible to assign value to your time, and thus perform cost/benefit analysis. Thinking about it like a wage is just wrong, though.","timestamp":"2011-09-13T23:56:27.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":2}
{"author":"xak","body":"echo $(shuf -n4 /usr/share/dict/words)","timestamp":"2011-09-15T12:48:34.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":4}
{"author":"ravenex","body":"$6/hr is not actually that bad in The Rest of the World (tm).","timestamp":"2011-09-13T22:27:42.000-07:00","score":0,"subreddit":"xkcd","ups":0,"daytype":"weekday","day_of_week":2}
{"author":"lennort","body":"I came to the same conclusion when I looked at one of them too. The only real incentive is the torque of a diesel motor.","timestamp":"2011-09-14T07:14:39.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"FacelessBureaucrat","body":"That still costs you more time then if you just filled it when it was close to empty, even if it's a matter of minutes.","timestamp":"2011-09-14T05:59:29.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"postExistence","body":"This is - without a doubt - my all-time favorite xkcd comic. I asked Randall once why he couldn't add it into the book, and he told me it was a few things: that he didn't have the original version and the scanned copy was not at a resolution high enough for publishing.\n\nBut it's still my favorite. And that will never change.. for now, at least.","timestamp":"2011-12-06T15:58:32.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":2}
{"author":"Rhino18","body":"Yes, I do and that's my problem.  I've found a lot of similar records, in both locations (ireland and wales) that could support my case either way.  I'm continuing to check immigration records though.","timestamp":"2011-12-07T16:54:44.000-08:00","score":1,"subreddit":"Genealogy","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"ishmal","body":"I agree with your idea of API breakage only with changes in major version numbers.   In fact, that's the definition of how they should work.  But I also think that those changes need to be fluid.  Java has been 1.x since the time of Queen Victoria.\n\nRelease often?  That's the Google and Mozilla model.  So yes, we need a VM code loader that can handle frequently-changing APIs.\n","timestamp":"2011-12-07T21:16:15.000-08:00","score":2,"subreddit":"scala","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"jisoukishi","body":"and [this](http://xkcd.com/969/) is why i love xkcd.","timestamp":"2011-12-06T06:33:33.000-08:00","score":5,"subreddit":"xkcd","ups":5,"daytype":"weekday","day_of_week":2}
{"author":"gospelwut","body":"Psh, mail lists say `man` is enough amirite? \n\nBut I still have to visit the x11 nightmare sometimes when some of our linux boxes at work have driver/monitor issues. Ugh.","timestamp":"2011-10-12T05:53:29.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"madamdepomp","body":"Can you tell me what it is?","timestamp":"2011-10-11T23:04:30.000-07:00","score":20,"subreddit":"xkcd","ups":20,"daytype":"weekday","day_of_week":2}
{"author":"dhaft88","body":"you need to write books","timestamp":"2011-10-12T10:18:49.000-07:00","score":5,"subreddit":"xkcd","ups":5,"daytype":"weekday","day_of_week":3}
{"author":"counterplex","body":"monkeys within monkeys!","timestamp":"2011-10-12T13:01:29.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":3}
{"author":"Norther","body":"http://en.wikipedia.org/wiki/Xorg.conf\n\nIn simple terms it is where you configure your displays/input devices to enable a GUI environment.","timestamp":"2011-10-11T23:32:39.000-07:00","score":16,"subreddit":"xkcd","ups":16,"daytype":"weekday","day_of_week":2}
{"author":"ModernRonin","body":"X11 is overdue to the flushed down the toilet like the piece of shit that it actually...\n\nDeep breaths... deep breaths... promised myself I wouldn't go on this rant again.","timestamp":"2011-10-12T09:58:05.000-07:00","score":4,"subreddit":"xkcd","ups":4,"daytype":"weekday","day_of_week":3}
{"author":"Duals902","body":"Thank you! ","timestamp":"2011-10-12T09:52:13.000-07:00","score":1,"subreddit":"Genealogy","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"eric22vhs","body":"I see the XKCD reference, but can someone explain the comic to me?","timestamp":"2011-10-10T20:00:52.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":1}
{"author":"ItsTitleTextNotAlt","body":"## ","timestamp":"2011-10-12T06:20:28.000-07:00","score":12,"subreddit":"xkcd","ups":12,"daytype":"weekday","day_of_week":3}
{"author":"Choreboy","body":"Oh my. The one for The Matrix really got me.","timestamp":"2011-11-03T22:40:25.000-07:00","score":4,"subreddit":"xkcd","ups":4,"daytype":"weekday","day_of_week":4}
{"author":"Rationalwoman","body":"Name:\tJosiah Curby\nHome in 1900:\tWashington, Tuscarawas, Ohio\nAge:\t73\nBirth Date:\tApr 1827\nBirthplace:\tPennsylvania\nRace:\tWhite\nGender:\tMale\nRelationship to head-of-house:\tHead\nFather's Birthplace:\tPennsylvania\nMother's Birthplace:\tPennsylvania\nSpouse's Name:\tJane H Curby\nMarriage Year:\t1850\nMarital Status:\tMarried\nYears Married:\t50","timestamp":"2011-11-03T10:50:30.000-07:00","score":1,"subreddit":"Genealogy","ups":1,"daytype":"weekday","day_of_week":4}
{"author":"natolee","body":"I am currently loving the rx flair.  I am such a dork.","timestamp":"2011-11-03T08:21:38.000-07:00","score":1,"subreddit":"optometry","ups":1,"daytype":"weekday","day_of_week":4}
{"author":"north97","body":"I guess I'm just weird, I'm almost always aware of my tongue. It'd be like not being aware of your hands to me. \n\nMakes more sense with the peanuts comic bananalouise linked tho.","timestamp":"2011-11-02T13:18:43.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":3}
{"author":"vnkatesh","body":"No, I'm indian, and we do not consider someone family before we get married. It's called culture. Just try and understand that there are people of other races on reddit. And no, I was not being sarcastic here.","timestamp":"2011-06-30T22:15:03.000-07:00","score":6,"subreddit":"xkcd","ups":6,"daytype":"weekday","day_of_week":4}
{"author":"magister0","body":"They're all particularly annoying words, including the title.","timestamp":"2011-07-03T02:39:29.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekend","day_of_week":7}
{"author":"vnkatesh","body":"Yeah, I actually re-read my post (most of the time), from an american point of view. But I didn't catch this one. And I still don't get it. :(","timestamp":"2011-07-02T01:55:00.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekend","day_of_week":6}
{"author":"RedYelloBlue","body":"is this some kind of grammar joke? i dont get this one, but grammar jokes can be subtle becuse there are a lot of rules.","timestamp":"2011-06-30T22:00:43.000-07:00","score":5,"subreddit":"xkcd","ups":5,"daytype":"weekday","day_of_week":4}
{"author":"zagr","body":"I also got stuck here till i noticed the parentheses","timestamp":"2011-05-24T23:27:23.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":2}
{"author":"NooneOfInterest","body":"12 jumps from Alaska, but got there. This is crazy!","timestamp":"2011-05-25T00:24:03.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"sockthepuppetry","body":"It does. Randall's making fun of the human ability to see patterns where there are none.  This applies to pretty much all disciplines that are outside of science.  Science tells you, \"Nope, nothing here.  It's still fit by the null hypothesis since p=.80.\"","timestamp":"2011-05-27T05:30:20.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":5}
{"author":"OneCanOnlyGuess","body":"Penny-Arcade referenced D&amp;D today too.  I think it's a sign I should roll some dice this weekend...","timestamp":"2011-05-27T06:15:30.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"SarahC","body":"Anyone up for writing a parser, and then using the output to make an image?","timestamp":"2011-05-25T06:18:38.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"tornglass","body":"Mercedes-Benz_W126\n\nFlagship\n\nCommanding_officer\n\nOfficer_(armed_forces)\n\nArmed_forces\n\nCountry\n\nGeographic\n\nEarth\n\nPlanet\n\nOrbit\n\nPhysics\n\nNatural Science (getting close!)\n\nScience Knowledge\n\nFact\n\nInformation\n\nSequence\n\nMathematics (closer)\n\nQuantity\n\nProperty\n\nModern Philosophy\n\nPhilosophy","timestamp":"2011-05-25T03:12:38.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"soccerman","body":"Soccer definitely does not lend itself to stats analysis, but baseball and American football certainly do","timestamp":"2011-05-27T05:21:05.000-07:00","score":6,"subreddit":"xkcd","ups":6,"daytype":"weekday","day_of_week":5}
{"author":"sidek","body":"I think I found something : \n\nHatsune Miku\n\nCrypton Future Media\n\nSapporo\n\nlisten\n\nwhich takes me to http://upload.wikimedia.org/wikipedia/commons/f/f9/Ja-Sapporo.ogg , which has no links. \n\n/me wins","timestamp":"2011-05-25T15:13:27.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"astroknotical","body":"Case Law is in parentheses on the Common Law page. The actual first word not in parentheses or italics is \"law.\"","timestamp":"2011-05-25T14:17:16.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"grepe","body":"How cooool is that!","timestamp":"2011-05-25T00:12:24.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"aarongoodermuth","body":"randall has said he is a reddit user. and this page did make it to the front page. its probably more of a reddit compliment. ","timestamp":"2011-05-25T10:06:22.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"AgentConundrum","body":"Randal Munroe","timestamp":"2011-05-25T04:20:52.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":3}
{"author":"korilla","body":"it is really sad when something like this happens and someone is unwilling to reach out to their family. i can understand their anger towards maybe one family member for something bad they've done, but too bad they cannot realize there are other family members who do care.\n\ni am not sure exactly how these people did it, but i had been searching for \"little johnny\" on my own for a year or so. after my grandpa died, i located writings and receipts from private investigators.. the poor guy spent thousands of dollars in his later life trying to track down his son. i have an ancestry.com account, google skills, etc. i got stuck at a dead-end. some of the people on the forum do this for a hobby, but they are very good at what they do. you'd be amazed. within a day or two my thread was pages long with many kind helpful people trying to help me. i found out so much about the story that i never knew. we did get an address for \"little johnny\" .. he is in another state, he is living, but I guess he wants nothing to do with us. according to his half-brother who has been in touch with my mom, he's like that with them, too. sad.\n\ntl;dr: there are kind folks at the findagrave.com forums","timestamp":"2011-04-10T12:12:33.000-07:00","score":0,"subreddit":"Genealogy","ups":0,"daytype":"weekend","day_of_week":7}
{"author":"golden-boy","body":"He was definitely imagining rusty-pronged objects being shoved down into his urethra.","timestamp":"2011-04-07T22:49:32.000-07:00","score":14,"subreddit":"xkcd","ups":14,"daytype":"weekday","day_of_week":4}
{"author":"HeadBoy","body":"There was always an issue with scaling a person's experience into numbers like that.\n\n:D","timestamp":"2011-04-07T21:40:28.000-07:00","score":7,"subreddit":"xkcd","ups":7,"daytype":"weekday","day_of_week":4}
{"author":"lowercase-xkcd","body":"&gt; xkcd\n\nFTFY","timestamp":"2011-04-08T09:32:38.000-07:00","score":8,"subreddit":"xkcd","ups":8,"daytype":"weekday","day_of_week":5}
{"author":"ultimatt42","body":"If you had a bad imagination, could you use numbers higher than 10?","timestamp":"2011-04-07T21:46:02.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":4}
{"author":"UNHDude","body":"That is annoying, though I wonder if some people want to wash them first?","timestamp":"2011-12-14T14:03:34.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"Icovada","body":"\"one bag\"\n\n\"Are you sure? You have quite a lot of stuff and these new bags aren't really strong\"\n\n\"One bag please\" *walks away holding the bag from the bottom and praying it doesn't explode*","timestamp":"2011-12-14T12:37:00.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"loulan","body":"Hmm, yeah, I'm French, and they don't pack things in bags for us here either. I guess it's a US thing.","timestamp":"2011-12-14T01:02:17.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"Ocrasorm","body":"Yip. Which really has brought on the bag for life bags. Most people just buy one durable plastic bag and bring that with them when they go shopping. \n\nUnless you are a fucktard like me who always forgets, I have too many bags.","timestamp":"2011-12-14T00:43:01.000-08:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":3}
{"author":"filthyassistant","body":"once you get in the habit it's not that bad. it was harder to remember to bring them to non-grocery type stores like home depot or goodwill, but now I just always grab at least one. the downside? I no longer have free trashbags for my bathroom trashcan...","timestamp":"2011-12-13T23:38:51.000-08:00","score":7,"subreddit":"xkcd","ups":7,"daytype":"weekday","day_of_week":2}
{"author":"belandil","body":"Census records from 1930 and earlier: http://www.familysearch.org","timestamp":"2011-12-14T18:47:54.000-08:00","score":6,"subreddit":"Genealogy","ups":6,"daytype":"weekday","day_of_week":3}
{"author":"amgine","body":"A local supermarket? almost EVERY supermarket (here in Texas) has dedicated sackers.","timestamp":"2011-12-14T11:56:29.000-08:00","score":6,"subreddit":"xkcd","ups":6,"daytype":"weekday","day_of_week":3}
{"author":"woj-tek","body":"riiiight... \"in scala\"... got it...\n(or were you actually referring to the comments?!)","timestamp":"2011-12-14T06:07:22.000-08:00","score":3,"subreddit":"scala","ups":3,"daytype":"weekday","day_of_week":3}
{"author":"pieter08","body":"Best waterproof cameras\nunderwater cameras\nwaterproof cameras","timestamp":"2011-12-14T01:01:16.000-08:00","score":1,"subreddit":"Cameras","ups":1,"daytype":"weekday","day_of_week":3}
{"author":"funkgerm","body":"Exactly. I don't know where this guy has been for the last few years. Even low end computers come with 4gb of RAM nowadays.","timestamp":"2011-12-13T20:16:19.000-08:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":2}
{"author":"Devz0r","body":"And reduce is better than reuse.","timestamp":"2011-12-14T05:56:43.000-08:00","score":6,"subreddit":"xkcd","ups":6,"daytype":"weekday","day_of_week":3}
{"author":"nomad42184","body":"Your question is unclear.  Perhaps you could provide more detail, or ideally, a code example of what you have in mind?","timestamp":"2011-08-06T12:11:27.000-07:00","score":2,"subreddit":"scala","ups":2,"daytype":"weekend","day_of_week":6}
{"author":"atomic1fire","body":"I suppose this is only untrue if you are using specific apps.\nMicrosoft office supports both mac and pc, (which is just an really stupid way of saying mac and windows, considering PC means Personal computer, are macs not personal?)\nand for roughly most of the uses, aside from some little things mac's work fine with office.\nSafari isn't the best choice on windows, extensions make it better but it's not going to be used by most people except developers who need to account for mac users.\nTheming and userscript support would probably help but it's not going to happen.\nGarageband and all those other fancy things just encourage designers to buy macs.\nI don't have a problem with mac's aside from them being expensive, because they work pretty well if you aren't using an old one with one button and an over dependence on finding that one key that makes the context menu appear.\nIf you can afford it and want a mac, why not?\nIt's not like a Nike shoe where it's made in some third world country but SWOOSH makes you better at everything.\nIf a mac has what you want in it, go ahead.\nI'm mostly a windows user, but will use whatever OS does what I need at the time.","timestamp":"2011-08-05T00:49:59.000-07:00","score":1,"subreddit":"xkcd","ups":1,"daytype":"weekday","day_of_week":5}
{"author":"JustAn0therDude","body":"I don't know what a Gaems is, but there are several games available on osx. Is steam on Linux yet?","timestamp":"2011-08-05T07:54:09.000-07:00","score":3,"subreddit":"xkcd","ups":3,"daytype":"weekday","day_of_week":5}
{"author":"irrelevantPseudonym","body":"I never understood the 'PC = windows' line of thought.","timestamp":"2011-08-05T02:14:14.000-07:00","score":6,"subreddit":"xkcd","ups":6,"daytype":"weekday","day_of_week":5}
{"author":"jrandom","body":"You get your Allowed To Complain About Everything card when you turn 35. It's useful!","timestamp":"2011-08-05T14:01:47.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"yesipooptoo","body":"Didn't you die of it 15 years ago?","timestamp":"2011-08-05T04:37:41.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"seanmg","body":"no just in general, I needed something to do that, but didn't know if there was any programs for space management.","timestamp":"2011-08-05T11:48:07.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"ohwowlovely","body":"Contact them via email. USPS apparently lost my order, so I just sent an email and about a week later I finally got them (EU).","timestamp":"2011-08-05T06:31:21.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"atomic1fire","body":"you know eudora ose is just thunderbird with extensions right?","timestamp":"2011-08-05T03:19:50.000-07:00","score":2,"subreddit":"xkcd","ups":2,"daytype":"weekday","day_of_week":5}
{"author":"Duals902","body":"Guess I should've specified, I just plan on completing a nicely compiled family tree, with as many photos, birth dates and death dates as I can compile.\n\nI've messed around with ancestry.com. is this the preferred technology/website? I assume I need to start with my great grandparents dates if I use ancestry. ","timestamp":"2011-08-06T18:33:18.000-07:00","score":1,"subreddit":"Genealogy","ups":1,"daytype":"weekend","day_of_week":6}
{"author":"adrianix","body":"And then you'd make a real tiling WM to interoperate seamlessly with \"gonad\", like [scrotwm](http://scrotwm.org/).\n\nI can see the tagline: \"Scrotwm, excellent spport for gonad\".","timestamp":"2011-08-05T04:03:55.000-07:00","score":12,"subreddit":"xkcd","ups":12,"daytype":"weekday","day_of_week":5}
{"author":"thesolitaire","body":"Would be better to submit this as a link, rather than a self post.","timestamp":"2011-08-06T10:48:58.000-07:00","score":1,"subreddit":"Genealogy","ups":1,"daytype":"weekend","day_of_week":6}
{"author":"Jaegrqualm","body":"I swear there's a ChromeOS joke in here somewhere...","timestamp":"2011-08-04T22:09:11.000-07:00","score":23,"subreddit":"xkcd","ups":23,"daytype":"weekday","day_of_week":4}
